{
  "mc_avg_user_score": 5.9,
  "mc_metascore": 50,
  "mc_mixed_rating_frequency": 30,
  "mc_movie_name": "True Story",
  "mc_negative_rating_frequency": 8,
  "mc_positive_rating_frequency": 24,
  "mc_pro_critic_reviews": [
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 88,
      "summary": "The courtroom scenes are unapologetically over-the-top and sometimes excruciatingly exact in the details of the\r\nmurder, but you won’t soon forget Franco’s expertly nuanced performance. It’s as good as any work I’ve seen in a film in 2015, and True Story is one of the better movies to come along this year."
    },
    {
      "critic": "Katie Walsh",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2015
      },
      "score": 83,
      "summary": "The film is exceptionally well-made... There is nothing warm about the style, yet it allows for moments of simmering tension, broken by a few emotional explosions that shatter its well-composed surface."
    },
    {
      "critic": "David Hughes",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2015
      },
      "score": 80,
      "summary": "The former comedy co-stars (Knocked Up) are superbly cast in this fascinating, fact-based story."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 75,
      "summary": "True Story may someday be used in both acting and journalism classes, the former for what students should do, and the latter for what they shouldn't."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 75,
      "summary": "Those looking for a clear-cut chronology of how the murders happened are destined for disappointment. Flashbacks of the crime are short and ambiguous."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 75,
      "summary": "While the movie sometimes seems like faux Fincher, the symbiotic acting, artful imagery and punchline ending turn True Story into credible entertainment."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 75,
      "summary": "True Story marks the directorial debut of Rupert Goold, a respected British theater veteran who also co-wrote the script and knows how to engage the viewer with simple scenes of two people talking (with a few modifications, this could have easily been a play)."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2015
      },
      "score": 75,
      "summary": "The reporter/convict dynamic doesn’t have enough layers to carry the film without some hint of mystery. The relationship between the two, chilling as it is, never raises this “Story” from generic to profound."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 70,
      "summary": "True Story never really soars in the way it might, but the performances more than keep it aloft."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2015
      },
      "score": 70,
      "summary": "While never as gripping as a good piece of fiction, Goold’s treatment actually manages to improve on the book, even if that meant fabricating a few things along the way."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 67,
      "summary": "Director Rupert Goold keeps things appropriately creepy, but True Story is no “Capote.” It’s all buildup with little payoff."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2015
      },
      "score": 67,
      "summary": "The meat of the movie is the behind-bars rendezvous between Finkel and Longo, whose interactions raise questions of journalistic responsibility and the banality of evil. But when a closing block of text announces that the two men still talk on a semi-regular basis — a surprise, given the finality of their last on-screen meeting — it’s hard to shake the feeling that a truly complex liaison has been reduced to an acting exercise for a couple of moonlighting funnymen."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2015
      },
      "score": 67,
      "summary": "The problem with True Story is that you wish there were more of it. The philosophical questions it encourages are like the tail that wags the dog. The truth becomes something of an obfuscation, and unlike films such as \"Capote\" and \"Infamous,\" there’s not enough drama about the compulsive relationship between the writer and his felonious subject."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 63,
      "summary": "True Story is an intrinsically fascinating and occasionally riveting tale marred by unnecessary embellishments."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 63,
      "summary": "What pulls us in are the performances of Franco and Hill, who know how to hold and reward the camera's tight scrutiny. They play a riveting game of cat-and-mouse."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2015
      },
      "score": 63,
      "summary": "If the film's copycat visual artistry illuminates nothing, at least its script is sincerely devoted to probing Finkel and Longo's odd partnership."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 60,
      "summary": "If nothing else, True Story is the kind of movie that will spark spirited discussion among moviegoers prone to digging and searching for the truth -- whatever that might be."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 60,
      "summary": "There’s enough unfulfilled possibility in True Story to make it an intriguing introduction to this story of deception and self-deception, but the balance between true-crime cable soap and the darker, richer layers of Franco’s performance never quite adds up."
    },
    {
      "critic": "Tim Grierson",
      "publication": "Screen International",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2015
      },
      "score": 60,
      "summary": "Lead performances from Jonah Hill and James Franco are plenty impressive. But at the same time, True Story is almost too polished and clever for its own good, sacrificing complexity for a surface-y examination of the issues at play."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2015
      },
      "score": 60,
      "summary": "No one in the film is particularly likeable, and while the global implications about epistemology are interesting, the specifics of this particular case, at least rendered here, are quite dull."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2015
      },
      "score": 60,
      "summary": "Goold's work never feels stagey; a smart and varied visual sense opens up even settings as basic as a jail's visiting room. But what happens in that room isn't as convincing as might be expected from these actors."
    },
    {
      "critic": "Jeff Baker",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 58,
      "summary": "True Story, made with obvious seriousness by talented professionals, never establishes itself."
    },
    {
      "critic": "Gregory Ellwood",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2015
      },
      "score": 58,
      "summary": "While Longo's actions were horrifying and his connection to Finkel is unique, Goold somehow can't make this material as interesting as you'd expect it to be."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 50,
      "summary": "Never mind the facts. True Story, slick and shaky, doesn't know where the truth lies."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 50,
      "summary": "This mannered, muddled drama about journalistic lapses and worse, crimes, stars comic buddies Jonah Hill and James Franco (This is the End) in a decidedly unfunny story."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 50,
      "summary": "The real problem with True Story is contained in its title. The story isn’t too good to be true, but rather too true to be good."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 50,
      "summary": "Unfortunately this \"Story\" never finds its footing as either a creepy morality play or a performance-driven two-hander."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 50,
      "summary": "True Story, which leads with its chin from the title on down and which turns a startling tale of true crime and false identities into a heavy-breathing drama that, ironically, fails to convince."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 50,
      "summary": "True Story is a case of a well-crafted film, made by a first-time feature director with an impressive theatrical pedigree, that nonetheless struggles to locate the reasons for telling its story."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2015
      },
      "score": 50,
      "summary": "True Story trips and stumbles so much in the telling that you don’t know what to believe, and instead of one man’s irony you end up with two men’s lies."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2015
      },
      "score": 50,
      "summary": "Goold, a highly regarded British theater director making his debut feature, lacks the panache to realize this twisted relationship onscreen. Instead he’s made a stolid, well-acted, intelligent drama that respects the complications of Finkel and Longo’s storytelling agendas without bringing them to life."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 40,
      "summary": "The real story of Christian Longo and Michael Finkel might be a fascinating and disturbing tale of crime, curiosity and journalistic ethics, but that’s not what this movie is."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 40,
      "summary": "True Story is a prisoner of its own dull storytelling."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2015
      },
      "score": 40,
      "summary": "It’s made with too much slickness, and you’ll be way ahead of it."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2015
      },
      "score": 40,
      "summary": "Especially for a movie that springs from a horrific and grisly crime, True Story feels undershaped and indistinct; it’s too dispassionate to be genuinely chilly."
    },
    {
      "critic": "Glenn Kenny",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 38,
      "summary": "If this mess is what they ended up with after erring with the best intentions, I feel bad for them. If this is actually the end result they were going for, I’d be inclined to use the legal system myself, to file an injunction against them ever getting near a soundstage again."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 37,
      "summary": "Writer-director Rupert Goold, here making his feature debut, fails to capture the chemistry and tonal complexity necessary to make this grim, often grisly tale anything more than a tragically lurid anecdote."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 30,
      "summary": "Far from rising to the level of truthiness, let alone truth, True Story rings false from start to finish."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 20,
      "summary": "There’s only one good scene in True Story, though it’s the most flagrantly absurd."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "summary": "Franco’s distancing routine helps sink True Story, an already turgid and tone-deaf adaptation of a self-serving memoir by a disgraced New York Times reporter (played by two-time Oscar nominee Jonah Hill) who bonds with a murderer he’s trying to exploit."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "Just when I am in despair that all that’s available in theaters these days are violent car chases and silly superhero movies, I discover a quiet but intense duel between two very fine young actors (Jonah Hill and James Franco) playing a disgraced reporter and a supposed serial killer searching for what exactly “true” is. The scenes between the two actors are wonderful and are never boring, and the movie only falls down a bit in the end at the accused killer’s trial when reality has to intrude. All the smaller parts are very well-acted from a solid script with smart, unobtrusive direction.",
      "total_reactions": 3,
      "user": "GinaK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "Led by two very capable performances from Jonah Hill and James Franco, True Story is set up for success with Rupert Goold's David Fincher-influenced direction. It's effectively slow paced - however, with very little punch for conclusion.",
      "total_reactions": 1,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "True Story is by-the-numbers crime/thriller that features two great performances (Jonah and Franco), an engaging story that is although familiar, yet it works.",
      "total_reactions": 1,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "true story is pretty good especially on the part of Jonah Hill and James Franco who deliver excellent performances. I think it largely appealed to side of me that enjoys the show Law and Order even though that show is slightly different in tone and story structure.it's downside is it's ending which left me feeling confused as to the point of the overall movie and the scenes with Felicity Jones (apart from one) come off as dull and unneeded and i didn't feel the chemistry between her and Jonah Hill. still think I would recommend it",
      "total_reactions": 1,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "James Franco and Jonah Hill are strong, young actors and it's their performances that help make this movie watchable. Unfortunately it gets bogged down in a convoluted narrative that really doesn't live up to its title...\"True Story\". It just seems very contrived and fake...more like a made for 2nd tier cable movie. Felicity Jones is a stand out here in the supporting role of Mike Finkel's wife.",
      "total_reactions": 1,
      "user": "WJS"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "A must see movie, Franco is amazing and Hill and Jones were perfect. Finally something different and intelligent at the theaters. Rupert Goold present a film that will have you thinking for days. It's about the slippery slope between fact and fiction mixed with mystery and great acting.",
      "total_reactions": 3,
      "user": "gatorsrock"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 1,
      "text": "True Story is a sleeper. No really, it almost put me to sleep. A disgraced reporter- doing a Brian Williams- forms a symbiotic relationship with an alleged killer to save his career and find himself. Motivations ring false. Hill and Franco drone on and on—with Felicity Jones as a wooden wedge between this blossoming bromance. All involved take center stage exploiting the victims- a mother and her three young children- for personal gains - including the producers of a very unnecessary story to be told. It’s rare I despise every character on screen. And the fact that all three are still in each others lives - is sick - I swear.",
      "total_reactions": 4,
      "user": "hotfromcauldron"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "Despite a stylish atmosphere and finely nuanced performances by James Franco and Felicity Jones, this mystery-courtroom-biopic offering feels rather incomplete, both for the investigator seeking the truth and for the audience seeking the truth behind the investigator. The film's deliberately slow pacing gives the audience hope that it will eventually be led to a satisfying conclusion. Instead, viewers are largely strung along toward an ending that leaves open almost as many questions as it answers.",
      "total_reactions": 2,
      "user": "Brent_Marchant"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2015
      },
      "score": 2,
      "text": "Flat out boring. The trailer suggests much more to the story, but it simply isn't there.  Definitely pass. And Franco? Ugh.  All he does is squint to act.  Pass.",
      "total_reactions": 2,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "An overall solid film that kept me captivated throughout.  I think one big flaw is James Franco is missed cast.  This just doesn't fit his strengths as an actor.  The story in the long run is what really worked for me.  B",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "Well done! Interesting and thought provoking. Understandable that bad reviews are coming from other journalists. Could the New York Times be anymore obvious that their review was personal? Ridiculous. This movie is really good. Deserves a 10 rating.",
      "total_reactions": 1,
      "user": "themoviestar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2015
      },
      "score": 1,
      "text": "This movie is somewhere in between bad and terrible and I can't decide which. I thought that the plot was building up to a Tyler Durden, I-don't-really-exist thing. But it was really just Jonah Hill having a weird man-crush on James Franco and then nothing happens; no twist, no suicide, no nudity. Come on! Give us something!",
      "total_reactions": 1,
      "user": "kussygonzalez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2015
      },
      "score": 4,
      "text": "This film is based on actual events about an accused killer (James Franco) who assumes the name of a disgraced New York Times reporter (Jonah Hill). Once they meet, most of the movie is spent with the prison encounters between them…and it's pretty mild. While the premise is interesting, the film lacks tension and (ironically) good writing. It doesn't help that Franco intentionally plays his character with blank emotion, which instead of coming off sinister, just reads flat. Hill is equally inert. The story has the potential for a gripping game of truth vs. lies, but the bland direction, lackluster script and uninspired performances dull this story.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "True Story is entirely underwhelming. It is honestly the type of film that ends and make you wonder if that was really it. The story, as is, is quite captivating and really gets you hooked in, but it is so poorly told and then just kind of...ends that the movie never rises above being just something you spent an hour and a half watching. It truly is a film that redefines mediocre and average. Jonah Hill and James Franco are fantastic, but get stranded in the sea of mediocrity and, though they try their best, the film is just so mediocre in the way it communicates with you that their performances go to waste. As an overall picture, True Story just gets in its way too much and its muddled method of telling you the story will leave you largely confused and scratching your head as to where the compelling premise and story went.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2017
      },
      "score": 6,
      "text": "If you're looking for a film to reaffirm your belief in all the nauseating evils of the world, you may have found the right product in Rupert Goold's \"True Story.\" It's got all the makings of a solid journalistic thriller -- magnetic performances, thematic intrigue, a realistic and grounded aesthetic -- but dear God was this a chore to watch; especially towards its gut-wrenching finale. Take \"The Insider,\" introduce it to \"Henry: Portrait Of A Serial Killer,\" and wait around for nine months to get this corrupt lovechild of the two. A valid, passionate effort on all fronts, but an effort that i'd rather never see again.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2017
      },
      "score": 6,
      "text": "About a man who has nothing to lose and a man who can't afford another failure!",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2015
      },
      "score": 3,
      "text": "The acting in this movie was high level, very emotional and a calm storm at times.  The biggest killer for me is that the events take place between 2001 and 2003, yet the characters have smartphones.  Jill Barker (Michael Finkel's Girlfriend) has an iPhone, a phone that did not come out until 2007.  This alone kills it for me, check your facts, especially if it is a \"True Story\"!",
      "total_reactions": 0,
      "user": "SeanChris"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "True Story is directed by first time director Rupert Goold and stars Jonah Hill and James Franco. The film is based on the true story of Christian Longo (Franco) and adapted from Michael Finkel’s memoir of the same name. Longo, a perceived “regular guy” who is accused of the murder of his wife and three children. It is believed that Longo committed each of the murders and he fled to Mexico, but when he was found by police he used the identity of Michael Finkel (Hill) a recently fired writer for the New York Times. When Finkel hears of this story he visits Longo in prison with the intension of getting his writing career back on track by writing an article on Longo. The performances from both the stars in this film are great and it is the scenes where Hill and Franco are the only two characters present that really shine. It is now known that Jonah Hill can have a dramatic side after roles in Moneyball and The Wolf of Wall Street, both of which earned him Academy Award nominations for Best Supporting Actor. Despite his ability I was questioning Hill’s ability to play a lead in a drama but after watching the film I think that Hill’s performance is the best in the film and I would like to see him take another lead in a drama film. James Franco is also known to dabble in both comedy and drama and his performance as Christian Longo is strong. Franco looks prepared for the part from the outset and looks like a man who cannot be trusted but he really didn’t hit the performance out of the park like I had hoped. Christian Longo is mysterious enough that if James Franco had given the role 100% effort I think it could’ve resulted in a Oscar nomination. Felicity Jones, is also in the film playing Michael Finkel’s wife Jill, but she is certainly underused. Jones was following up a Oscar-nominated breakout performance in The Theory of Everything and she was recently cast as the lead in the first Star Wars Anthology film so this young actress looks like an up-and-comer but just didn’t get enough screen time to really shine. The film really builds up tension well throughout the film but the ending occurs a little too sharply for my liking and really doesn’t have the huge climax that I was expecting. It seems like the film was limited to only 99 minutes of running time and could not be any longer. I think another 10-15 minutes would’ve worked wonders for this movie. That being said the performances are what make this movie fresh and although its reach may exceed its grasp it is still a film worth watching for a crime movie fan.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "True Story is a surprisingly unsettling, thought provoking film and it happens to be one of my favorite movies of the year so far. True Story moves at a slow pace but rarely drags, it’s very well written and shows off some great acting performances from Jonah Hill and a career best from James Franco. This is a great movie",
      "total_reactions": 0,
      "user": "Movi3R3vi3wer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "James Franco was the standout actor as a convicted serial killer. His effective performance was the highlight of this intricate murder mystery. Jonah Hill should also be lauded as the disgraced New York Times journalist, who tries to regain his career and find a job. Not a top rate thriller, but well worth seeking out on premium TV channels, on DVD or on demand.",
      "total_reactions": 0,
      "user": "Pablo6120"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "Despite solid acting from the three main cast members (James Franco, Jonah Hill, and Felicity Jones), the movie lacked enough depth or nuance to make it interesting.  It starts in more or less the same place it ends, and neither of the male leads is at all sympathetic.  There is no twist, no turn, no real movement in plot or in the perception of any of the characters, and nothing in the struggling romantic relationship between Jonah Hill and Felicity Jones is fleshed out; possibly the most interesting thing to watch in this movie is the beautiful house in the woods they live in.",
      "total_reactions": 0,
      "user": "heatherm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2015
      },
      "score": 4,
      "text": "You might worry about the notion of a Jonah Hill & James Franco film that’s not a comedy, despite the fact that both have proven dramatic chops, but the performances from the 2 leads are nuanced enough to prevent them from being the main issue with ‘True Story’.",
      "total_reactions": 0,
      "user": "FilmPhonic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2016
      },
      "score": 6,
      "text": "Decent movie, based on real life events as I understand. Did feel a bit weird having both Franco and Jonah Hill in the same movie and them acting serious - at some times it did not work that good really as I consider both more of a comedy/adventure movie type, even if Hill has many serious movie credits. Anyway, the story of the movie was ok, but I think it does not really work as a movie that well as it lacks some of the action and story going forward. A lot of the movie felt like it was streched out and that is never good.",
      "total_reactions": 0,
      "user": "Ralfbergs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "'True Story' is not going to be one of the greatest movies of all time, nonetheless 'True Story' represents a breath of fresh air in this summers box office. The movie features exemplary dialogue between Hill and Franco and see's the pair develop the relationship between their characters well. The ending of the movie seems to be hasty, moving from an engaging dialogue to a swift conclusion, dragging down the films score. It remains however that 'True Story' is worth a watch to those who like to think and engage with a film, oppose to thrill seekers who may find it a dull affair.",
      "total_reactions": 0,
      "user": "EmperorJules"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "Franco, Hill and Jones delivers an impressive performance. Goold gives the movie amazing, almost creepy undertones. With some soft-spoken, but grasping scenes the movie really is extraordinary.",
      "total_reactions": 0,
      "user": "VincentLie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2016
      },
      "score": 9,
      "text": "This movie to me was intense, emotional, and extremely well acted. Though it may not be very eventful, it doesn't really need to be. The events in this movie are manipulative acts between the characters.",
      "total_reactions": 0,
      "user": "jakebondy61"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2015
      },
      "score": 5,
      "text": "To start off I am a huge James Franco and Jonah Hill fan.",
      "total_reactions": 0,
      "user": "LORDFILM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2016
      },
      "score": 6,
      "text": "While the story line seems like a hit: man is accused of murdering his wife and three kids - but he's innocent, maybe, and a disgraced New York Times reporter is hot on the trail, the movie itself is a miss.  Just didn't feel any tension build up, no mystery, no saving grace.",
      "total_reactions": 0,
      "user": "smiyamot"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2016
      },
      "score": 6,
      "text": "Led by two very capable performances from Jonah Hill and James Franco, True Story is set up for success with Rupert Goold's David Fincher-influenced direction. It's effectively slow paced - however, with very little punch for conclusion.",
      "total_reactions": 0,
      "user": "aadityamudhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "The beginning of the movie was gold, but near the end the movie started to look like it was botched and just a waste... Actors are good, costumes are good too, everything is good, if only the script near the end would have kept consistency, it would probably have been one of the best movies I'd have watched in 2016.",
      "total_reactions": 0,
      "user": "JSkellington"
    }
  ]
}