{
  "mc_avg_user_score": 7.8,
  "mc_metascore": 80,
  "mc_mixed_rating_frequency": 66,
  "mc_movie_name": "True Grit",
  "mc_negative_rating_frequency": 31,
  "mc_positive_rating_frequency": 548,
  "mc_pro_critic_reviews": [
    {
      "critic": "Angie Errigo",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2011
      },
      "score": 100,
      "summary": "Terrific: tough, exciting, funny, gorgeous and bewitchingly acted, this is darn close to perfection."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 100,
      "summary": "In some ways, much like Charles Laughton's \"Night of the Hunter,\" which the Coens quote both musically and visually, True Grit is a parable about good and evil. Only here, the lines between the two are so blurred as to be indistinguishable, making this a true picture of how the West was won, or - depending on your view - lost."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 91,
      "summary": "The Coens direct True Grit with a light touch, but like Portis' stark, funny novel, their adventure tale shaves off none of the rough edges."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 91,
      "summary": "On its own conventional terms, the film succeeds – maybe not as a \"Coen Brothers\" movie, but as a tall tale well told."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 90,
      "summary": "The first hour and half or so of True Grit is as good as anything the Coens have ever done-a sweeping Western that, like John Ford's best films, exposes the cracks in American myths of frontier justice and self-reliance."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 90,
      "summary": "When Iris DeMent's impeccable version of the hymn is heard on the soundtrack as the final credits roll, it's the perfect touch to end a film whose aim is always true."
    },
    {
      "critic": "Pete Hammond",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 90,
      "summary": "Smartly emphasizing Portis' quirky dialogue and dark comic tone, the Coens show the flare that made them famous."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "The original \"True Grit\" might have been eclipsed by John Wayne's larger-than-life persona, but the Coen brothers' remake is an ensemble piece that feels freshly their own."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "What makes True Grit a new classic for the Coens is the way the brothers absorb the unfairly unsung Portis into their DNA, like they did with Cormac McCarthy in \"No Country for Old Men.\" True Grit is packed with action and laughs, plus a touching coda with an older Mattie, but it's the dialogue that really sings. Great filmmaking. Great acting. Great movie. Saddle up."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "True Grit is just a couple bloody gunfights removed from an old-fashioned Disney yarn. Yet it's still unmistakably a Coen brothers movie, from the stray weirdness of a bearskin-clad dentist to the bulls-eye delights of the dialogue."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "True Grit is probably the least ironic picture in the Coen Brothers' worthy canon, but that doesn't mean it's devoid of their signature oddities, that it doesn't take a few dark, strange turns."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "Those of us who admire Charles Portis' novel have waited 40 years for a screen version that's as literal as possible – and the Coen brothers just about deliver it."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "This is a film by the Coen Brothers, and this is the first straight genre exercise in their career. It's a loving one. Their craftsmanship is a wonder. Their casting is always inspired and exact. The cinematography by Roger Deakins reminds us of the glory that was, and can still be, the Western."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 88,
      "summary": "The Coens have fashioned one of the best Westerns in recent years - a modern reworking of a classic that never feels superfluous."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 85,
      "summary": "Mattie is a no-nonsense mite with a forthright manner and a mean head for figures; she wears her hair in two sturdy braids whose tips have never seen the inside of any inkwell, believe you me."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 83,
      "summary": "True Grit is a very good movie that might be more embraceable if we didn't know who was pulling the trigger."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 83,
      "summary": "A fine, straightforward and engaging film that restores the salt, fire and humor that Hathaway and company drained from their source, Charles Portis' wonderful 1968 novel."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 83,
      "summary": "Truer than the John Wayne showpiece and less gritty than the book, this True Grit is just tasty enough to leave movie lovers hungry for a missing spice."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "The tense verbal comedy of Mattie's early negotiation with a Fort Smith merchant should win you over to this movie's high linguistic wit. If not, you may as well slip out of the theater and into \"Little Fockers.\""
    },
    {
      "critic": "J. Hoberman",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "For the most part, the Coens' is a highly enjoyable yarn, stocked with pungent bushwa and a full panoply of frontier bozos."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "A winning western with just a few dark eddies beneath the surface, one that features a star-making lead performance and some spectacular photography, but falls just short of being great."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "A wonderfully entertaining, beautiful Western drama that lets the quirks of the genre gallop freely as it keeps a tight rein throughout."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "This remake by Joel and Ethan Coen is being positioned as a truer True Grit, and though they take their own liberties with the plot and tone, they preserve Portis's impeccably authentic dialogue, which does more to conjure up the Arkansas of the 1870s than any period trappings."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "A gorgeously shot, well-acted Western that resonates more the more you let it settle."
    },
    {
      "critic": "David Fear",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "To make a Western now is in itself a subversive act. Improving, embellishing and reclaiming an old-fashioned oater from the vintage studio-cheese bin with such humor and vigor seems truly, truly ballsy."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "True Grit isn't as momentous an event as you might hope, but once you adjust to its deliberate rhythms (it starts slowly), it's a charming, deadpan Western comedy."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "Well-made and acted Coen Brothers remake lacks the humor and resonance that might have made it memorable."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2010
      },
      "score": 80,
      "summary": "Rather than a case of the Dude doing the Duke, Bridges' irascible old cuss is a genuine original who feels larger than the familiar saga that contains him."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "As usual, the Coens' visual elements are pristine. The contrasting colours in the fire-lit interiors are gorgeous, while cinematographer Roger Deakins keeps the camera close, resisting traditional panoramic views."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "If there's one big difference between this version and the old, it's in the attitude toward violence. The new version may be more graphic, but it doesn't present violence as inevitable or necessary, just ugly."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "True Grit has sweep and scope and entertainment value to burn, but it's Mattie who invests even the grandest aesthetic elements with meaning."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "This is a dirty, stinky Western -- the kind where authenticity is the guiding artistic hand and where a layer of filth and grime have seemingly settled over everything but the popcorn in your lap."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "It isn't much of a contest: The clear winner is John Wayne, because the Coens are playing his game. The Duke couldn't do the Coens' sly in-jokes, but they've never been able to reach out and move the audience to heights of emotion. Before now, they've never tried."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "The best way to approach Joel and Ethan Coen's eagerly awaited True Grit is to lower your expectations, then lower them a bit more. The problem is not the movie, which is a terrific, no-nonsense, straightforward western. The surprise – or vague disappointment – is the prevailing lack of Coen-ness in the movie."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "The biggest change from the '69 \"True Grit\" is the best thing about this formidably well-crafted picture. Portis's narrator and heroine, 14-year-old Mattie Ross, runs the show this time, not the one-eyed marshal."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "Matt Damon is an interesting, chatty choice to play  Laboeuf."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2010
      },
      "score": 67,
      "summary": "All this is not to say that the Coens' True Grit is an awful film; it's just that these filmmakers have set their own standards for excellence, and True Grit falls short."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 63,
      "summary": "This isn't a rousing movie as much as a reassurance. The brothers (Coens) prove they can play it straight, but they're preferred, for better and worse, at a sharp angle."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "Remaking a cherished movie is not, to borrow a fancy phrase from the dialogue, malum in se - wrong in itself - but there are always losses along with the changes and gains."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2010
      },
      "score": 25,
      "summary": "The original western won John Wayne a puzzling and undeserved Oscar for finally falling off his horse. Don't expect the same miracle for Jeff Bridges. In the numbing hands of pretentious filmmakers Joel and Ethan Coen, history does not repeat itself in any way whatsoever."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "One of the great new westerns. Great directing, a good storyline, and great acting make this movie a worthwhile trip. Jeff Bridges and Hailee Steinfeld were both great in their own different ways, and Matt Damon was good as well. Even better than the classic original!",
      "total_reactions": 4,
      "user": "ReviewCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "I haven't read the source novel, but I did see the 1969 movie and am not quite sure which I like better....I'll have to rent that one again.  I did like this movie almost as much as some of my favorite Coen films, such as Fargo and Blood Simple, and much more than No Country For Old Men (to be fair, that movie was very faithful to the novel, which I read, and I felt the movie contained all the same problems as the book).  The crafting of the film is excellent, with my only problem being that the actress portraying the older Mattie looks nothing like 14 year-old Mattie....Scanning the critics' reviews, I see the only one who really didn't like it is Rex Reed, and that is probably because there is no hint of male homosexuality in the movie.",
      "total_reactions": 1,
      "user": "dogdanz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "The best thing about this movie was the acting. Jeff Bridges was fantastic! The film was set in a believable location with long drawn-out silences which added plenty of suspense.",
      "total_reactions": 1,
      "user": "J42Hmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "Even if you struggle to understand what Bridges is saying (you will) it is impossible to deny his and the movie's charm. The movie is filled with great acting and scenes that don't scream HERE TAKE SOME ACTION ACTION ACTION but more rely on great plot and acting, with of course enjoyable action in good dose's. I loved this movie and will no doubt watch it again!",
      "total_reactions": 1,
      "user": "Guivera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "This movie was amazing. Going back to old cowboy movie style like the good ol' John Wayne days. Their hasn't been a good cowboy/western movie in quite sometime. True Grit was superb. Jeff Bridges with his successful job as the witty Sheriff performed an Oscar worthy performance. Matt Damon did a great job as the lone Texas ranger, and the always awesome Josh Brolin as Tom Chaney, but the biggest breakout performance was by Hailee Steinfeld as Mattie Ross, she did an amazing job and shouldve won the Oscar, especially for being so young, she has a very promising future. This movie was so good it has to be illegal to give it a bad review, 10/10 without a doubt.",
      "total_reactions": 1,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "This movie was a lot of fun to me. None of the characters are overally lickable but you find yourself cheering for them. The scenes are shot very well and the acting is solid throughout including a very strong performance by Hailee Steinfeld who plays Mattie Ross. There are some humorus scenes and they flow well from the plot. It is important to view this movie seperate from its 1969 counter part otherwise you may fall to much on your nostalga and miss a very well done film.",
      "total_reactions": 1,
      "user": "moviegrabbag"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "Solid western that I would easily say is better than the original (sorry, Duke). Fantastic acting all around (Barry Pepper didn't get the credit he deserved) and the Coen's weave poetry in every inch the camera touches. Great film.",
      "total_reactions": 1,
      "user": "TheDaveHimself"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "The first decent movie I have seen in years.",
      "total_reactions": 8,
      "user": "harrison"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "The Coen Brothers succeed in crushing the original 1969's and establish their own profound, ethnic translation of the western movie \"True Grit\". They erase the 'exaggeration' in western cinema and rewrites it as \"legend\" with their hands. Followed with the Oscar worthy performances from Damon and Bridges, \"True Grit\" is overall decent (In the standard of the Coens) but a efficient, well made western movie.",
      "total_reactions": 6,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "My wife and I are getting up there in years, and it's great that there are still movies that fit our demographic. As for being a \"remake\"  I feel the movie lived up to the hype and then some! All the performances ran circles around the originals, no question. Leaving in the original \"fill your hands\" line intact was a nice (respectful) touch that seems to have flown over more than a few heads.   As for rambling, seemingly inconsequential dialogue from Bridges, get over it! That's how aging people talk. The younger you are, the more bored you are by \"old people\" telling war stories. We ramble....because we have experiences. We are laconic and cynical.....because we earned that right.",
      "total_reactions": 12,
      "user": "oldfella"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "An amazing remake. Even without John Wayne, it is an amazing movie. So nicely down that it was totally worth the money i forked over for it. Cheers to Cowen Brothers. 10/10",
      "total_reactions": 3,
      "user": "AuraGuider"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "True Grit is the first western based film presented to us by the Coen brothers. The Coens combine their original and witty dialogue with incredible performances by top notch actors to create a film thats so engrossing that you're taken on a ride back in time with true outlaws. The plot centers on Mattie Ross (Hailee Steinfeld) whose father was shot and killed by a loner named Tom Chaney (Josh Brolin), who also made off with the father's 2 gold pieces. Mattie is determined at all costs to find her father's killer, and hires U.S. Marshal Rooster Cogburn (Jeff Bridges) to do the job. A Texas Ranger named La Boeuf (Matt Damon) arrives on the scene already hot on Chaney's trail over a murder he committed in Texas. The trio set off together in hopes of finding Tom Chaney before anyone else does. The plot delves in deeper than that of course, and it emerges as a true Western flick that actually works. While it doesn't involved all that heavily on action (minus a few great scenes), it's involved mostly on the characters and the experiences that they must face. With the Coen's classic dialogue (equivalent to Fargo) the slower paced scenes are genuinely enjoyable because the most random of conversations will occur and the outcome is either hilarious or heartwarming. Jeff Bridges is flawless and Oscar worthy portraying a Rooster Cogburn so exceptionally well that he completely overshadows John Wayne's portrayal multiple times over. Matt Damon is unrecognizable at first as a desperate Ranger though his times on the big screen are enjoyable especially the many quarrels with Bridges such as arguments on who is the better shot. Hailee Steinfeld is completely flawless as well. Her portrayal of a headstrong 14 year old determined to track one man down is so spot on that I actually tricked myself into thinking I was watching an adult in the same role. The supporting roles of Josh Brolin and Berry Pepper were great as always, although their screen time was dwindled down to only a small percentage, but both of their roles are great. The many different camera angles the Coens use really outlay a vast and open landscape to the many different types of crimes committed there. The pacing is slick and perfect. The many action scenes are great and house outstanding shootouts and they aren't as heavy on the violence as the earlier Coen brothers films. In between the few key action scenes, there are the funny and enjoyable dialogue moments that keep the momentum in place and this style never falls flat. All in all True Grit really delivers a stellar experience that zooms through quick from beginning to end thanks in part to the great action scenes, and the truly flawless characters and dialogue. If you're in to look for a great Western film, this is the one true and great modern experience.",
      "total_reactions": 5,
      "user": "horrorboy"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "Overall Movie: 7 Acting: 9 Storyline: 8. Jeff Bridges brings John Wayne's great performance even greater, and fuels this great western. One of those remakes that is actually better than the original.",
      "total_reactions": 6,
      "user": "oscarr"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "I seldom give a movie \"10\" because it has to be wonderful in every way that cinema can be exciting and satisfying. This was it. I naively assumed that everyone would love this Coen extravaganza - how could they not? \"True Grit\" proves there is no accounting for taste. Perhaps it is love of the English language that holds this movie together and for people who could care less about language spoken wonderfully, it seems a pretentious Western. But if you haven't seen it, love language, like the Coens, Jeff Bridges, Matt Damon, and young fresh amazingly talented young actors (Mattie), do yourself a favor - put up your spurs, tilt back your Stetson, pour a shot of raw, eye-smarting saloon whiskey, roll up a Bull Durham cigarette, and get ready for a  wonderful treat.",
      "total_reactions": 4,
      "user": "Taplinger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "overall a good movie to watch if you like westerns..................................................................................................................................................",
      "total_reactions": 2,
      "user": "fijario"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "The Coen Brothers are American and this movie speaks to the culture and value of our country.  They are at the peak of their game and have been for quite a while.  True Grit is about the attempt to be heroic in the face of the realities of life, that is, filled with violence, randomness, personal failings and our questionable chances to control what happens to us.  There are potential traps with this story: if the girl is precious the movie can veer towards sentimentality and life is anything but sentimental.  Each of the characters show the balance that exists in people.  Rooster Cogburn is not heroic in most senses of the word.  He admits that he was a terrible father, he kicks the Indian kids off of the porch, he sets up a plan to help the girl while he pursues his money by attempting to catch the leader villain.  The Texas ranger is quite simply a doofus, and yet miraculously makes the shot with the rifle.  He doesn't re-enter the story.  Finally, the girl devotes her childish mind to revenge, which we should know, offers no reward but ashes.  She finishes as a one armed spinster, she is not cute and she finds solace only in her grit.  For me, I am old enough not to expect perfect heroic people or even a chance to act nobly in many situations, but the film shows perhaps what is the best that we can do.  Finally, the cinematography, much like Fargo or No Country for Old Men, shows the open spaces in a way that immerses the audience and reminds us of the beauty, the physical beauty, of America.  Most seriously considered art deals with the challenges that life presents us with, what to do with our lives, and as an American, I feel uplifted and excited each time I see the Coen Brothers attempt to illustrate the issue with a new filter, whether it be set in very un-Hollywood locations as Texas, Arkansas, Minnesota or North Dakota.  My son suggested that for the United States, the art form that is ours the most (apart of course from Rock and Roll) is film and that the brothers are our true geniuses of that art form.",
      "total_reactions": 2,
      "user": "Bulldog"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 2,
      "text": "I know I'm going against the grain... I know this movie is well liked by critics and patrons alike... But after watching this movie, I feel like the enlightened one in a sea of gullible moviegoers! Can anyone else appreciate just how TERRIBLE this movie was? First: the script plays on screen like it was written by a school child. Sure, there's some witty one-liners and laugh-inducing reparte now and then, but in the context of a (supposedly) serious film, these parts of the dialogue transpire with the feel of a cheap David Spade movie... (not that there's anything wrong with David Spade movies, it just doesn't belong here). Second: certain scenes of this move are ABSOLUTE GARBAGE, and do nothing in the way of character development or plot advancement! The man in the tree who Rooster Cogburn \"does not know\"... The painfully awkward, random meeting with the medicine man in the bearskin... the inane, often incomprehensible ramblings of Cogburn... the lame-ass cornbread shooting contest... Do you need another four WORTHLESS scenes from this film? I'd be happy to list them. Third: I think it would be fair to say that this movie *attempts* to portray a special bond between Cogburn and the little girl, Mattie Ross. To steal a line from today's youth: EPIC FAIL. Jeff Bridges is a (usually) great actor, and Hailee Steinfeld seems like a wonderful young actress. But taken together, these two have the chemistry of oil and water... Summary thoughts: This movie is boring, hamstrung by hollywood cliches, rather poorly acted, INCREDIBLY poorly written, has a very uninspiring \"gotcha, bad guy!\" moment, and perhaps shouldn't have even been (re)made in the first place. The 2 points I have awarded are for the (surely unintentional) entertainment value derived from the aforementioned campy one-liners, and overdone, humor-inducing melodrama... Enjoy, but probably if you're over 70.",
      "total_reactions": 11,
      "user": "JasonGoalie"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "Being a huge Coen Brothers fan, I was surprised to hear they were remaking True Grit.  I know they were fans of the original, but my experience with them made me believe they were going to take the original and improve it dramatically the Coen Brothers way.  Well...they didn't.  In fact, this was the most un-Coen Brothers movie I've ever seen.  Not to say that is a bad thing, but having just watched the original, I could have not seen this version entirely and not missed anything.  Being fans of the original, they clearly wanted to pay homage to the original.  In fact, dialogue and setting-wise, it was about a 90% carbon copy of the original, down to the shots, the script and the way the characters were portrayed.  The Coen Brothers really didn't do much to put their stamp on the film, except maybe the perfect casting.  Aside from very minor differences throughout the film (such as Mattie covering the chimney to smoke out the first couple of ruffians rather than LaBoeuf and having LaBoeuf interact with Ned Pepper the first time instead of Rooster), the only meaningful change in the script is the last 30 minutes.  I've never read the book, but the compliments given to this version is that it is more like the book.  That must mean the ending.  It is very different, and honestly, better than the original.  However, anyone could have done this film the way it was done.  The Coen Brothers didn't do anything to make this film special, so I'm grading it as an average film.  I hope they enjoyed making it more than I enjoyed watching it and I look forward to them returning to their style soon.",
      "total_reactions": 7,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2010
      },
      "score": 0,
      "text": "Infuriatingly bad, it's the worst Oscar bait in years.  The story's essentially a one-act play that's so boring I fell asleep.  Thankfully(?) the characters are so hollow that I didn't care what happened to them.  The dialogue is a mix of poorly delivered olde timey \"urgency\" and inane one-liners.  It wasn't funny, suspenseful, insightful, thrilling, or engaging in any way aside from a few seconds of nice cinematography.  It wasn't snubbed by the HFPA for Golden Globe nominations; they saw that it was a horrible crapfest of a movie totally worthy of zero accolades in exchange for the zero amount of entertainment it contained.",
      "total_reactions": 10,
      "user": "EthanPeter"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "This is by far one of the best westerns in many years. I highly recommend this film to anyone who enjoys classic films with great dialogue. What truly makes this a special movie is the acting of Hailee Steinfeld, she interprets a character that is wise beyond her years, this is a must see.",
      "total_reactions": 5,
      "user": "Edgar"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "Underneath the drawn out tension of the Coen's Brothers remake True Grit, is a subtle and lighthearted emotion led by the break out performance of Hailee Steinfeld. If you are expecting the eccentric storytelling and essential rawness seen in Fargo or No Country For Old Men, True Grit is ultimately uninspiring. But in this effort, the Coen brothers smooth out their usual sharp edges, in order to make a film that is pure and an effective homage to a once prominent genre in film.",
      "total_reactions": 5,
      "user": "RyanGee"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "The book and the 1969 original set very high standards for this Coen Brothers' Western drama, but as high as the standards were set, the Coen Brothers managed achieve the goals or better yet exceeded them. True Grit is about a drunken US Marshal and a **** Texas Ranger helping a stubborn 14 year-old finding her father's murderer. Rooster (Jeff Bridges) was offered $50 to find the murderer for Mattie, played by newcomer Hailee Steinfeld. Meanwhile, Texas Ranger Le Boeuf (Matt Damon) was offered a reward to find the same guy who also killed a Senator. Conflicting each other on the journey and finally catching the bad guy Tom Chaney (Josh Brolin), the three each developed their character skillfully. Jeff Bridges playing last year Crazy Heart's Bad Blake only with a gun and an eyepatch. Matt Damon used his own personal style to play this **** but humorous Texas Ranger. Hailee Steinfeld played a stubborn 14 year-old who's determined to find Tom Chaney and bring him to hang. Though expected performances from both Jeff Bridges and Matt Damon, newcomer Hailee Stenfeld was as good as her castmates. The one thing I kept in mind while going in this film was that Bridges and Damon are going to give applausable performances and Hailee Steinfeld was getting nominated for some major awards. But when I was finished, I didn't see what all the buzz was about. Sure, Steinfield was good, but compared to Bridges and Damon, she sure didn't have much. I have to say though, beating thousands of other girls for this role is impressive, but I'm sure other Hollywood stars had to do that as well. Even though I find her not as great as I hoped, she still delivered well.",
      "total_reactions": 5,
      "user": "OscarPicks2010"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "When i give this movie a five i am being kind because the absolute stupidity of this movie is unbearable to witness. It combines stupidity and bad acting into what is nothing more than a tart fruitcake",
      "total_reactions": 5,
      "user": "dubbleq"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 2,
      "text": "Man I can't believe this movie is in the running for best picture at this years Oscar!!! This movie was so BORING and un-entertaining! The acting was OK at best. I found that I couldn't Jeff Bridges! The way the movie was filmed was like it was filmed in the early 60's! Nothing in this movie impressed me even the 11 years old girl, whose been given great reviews from the movies critics failed to impress me!",
      "total_reactions": 5,
      "user": "HEI5ENBERG"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "Unfortunately this movie falls short of being worthwhile. Perhaps my expectations were too high--though how could they be \"too high\" with Bridges, the Coens, and the western genre--but True Grit felt bland and uninspiring. It certainly wasn't a bad film but I felt no tingling sensation of mental excitement that I get after movies I really enjoyed like after that first watching of No Country, for instance. The best moments of True Grit are few and far between. Ultimately despite the fact that this film is well shot and (generally) well acted, I left the theatre disappointed. I'm still trying to figure out what or who is to blame for that feeling...because it obviously can't be me:)",
      "total_reactions": 13,
      "user": "mckillustrator"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 2,
      "text": "I'm old enough to have seen the original and its not just an issue of \"why remake a John Wayne movie?\". I have to give Jeff Bridges some credit, he certainly has skill. Matt Damon however seemed to be an odd casting choice and a bit awkward in this kind of movie. Overall, the whole thing moved slow and therefore seemed to drag on. I left the theater feeling like I had wasted an afternoon and that there was no point in remaking this film. The original was excellent and this version brought nothing new.",
      "total_reactions": 6,
      "user": "David_H"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "What I loved: Matt Damon, the cinematography, the premise. What I liked: Jeff Bridges. What I didn't like: the incredibly slow story and the one-note main character (Mattie Ross). What confuses me: why this movie is getting such rave reviews. I suggest seeing it as a rental.",
      "total_reactions": 6,
      "user": "Allison"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2011
      },
      "score": 4,
      "text": "I didn't really like this movie. Jeff Bridges voice was annoying (too much groveling in his voice), and the scenery looked pretty bland (no vibrant sky colors or grass colors). The town scenes looked unauthentic and it seems as if some of the background was intentionally a bit off or blurry, so someone wouldn't focus on it I suppose.  The girl, Maggie spoke too sophisticated for a 14 year old, and seemed too rehearsed at times.  The old vigilante cowboys even seemed to speak this way at times, and it came off as unauthentic.  Maggie looked mixed race (white/black) and I'm wondering if this was intentional to appeal to a wider audience?  I definitely don't think that was the \"norm\" in the 1800's.  Whole thing seemed unauthentic and stiff.  Thumbs down on the scenery and acting.  Definitely didn't hold up to the original.  A much better western is The Quick and the Dead with Sharon Stone and Gene Hackman.  Hackman was born to play a cowboy and the scenery is perfect for that era and there was so much put into the visual effects of this movie.",
      "total_reactions": 6,
      "user": "Vypurr"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "Jeff Bridges was a great actor. He really put this movie on his shoulders. Matt Damon was also a great actor in his respective part. The dialogue dragged on a bit in the end but still a good movie in all. Good action scenes (especially when taking quality over quantity). Jeff and Matt for the Oscars!",
      "total_reactions": 3,
      "user": "elliott23"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2011
      },
      "score": 4,
      "text": "Compared to the John Wayne original, this version was so very ordinary.  Where the original had great scenery, music, acting and scriptwriting, this new version is very dull.  Jeff Bridges and Matt Damon are fine actors but their lines are very wooden and unemotional - a sign of poor direction.  The girl was pretty good but she couldn't save the movie.  Although the original is one of my favorite movies, I truly saw this version with an open mind, and didn't much care for it.  Why is this movie so highly regarded ?  I'm sorry but I think the Coen's are greatly overrated.",
      "total_reactions": 3,
      "user": "s053714"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2011
      },
      "score": 3,
      "text": "Sucked.  It is over-hyped, badly predictable, easily forgettable, utterly missable.  Don't bother with it.",
      "total_reactions": 7,
      "user": "podriscoll27"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2010
      },
      "score": 1,
      "text": "After reading all the glowing reviews from both critics and users on the website I was really expecting an amazing movie that would keep me entertained throughout. Instead, I was bored out of mind my for about 85% of the movie. The last ten minutes were decent, and that's it. I do not recommend.",
      "total_reactions": 7,
      "user": "davidp1045"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2011
      },
      "score": 2,
      "text": "Huge fan of the Coens but this film is an ineffectual copy of the original classic. The story line is barely changed and for the worse i must say. There is no chemistry of kinship between any of the over acting actors who all fall prey to the pitfall of their own stardom or that of the directors.",
      "total_reactions": 11,
      "user": "shaunmed"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2010
      },
      "score": 1,
      "text": "You'll need \"true grit\" to get through this one.  In a word - monotone.  Slow pace, too much dialogue (monologues), gratuitous violence, poor editing.  Scenes that should/could have been surprises were simply confusing because the film lacked story development.  We plodded from one ho-hum conversation to the next with a shot of violence dropped in now and then to [try to] break the monotony.  I'm a major Coen brothers fan but afraid they missed the mark here.  Spend your money if you need a  nap.",
      "total_reactions": 8,
      "user": "enigma13"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2010
      },
      "score": 1,
      "text": "You can put frosting on a turd, but it doesn't make it a cupcake.   This movie has no redeeming qualities.  I went in with great expectations and came out shaking my head in disgust.   Everything that made the original great is missing.  Bridges is no John Wayne.   I never knew just how well Kim Darby and Glenn Campbell played their parts until I saw Hailee Steinfeld's and Matt Damon's performances.   I have a collection of over 5,000 movies and there's no way I'd ever buy this turd.",
      "total_reactions": 8,
      "user": "LukeTravis"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 0,
      "text": "This movie sucked for the first hour!! It was about as exciting and interesting as a heinz ketchup commercial. The last hour was okay. Overall, I'd say skip it.  If you want to see a movie where they put adult words in children's mouths... then go see 'Kick Ass\" instead.  A precocious 14 yr girl just doesn't work. Damon and Brolin are just supporting roles... so don't go for them.  In case you're wondering... I loved 'No Country for Old Men\". This movie was a HUGE disappointment.",
      "total_reactions": 8,
      "user": "marco34la"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "True Grit was extremely awesome! This western film has everything that is so cool to watch and I really like the action scenes,some cool western dialogue with funny and seriously dark.",
      "total_reactions": 4,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Joel and Ethan Coen have done it again!..  This time they take a John Wayne \"oater\" and create a masterpiece study in human character.   The entire cast give a scintillating performance.  The Coen's depict life as it really was.  The good guys and the bad guys were cut from the same bolt of dirty cloth.  The only difference is that one got \"paid\" when they stole a person's possessions; the other got paid when they brought them to justice.  The only one who was clean was Mattie Ross, and she by the force of her righteous will made them all toe the line.  Well done Joel.  Well done Ethan.",
      "total_reactions": 4,
      "user": "BOYDBOB64"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "One of my favorite movies of the year. It's not an action movie but rather a dark, western themed comedy-- and more than that, it's an excuse for some very good actors to chew scenery.",
      "total_reactions": 5,
      "user": "whit"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2010
      },
      "score": 0,
      "text": "Got to give it a \"one\"  mostly for my errant expectations. Those who are looking for a typical Coen brothers film will be very disapointed. Terrific acting by Jeff Bridges although he does seem to reprising his previous role in \"Crazy Heart.\" Matt Damon is unrecognizable and wasted. Hailie Steinfield is getting rave reviews and it is hard to understand why. She appears to be acting in every scene. Merely a good straight-ahead western. The Coen Brothers should go back to making Coen brothers movies unless they are getting worn out and lacking the true grit necessary for inspiration..",
      "total_reactions": 12,
      "user": "critical1"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 1,
      "text": "This movie was awful.  I am sorry I saw the original with John Wayne but this was a pointless boring piece of trash.  It made absolutely no sense because you knew where this was going 5 minutes into the flick.  The professional criticis raving about this simply blows my mind.  Just a waste of two hours.",
      "total_reactions": 6,
      "user": "fantasy"
    },
    {
      "neg_reactions": 33,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 3,
      "text": "Jeff Bridges and Matt Damon were really great in this movie. However everything else was bad and boring. Characters would talk about things that had nothing to do with the plot or development of the story. When I went into this movie i thought i was there to see an action movie. What i saw was a bunch of cowboys talking about their crappy jobs and money. Even though the acting was good the characters that these great actors were made into were over all bad. The girl was whining the entire movie. And both Matt Damon's and Jeff Bridges characters were both boring and underdeveloped.",
      "total_reactions": 39,
      "user": "monkeyman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "Wow. I went into this movie with decent expectations, but...whoa. This movie is awesome. The Coen Brothers have delivered one awesomely solid western. The performances, especially from Jeff Bridges and Halie Steinfield, were amazing. The script was great. Even though it's a dramatic western, there's some hilarious moments. The direction was great, the cinematography was great, and the shootouts were pretty cool. The only problem is that it is a bit slow. But other than that, True Grit is an awesome Western that I'm definetly buying on blu-ray.",
      "total_reactions": 1,
      "user": "Bullet97"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "When you walk into \"True Grit,â",
      "total_reactions": 4,
      "user": "Lopez17"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "Pretty solid western flick. The most surprising thing about this movie is that it felt like it was made 20 years ago and doesn't really change up the western formula. Thought we were in for a new/modern twist on westerns, but it's a pretty cliche story.  Jeff Bridges is pretty funny and the little action you actually see is entertaining. One thing that I didn't enjoy was the western slang. I just didn't have the patience to dissect what they were saying and at times i just zoned out to the conversation. In particular, the trial scene kind of went on and on and I didn't understand half the things they said. Maybe that's just me..",
      "total_reactions": 3,
      "user": "Frmz84"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "The original \"True Grit\", directed by Henry Hathaway, and starring, no less than \"The Duke\" himself, made its initial theatrical run in 1969, just two years after Arthur Penn's \"Bonnie and Clyde\" blew away the production code. Once Warren Beatty and Faye Dunaway went down spasmodically in a hail of gunfire, that was that, and there would be blood forevermore. No more smuggling. The days of \"beating around the bush\" were over. No more fade to black. You could \"hump the hostess\". In Elia Kazan's \"Baby Doll\", released in 1956, smack dab in the middle of a sexually repressed era, the handcuffed filmmaker somehow managed to adapt \"27 Wagons Full of Cotton\", the Tennessee Williams play that depicted a middle-aged man's eroticization of his underage wife, without getting arrested on indecency charges. While neither Archie Lee(Karl Malden) nor Silva(Eli Wallach) get anywhere near first base with the titular character(Carroll Baker) in the official narrative, the first generation Italian does have implied sex with her, twice, suggested by a phallic symbol in one instance, and the cotton baron's dry humping performance(while mounted on her hobby horse) in another. Whereas \"Baby Doll\" predictably focuses on the man's needs, and likewise, in the John Wayne vehicle, LaBoeuf's libido is on display when he expresses his wish to kiss Mattie Ross(Kim Darby), this seemingly square western, with the utmost subtlety, delves into the fourteen-year-old girl's growing pains, in which her crush on the Texas Ranger runs deeper than the stealing glances she aims his way at the boarding house dinner table. When LaBoeuf inquires Mattie about her name, the young girl excuses herself from his company and adjourns to bed. Away from the menfolk, the recently bereaved girl and the boarding house owner gab about the strapping young lad, both agreeing, do the smitten pair, that the federal marshal is handsome. Before the lights are turned out, the girl cries, the waterworks being attributed to her slain father, no doubt, but also, perhaps, out of guilt, for feeling the first pangs of lust. Suggested by the snake pit she later falls into, in all likelihood, Mattie touched herself. There's a sin involved, but it can't be murder, since Cheney(Jeff Corey) is still breathing after the recoil due to Mattie's firing, which only grazes his head, so the snake bite that the girl endures must correspond to some earlier transgression. (Rooster Cogburn kills Cheney. John Wayne has to be the hero, even a deeply flawed one.) In the remake, Mattie pays for the self-induced orgasm with her hand. Seen as an adult, the moviegoer can't help but perceive Mattie's missing appendage as a scarlet limb. Unlike the original, it's Cogburn(Jeff Bridges) whom Mattie(Hailee Steinfeld) admires, initially anyways, as indicated by her divulgence to LaBoeuf(Matt Damon) that she had chosen the wrong man. Bridges' rendering of the one-eyed marshal contains none of the inappropriate feelings that may have stirred in his predecessor's heart. As Mattie bandages the Texas Ranger's hand at the McAllister homestead, Cogburn appears miffed by her charity. Why? Does he have sex on his mind? Maybe. Because Darby was twenty-two at the time, to a certain extent, \"True Grit\" could get away with its pedophilic undertones. Conversely, Steinfeld is age-appropriate, so when Damon repeats Campbell's line about stealing kisses, he comes across more strongly as a child molester. The filmmaker leaves out Wayne's original comment about LaBoeuf  \"enjoying it too much\"; the Texan's spanking of Mattie's behind, probably out of fear that the hunting party would resemble some sort of unseemly threesome, a malodorous \"Jules & Jim\" playing wet nurse to a lolita. Ultimately, the most striking feature about this otherwise well-dressed mounting of the ultimate John Wayne experience(\"The Searchers\" was John Ford's bag) is its political incorrectness, or rather, the arch self-awareness that many westerns were shameless in their depiction of Native Americans. Right away, \"True Grit\" announces itself as the anti-\"Dances with Wolves\", in which an Indian's speech is cut-off by the executioner's hooding of the tribesman, disturbingly enough, to comic effect, just before he dangles at the public hanging. Later, at the site of an abandoned house, the liquored up law officer kicks two small \"red-skinned\" children off from the structure's wooden foundation without any protestation from his female companion. (Mattie names her horse Blackie in front of a \"Negro\" stable-boy.) In another sense, Mattie loses her fingers because she didn't lift a single finger to stop the needless cruelty of those innocents.",
      "total_reactions": 2,
      "user": "Shiira"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Though there is something timeless about the characters, they talk and act in a dated historical way that no longer exists nowadays. This film has a great story, great acting, humor, and both a sense of time and timelessness.  If you expect a typical Western you won't find it, yet you won't find an atypical revisionist Western either.  The focus is on the characters and how they relate, and the film succeeds wonderfully.",
      "total_reactions": 2,
      "user": "Dalem"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "I know nothing of the remake or book regarding this movie. All I know is that I was highly entertained (something that movies haven't done for me in a while, recently). Being a western, I expected gun fights, horse-riding, booze drinking, outlaws vs. marshals, etc; and this movie delivered that, and more. Hailee Steinfeld plays a very smart and determined young girl that will not stop until her father's murder is brought to justice. She hires an old, beat-up, drunkard of a marshal that manages to find ways to bring men to justice, that few can do (though his methods are questionable, often unorthodox, impromptu, and frequently lead to someone getting hurt or injured.) Matt Damon's character is a Texas Ranger that's come to Arkansas (the setting of the movie) to hunt down the same criminal that killed ms. Steinfeld's father for a different crime that occurred in Texas. These actions bring the three together in a terrific story that manages to be traditional, yet hold a lot of its own originality at the same time.",
      "total_reactions": 2,
      "user": "sapient254"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "Jeff Bridges is no John Wayne......Thank god.  Wayne was such an over the top character that he kind of overshadowed the role.  Bridges, Damon and Steinfeld immerse themselves in the roles drawing the viewers into the story.  I can truly say that I never saw this movie until now.  Kudos to those Coen boys.",
      "total_reactions": 4,
      "user": "martinex"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "The Coen Brothers have really done their best film since No Country For Old Men, and Jeff Bridges has done yet another fantastic performance as Marshall Cogburn. Not only that, Matt Damon also performed very well and Hailee Steinfeld has done a fabulous acting for a 14 year old! I was quite surpriesed by all of this! Not only that the Coens have directed this beautifully, but have brought the Western genre back into cinema since Unforgiven.",
      "total_reactions": 3,
      "user": "Rob274"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "Iâ",
      "total_reactions": 3,
      "user": "jeremyp"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "I see this western partially as a play-fight on time and continuity of Film;True Grit is well-crafted and rather pointed by metaphors and a narrator that only speaks at the end,and at the beginning.",
      "total_reactions": 1,
      "user": "FUNTALK"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "Very enjoyable Western: I admired John Wayne in the earlier film but have absolutely no complaints about Jeff Bridges or anyone else in this cast of characters -- except for a rather ho-hum Matt Damon. Best change for me was the use of the haunting gospel song \"Leaning on the Everlasting Arms\" rather than the Rhinestone Cowboy-ish song by Glenn Campbell. Some inconsistencies were disappointing, the worst being a character who's almost totally submerged while crossing a river on horseback, yet emerges totally dry!",
      "total_reactions": 1,
      "user": "Lyn"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "It could be my favorite film of the year. I usually love the Coen Brothers work. I'm not really a Western fan, and don't care if it's a sort of remake. But I was enthralled from beginning to end. Finally we get to see a great film. As to why it was snubbed by the Golden Globes, unbelievable - but then they nominated The Tourist, which was mildly entertaining. And what's up with Black Swan? So over the top. Anyways the Coens have done it again. Fantastic performance by Hailee Steinfeld, who commands the screen. Wonderful to see \"The Dude\" back. Superior film making in every way, from script to cinematography and soundtrack.",
      "total_reactions": 3,
      "user": "movieboy"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "This retelling is darker and deeper than the 1969 John Wayne version.  Both films are adapted from the same novel, and have basically the same general plot.  But the new Cohen brothers film is, for me, a far more interesting film.  The three main actors (Bridges, Damon and  Steinfeld) are well cast and do a great job.  The cinematography is wonderful, as are all the technical elements.  The limitations of this film are the limitations of the source material - the story is what it is.  This is a \"hunt down the bad guy western,\" a genre which has great potential for excitement and character development (this film has both), but also usually great potential for an ending that is unfullfilling (which this film also has).  This is a good movie, but not in the category of \"Unforgiven,\" for example.",
      "total_reactions": 3,
      "user": "StevieGJD"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "I rented the original so it would be fresh in my mind. I had the luddite view that you can't remake a masterpiece. I am not a Co-Bro fan so my expectations were not high to say the least.  I haven't been so glad to be wrong in a long time. Old or first doesn't always mean best. I loved it!!!",
      "total_reactions": 2,
      "user": "gunnyart"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "this one ranks with the best westerns ever made and Ive seen most of them since 1935.  great script, great acting and the young girl was outstanding. don't miss it",
      "total_reactions": 1,
      "user": "mpg"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "A serious western with some serious laughs. That's a great combination. My favourite parts were when they cut to that Dude-like stupor (eyes half closed, mouth agape) that only Bridges can summon. He's like a drunken, one-eyed Gandalf with a gun. A Stoner, thrown into a genre film. Very funny. This film will stand beside the best of the Coens.",
      "total_reactions": 3,
      "user": "Bairdo"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "\"The Coen Brothers True Grit is a brilliant remake of a classic story led with outstanding performances from Bridges & Damon and is captivating and more risquÃ© then the original but the real stealer is newcomer Hailee Steinfield who deserves an Oscar nomination\" .. A-",
      "total_reactions": 4,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "The Coen Brothers have put their unmistakable spin on this Charles Portis novel (a better reference than the John Wayne movie). A plucky young woman (Hailee Steinfeld) hires a crusty, drunken Marshall (Jeff Bridges) to bring her father's murderer to justice. This film spends more time on character (always humorous & interesting) and dialogue (entertainingly stilted) than on action. It sets up the period and plot nicely, drags a bit in the middle, but ends with a hit of action. It's not their best film, but still enjoyable to watch these two masters work their cinematic skills.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Lead by absolutely fantastic performances \"True Grit\" could be considered the best Western since \"Unforgiven\". The Coen Brothers have made this dark, gritty, and at times comedic drama into a memorable film that can stand up for itself and take straight aim.",
      "total_reactions": 4,
      "user": "brewcrewpride"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "For any one to say that this version of True Grit is more faithful to the book by Charles Portis is ridiculous. This version changed just as much, if not more than the original did.  I understand that the book is narrated through Mattie's eyes but they left out so much of what made the book so great that it was almost a different story.  Too many characters spoke lines in the movie that other characters in the book had actually spoken. Parts of the movie were out of order and the role of Rooster Cogburn himself was literally relegated to second fiddle.",
      "total_reactions": 1,
      "user": "BroncosOwnYou"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Marvelously shot by Deakins (who's likely to finally win his well-overdue Oscar) and with exceptional performances by Steinfeld, Bridges, and Damon, the Coen Brothers have created another masterpiece. On the surface this might seem like the least Coen Brothers-y movie of their oeuvre, bur the tone and themes of their previous films are still present and should please any sort of audience.",
      "total_reactions": 3,
      "user": "Tony"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "I have to start by stating that I love most of the Coen brothers films, their style just appeals to me.  They have a knack for getting great performances from actors and this film is certainly no exception.  Jeff Bridges, Matt Damon, and especially Hailee Steinfeld are great and have great chemistry together.  I like that they chose to use the dialect of the time.  Sometimes I didn't quite understand all the words, especially from Jeff Bridges who is drunk and mumbles, but the story was easy to follow anyway.  There is always some humor in a Coen Brothers film, but this one is the funniest one they have made in awhile.  As usual the cinematography is excellent as well.  I saw this the day after seeing the overrated \"The Black Swan\" - what a breath of fresh air after that movie.",
      "total_reactions": 2,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2011
      },
      "score": 4,
      "text": "The acting was pretty poor and I expected far more however the teenage girl who played opposite of Bridges was amazing and made the film bareable. Overall its a very disapointing remake.",
      "total_reactions": 2,
      "user": "asylumspadez"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "one of the must sees in 2010 or now 2011 haha, great acting and scirpt as it was filled with great humor. there are shootouts but not as much as i thought going to see it . They also really dont fight with bad guys till about the last 25 minutes or so. but the sharp and funny diologe keeps you interested and makes the pace of the movie go by fast. so go out and see the one of the best movies of 2010",
      "total_reactions": 2,
      "user": "moviefreak12"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "all these westerns are much the same. An injustice is done and a jaded, anti-hero type mercenary gets hired to track someone down. All a bit dull and rehashed really. The Unforgiven was the first film to use the formula and it hasn't been equalled since, with the exception of maybe apaloosa, which is leagues above this film. The Coen brothers should start directing porn instead.",
      "total_reactions": 4,
      "user": "Lambo442"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "True Grit does not tell a traditional archetype-based story. We don't see Mattie Ross start out naive and powerless and grow stronger on her journey. She's intelligent, driven, and capable from the beginning. Rooster Cogburn never really loses his wild, do-as-I-please attitude, nor does LaBoeuf really lose his arrogant superiority. instead the movie shows what I think is a more realistic depiction of a cowboy/western adventure. Yes, it was paced slow. Yes, there were scenes where they are just babbling or doing nothing. Yes, it lacks the theatrics and (overdone) aesthetics of recent movies. But I don't imagine a western journey being fast - paced, easy or pleasurable, or very exciting. Why were there boring and slow scenes? That's all they could do while they traveled. In terms of the acting, I think Matt Damon was miscast - not a terrible job on his part, but it was lacking in believability. He does the accent pretty well, but he's just not a cowboy. Hallie Steinfeld was great - the maturity and stubbornness was spot on. But Jeff Bridges was my favorite portrayal. I thought he was perfect for the role. He pulled off a messy, throaty, alcoholic marshall with a bit of a spark, and had some of my favorite one-liners. Overall I enjoyed the movie and it had a decent message and a dramatic finish. Definitely a gem shining in a load of Hollywood's fresh manure.",
      "total_reactions": 1,
      "user": "quacker"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "The acting is great here, as is the tone and setting of this film. While it doesn't have the same feel as the original, and can stand on its own and it is very hard to compare the two because they are so different in characterizaton. My only qualm is with Josh Brolin as Tom Chaney. He seems so dazed the entire time, and I am not sure if it is on purpose or not... Tip of the hat to Barry Pepper as Lucky Ned, who is a great character and I wished we could have had a bit longer with this gentlemanly bad man.",
      "total_reactions": 2,
      "user": "Rumblebeelove"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "On the surface, the story is very simple, but underneath there is a lot going on (aside from the black comedy of the book). The skill with which the Coen bros orchestrate this film is really awesome. From casting, acting, plot, theme, allegory, cinematography and the best of all--dialogue---they really should be proud of True Grit as I'm sure the original author would be given how closely they followed his book (as opposed to the John Wayne version). I loved every minute of this film and am pretty excited to see it again actually.",
      "total_reactions": 2,
      "user": "podunk411"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "If you like Arnold one liners, good plot, and something different, this is the movie to watch. I love Mr La Beef, he was super funny and so was Bridges.",
      "total_reactions": 3,
      "user": "VladimirLenin"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "This movie was a good take on a \"new age\" western. Some of the terms were not of that of the time but I think the story kept moving. The humor was good in parts and others weren't so hot but over time it stuck onto you. The scenery was great and well used in each of the scenes. Overall I thought this movie was entertaining and a good movie for people to enjoy.",
      "total_reactions": 3,
      "user": "Ruler101"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "I ask you to please address me as Mattie Ross. This film is Coen Bros at their best. Damon is truly surprising as a fat, never shutting up-antihero. Bridges is as good with one eye as most of us with both. And, obviously Hailee a refreshing role, so interesting and rich. Cinematography and story owe much to Cormac McCarthey, thank you dear Coens. Must, must see. Dont have to be a guy to love it. @cinemaquote",
      "total_reactions": 1,
      "user": "cinemaquote"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Extremely bad movie to watch in recent history. How can this be a oscar nominee. It is difficult to understand what the story is all about and what characters say and talk has nothing to do with movie.",
      "total_reactions": 1,
      "user": "mittalraman01"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "4 Mitchâ",
      "total_reactions": 2,
      "user": "movieswithmitch"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "I loved True Grit. The dialogue was snappy and well delivered. The action was well spaced and didn't clog the movie up. The characters felt like real people and I was wondering the entire time what would happen next. The only complaint I have, is that it couldn't go on forever. =]",
      "total_reactions": 3,
      "user": "jhall1128"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "A slow first 20 minutes pays off as the film develops into a rather hysterical adventure.  A great child performance along with expectantly impressive turns by Bridges and Damon make for an entertaining way to spend 2 hours.",
      "total_reactions": 3,
      "user": "jsowers"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "I think the best word to describe \"True Grit\" is entertaining. The dialogue throughout is clever and I was surprised by how many times I laughed throughout. At the same time, the main plot (a fourteen-year-old girl tries to catch the man who killed her father by enlisting an aging lawman with little regard for rules or niceties) is serious, exciting, and suspenseful. I enjoyed the western feel, with impressive landscapes matched by its musical score, and I thought the acting was great all around.",
      "total_reactions": 3,
      "user": "DarkKnightV"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "True Grit was a great movie with some very, very strong actors, characters, and a wonderful story. So why am I giving it a 7/10? Because of the ending. For such an uplifting middle portion, it seems wrong to end the film with tragedy like in the beginning. The ending was really the part that ruined it for me. And the god-awful song at the end did not help either.",
      "total_reactions": 3,
      "user": "182crazyking"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "I took my friend on a date to see this movie, she and I both had very high expectations, given the amazing cast and the reviews I had already read about it. We enjoyed it, and when I say enjoy it I don't mean we thought it was extremely good, we just enjoyed it. The acting was the biggest highlight of this movie by far. With absolutely exceptional performances by Jeff Bridges, Josh Brolin, Matt Damon and Hailee Steinfeld. The group of these four amazing actors in my opinion is what made the film.",
      "total_reactions": 2,
      "user": "DarkZX"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "The best way I can describe this movie is that it's like one of your favorite songs covered by one of your favorite bands.  And it's a helluva cover.",
      "total_reactions": 3,
      "user": "jdolan74"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "Excellent characters brought to life by skilled actors. They have fun, we have fun. The parts are greater than the whole. With such a simple story, it would be hard for the plot to live up to the likes of Cogburn, LaBoeuf and fourteen-going-on-you're-no-matched-for-me Mattie Ross. Sadly, by the end I was left wanting more.",
      "total_reactions": 3,
      "user": "savagesophia"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "The Coens' adaptation of True Grit left me well satisfied, but critically I was puzzled.",
      "total_reactions": 3,
      "user": "shaky"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2010
      },
      "score": 6,
      "text": "Well first off, I am a huge John Wayne fan. I have watched almost all of his movies, with this being one of my favorites. I was a little nervous on how Jeff Bridges was going to do in regards to taking on John Wayne's previous role and surprisingly, I thought he did a pretty good job. As a whole, I thought all of the acting was well done and particularly thought Hailee Steinfeld did an excellent job with portraying the role of Mattie Ross. I also thought some scenes were better than the original, like the scene where Rooster is trying to squeeze the information out of the two men in the cabin and one guy chops the other guys fingers off and stabs him in the heart and Rooster blows that guy's head off. I thought that seen kept the suspense moving and really moved the audience. However, I thought the first half of the movie really didn't build up the story at all and the fact that an hour of the movie took place in the town, I felt like that made the second half of the movie (the action scenes) feel rushed and we, the audience, didn't get the feeling of evil that is supposed to be portrayed through the rival gang of cowboys. The other thing that I felt really hurt the movie was the focus that was on how Rooster is a drunk. There was probably 3 different scenes that was focusing on how he's a drunk and I felt like that really hurt the plot. Overall, I thought the movie was good but most definitely not as good as the original. Hats off to you John Wayne...",
      "total_reactions": 2,
      "user": "TENCATIJA"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "One of my favorite Cohen Bros. efforts, and I've seen them all. This is my favorite film of the year, other than perhaps \"Toy Story 3\". Everyone involved here has risen to the challenge. Having just viewed the original John Wayne version, this one is far superior in almost every way, starting with the sharp, witty script, which often prompts the viewer to ponder over the sometimes antiquated, but always revealing turns-of-phrases. Perhaps this is why some viewers have suggested the film is too talky and slow. In fact, much of the film's action takes place in the dialogue between the characters, rather than merely in the form of physical action. The performances, as noted by all the reviews, are uniformly memorable, but Jeff Bridges is truly great here. The cinematography is beautiful in a stark and haunting way, and the score, by the Cohen Bros. consistent collaborator Carter Burwell, is stirring. The characters here, unlike most westerns, have shades of gray, and all but the most vile of them retain a sense of humanity. This is probably the most emotionally effecting, and also one of the wittiest westerns I've ever seen.",
      "total_reactions": 3,
      "user": "MikeAB"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "Solid entertainment. Matt Damon seemed miscast. He couldn't deliver the subtle comedy the situations were presenting. But Steinfeld and Bridges were strong and the story moved along well. kept me engaged.",
      "total_reactions": 2,
      "user": "kormac66"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "This funny, entertaining remake is among the Coen brothers' best work. Jeff Bridges' acting is worthy of the classic John Wayne movie. The new, young actress Hailee Stienfeld debuts with a acting performance that will likely give her several upcoming jobs.",
      "total_reactions": 3,
      "user": "tim99999"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "A very good movie. Typical Coen brothers film, great acting, great script and dialogue, laugh out loud moments followed by some dark and edgy monents. A great Western as well, as it shows the \"Old West\" for what it really was, harsh and unforgiving. Bridges, Damon and a brilliant Hailee Steinfeld all work well together and you feel like being on the trail with them. A must see if you like the Coen brothers, westerns or just great acting. However my only negitive point is just don't expect it to live up No Country For Old Men.",
      "total_reactions": 3,
      "user": "allystew"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "With its amusing dialogue, engaging characters, and visually striking vistas, True Grit was not a disappointing movie, but it was a disappointing Coen brothers movie. Regression to the mean? I hope not.",
      "total_reactions": 3,
      "user": "Jim_S"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "Although one will never truly know what the West was really like, I get the feeling this movie got pretty damn close, even right down to the proper language.   With haunting imagery that stays with you, the Coens have made an instant classic in what could be its very own sub-genre.",
      "total_reactions": 3,
      "user": "TheWayfarer73"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "It seems axiomatic by now that remakes of good films usually fall well short of the mark.   With the  often brilliant Coen brothers at the helm, Steven Spielberg producing and Jeff Bridges and Matt Damon starring, this film promised to be the exception---especially if you read the critics.  I don't know what film they thought they saw, but the one I saw was decidedly not the exception that proves the rule.  Gritty it was, but truly entertaining, engrossing and exciting it decidedly was not.  Jeff Bridges was a cross between Wallace Beery and Lee Marvin's \"Kid Sheleen\"---in either case his unintelligible dialogue needed subtitles. Matt Damon's bland performance almost had one longing for the original's Glen Campbell.    A disappointing dud.",
      "total_reactions": 3,
      "user": "twainfile"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "The acting was brilliant. The cinematography often stunning. The story enjoyable. Joel and Ethan Coen have once again produced a visceral film, with moments of intensity (particular with the indoor scenes) and characters that are unforgettable (like that instant when the narrator is left behind with her father's killer). But there are moments that really concern you, and you wonder who it is that you're supposed to care about most. And, as a result, the film falls flat - its feels incomplete and without heart, despite the amazing quality of everything that went into its production. Would I recommend it? Absolutely - but only in the hopes that you discover what is there that I didn't see.",
      "total_reactions": 2,
      "user": "criticalranger"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "Coen brothers following generics of the Old-American Western brings out a much different True Grit , than the 1969 classic. It is not experimental , it doesnâ",
      "total_reactions": 1,
      "user": "Mojo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 6,
      "text": "Well...nothing beats the original True grit. This movie has a well supported cast, its the ONLY thing the movie has tho. Its well acted, the sights/sounds/horses/scenery is all fine but I just found the movie boring and somewhat just rambled on without much action, they could have done wayyy more with this and I have to say my expectations were somewhat high for this when I seen the trailers for it, but I have to say they make the movie far better then it is by those trailers...not bad but not the best remake of a western by far, 6/10 for me for just didnt keep me entertained throughout, didnt keep me wanting to watch it.",
      "total_reactions": 1,
      "user": "MrRiggs"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "A fantastic remake of an already great western. 'True Grit' is a must see for any fan of the genre. Jeff Bridges manages to outperform even John Wayne's Oscar winning performance. With many truly surprising and hilarious moments. One of the overall best films of 2010. My only complaint would be the slightly out of place ending.",
      "total_reactions": 3,
      "user": "Zorgly"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "This movie is purely amazing. At first thoughts I thought it would be a completely serious movie with absolutely no sense of humor. I was proven wrong as this movie has a good plot, perfect amount of humor, and great acting by Jeff Bridges and Matt Damon. A very good way to end 2010 movies.",
      "total_reactions": 1,
      "user": "iluvmovies"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "I personally watch it at the movies and was not expecting much out of a western...even though directed by the Coens. Greeeaaat direction. The story line was a little cliched. Outstanding performance by the cast especially Hailee Steinfeld. Some dark comedy and cruelty. personally I thought it was a outstanding film.",
      "total_reactions": 1,
      "user": "massimo22"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "I enjoyed all the actors in this movie. From Barry Pepper's short cameo and Josh Brolin, to Matt Damon and Jeff Bridges, to the newcomer Hailee Steinfeld, they all took to their roles with talent and dedication. The Coen Brothers made a great looking movie. The only complaint I had was the ending, but otherwise, a spectacular movie.",
      "total_reactions": 1,
      "user": "Stephmeister02"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2011
      },
      "score": 1,
      "text": "Incredibly boring movie. Dull and pointless remake. I would much rather just watch the original. The Coens have sold out. I could only see bunch of pedophiles rating this movie so high.",
      "total_reactions": 4,
      "user": "Dorrbecker"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2011
      },
      "score": 4,
      "text": "First, no action. Instead, this 14 year old girl talks the entire time. Matt Damon doesn't do anything for the entire film and Bridges just walks around with an indiscernible southern accent.",
      "total_reactions": 1,
      "user": "Blitzcrag"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "This was a waste of time. The original was a classic western. This was a weak attempt to recreate",
      "total_reactions": 4,
      "user": "MrMoovey"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 1,
      "text": "THis movie Bored me to death. Jeff Bridges had  great acting, but thats about it. Plot was boring, storyline was boring, i dont really see how movie critics enjoyed this so much. Much to simple. All of these movie critics are just having nostalgia from the older release of the movie.",
      "total_reactions": 3,
      "user": "xishnik100"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "Never has my opinion after seeing a movie been so far removed from the general buzz.  In my opinion, True Grit looks like a B-movie Western, at best.  It is hard for me to understand all the favorable critic reviews, other than to imagine that there was a degree of the \"star-struck\" factor.  Because, stars there were; the track record of  all the creative team is impressive.  What happened, then, when they got to make this movie?  It may have been the all too well-known lack of inspiration.  LetÂ´s hope  that is was a temporary condition, and they revert to making good films, as they have shown they can do.  At least in the past.",
      "total_reactions": 1,
      "user": "jlua"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2012
      },
      "score": 4,
      "text": "Another one of those movies with some nice ideas and good moments, but which doesn't gel cohesively enough to work as an overall package. Pacing wise it drags in parts and, as potentially interesting as the characters are, they never quite fulfill their potential. I had to watch the movie with subtitles on because of Bridge's indecipherable accent too, and it did take something away from the movie. Get the original instead.",
      "total_reactions": 1,
      "user": "SpunkyMonkey"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2012
      },
      "score": 3,
      "text": "I have to admit that, before watching the film, I wasn't a fan of the original and was surprised that anyone thought it deserving of a remake. The original was far too much of a comedy for what was supposed to be a revenge film and Kim Darby's performance was far too cartoonish. I imagined that the Coens would probably go far in the other direction and create an extremely violent film that might better fit the theme of revenge.",
      "total_reactions": 1,
      "user": "Cineman"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2013
      },
      "score": 3,
      "text": "First of all I don't like westerns. When i first saw the trailer I thought that True grit is going to be my favorite movie. The trailer shocked me with action and passion but what i got after watching that film was nothing. Who would even think making that extremely boring film with no sense. It had a good script about the girl who wants to find the murderer who killed his father and i liked in the end that the girl cuts her arm. That's what i liked of this boring film. I give it 3 for the plot and the landscapes.",
      "total_reactions": 1,
      "user": "Kiva"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2013
      },
      "score": 2,
      "text": "Una pobre, muy pobre remake de la versión original del 1969. Si esta bien, es buena la historia en partes, pero me quedo con la versión original de John Wayne.",
      "total_reactions": 1,
      "user": "LaMagiadeVirue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "This movie is as standard as westerns get: from grumpy cowboys to beautiful scenery to countless gun battles and to the tales of a time long forgotten!! What sets it apart however is the quest for vengeance by a young tough as nails heroine who just happens to be 12!!!She holds the movie togethor and although she doesnt let us into her cold as stone interior, we understand her and feel fer her. Jeff Bridges and Matt Damon are equals unto each other and the banter between all is masterfully handeled by the Coen Brothers. The movie is dark, gritty and moves along at a steady gallop and builds to a satisfying finale. The master stroke for me however was how the ending reminded me that as with all of our lives...our biggest adventures are simply a page or a chapter and nothing more!!!",
      "total_reactions": 0,
      "user": "Sausage"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "There was much to admire about True Grit, but I found it hard to get past the amount of violence, some of it quite gratuitous. I suppose I should have known what to expect from the Coen brothers. Much of the film's dialog seemed stilted, which probably reflects the way the Coen brothers believed (possible correctly) that people spoke in the late 19th century. My wife and I were discouraged by how many of Jeff Bridges's lines were mumbled and hard to understand. I know that way of speaking fit the character, but we found it hard to follow parts of the film.",
      "total_reactions": 0,
      "user": "emkadv"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Excellent movie! Jeff Bridges and Matt Damon were great, and whoever played the girl was Oscar worthy. The film drew me in right away from the narrative intro to the hangings, and then to the court room where she met the marshall (Bridges). The cinematography makes you feel like you are in it and the characters are so believable. Awesome shots and music. This movie will be in my mind for a while.",
      "total_reactions": 0,
      "user": "schmidtface"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2011
      },
      "score": 6,
      "text": "This is possibly the most anti-climatic movie I've ever seen. While it was artistically done, and both Jeff Bridges and Matt Damon put on good performances, it wasn't enough to take away from the slow story that felt like it had no ending. The 'showdown' was what could have saved this movie, but instead was nothing more Jeff Bridges running across a field on horseback, and was over within minutes. The 'climax' was really only Mattie Ross being bit by a snake. I'm not trying to sound like I wanted this movie to be 'Hollywoodized like so many movies are these days (I can respect the Coen Brothers for not selling out), but it wouldn't have killed to have put some excitement into this otherwise dreary story.",
      "total_reactions": 0,
      "user": "jredekop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "I don't usually watch western films. Wait I don't think I do at all (maybe except Rango and Back to the Future Part III if they are western films). True Grit started pretty interesting and got a little boring but got back my interest once more. I do agree with some people that say it is overrated because it is a great film but not as awesome as critics say it is (or maybe I feel that way just because I don't watch westerns). But it is still great: great acting, and interesting story.",
      "total_reactions": 0,
      "user": "Commen0136"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Well... here is talking someone that actually hated western movies her own life... but...something is changing nowadays. By first... I'm talking after watching ''No Country for Old Men'' from Coen brothers too. What a surprise back then! Of course I started to love Josh Brolin there too, Javier Barden a genius!! But.. going straight to the point... thanks Coen guys I'm starting to give Westerns a chance. I knew about this movie and couldn't wait to watch it! Of course it has nothing to do the fact that is starring Jeff Bridges, Matt Damon and Josh Brolin... I'm kidding, they're gorgeous! Jeff Bridges has beaten then all... if there is a Leading actor award, you've got it right here! What a acting, mixing that comedy-drama role, who in the Holy Mother of God can do that as good as him... or at least who can do it? Thanks Jeff for a great movie... then you have Matt Damon, in the 2nd line, you know, hard to say what I'm really thinking... but, well.. after all is Matt D. (what would u expect?)... he was too funny really really funny too, great job there. I was really expecting to see more about Josh Brolin, but, well, he had not such a big part in the movie I guess, but he was perfect too. The girl, a really tough one, you don't wanna mess with her... that's all I'm allowed to say if I don't want to give u a spoiler... my last will... WATCH IT and GET IMPRESSED!",
      "total_reactions": 0,
      "user": "Malasawas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Loved this movie.  I thought the acting was superb and I was thrilled that it was free of the usual filthy language so common in most films today.  I think Bridges deserves an oscar.  Highly recommend this to anyone and everyone.",
      "total_reactions": 0,
      "user": "Boomergem"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "Gr8t Western with some surprises.  The acting was superb even if the \"good guys\" were good and the \"bad guys\" were worse.  Met my expectations although I cannot compare to the original -- may be a good things in this case.",
      "total_reactions": 0,
      "user": "TheTerp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Always love western movies. I had no idea this was actually going to be comedy. The storyline remained interesting throughout the movie. Great acting by Jeff Bridges and Halie Steinfield.  This is a great remake of the original and a must see.",
      "total_reactions": 0,
      "user": "John23"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "This movie is classic Coen Brothers story telling. If you go into this film thinking it will be all action, similar to the trailer for the film, you might be slightly disappointed. Action is not the primary genre, though it appears; it is still a western, as is evidenced by its slower pace. However, the dialogue was incredible and incredibly well-represented, especially by the young starlet. The characters meshed extremely well and managed to pull you into their situation. Bridges plays his classic position as the no-care humorous straggler. Damon was acceptable in his position, though I'm not sure I want to keep the image of him violently spanking a 14 year old in my head for the rest of my life. Overall, bravo Joel and Ethan.",
      "total_reactions": 0,
      "user": "theycallhimdrj"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "I loved the original True Grit with John Wayne, but I find this remake better. The story is one of a generic Western, but this IS a remake so it's nothing new. The performances are amazing, especially Hailee Steinfeld as Mattie Ross and everyone else did great too. The direction this film went was really cool and the action was really upbeat and tense. Check this one out after seeing the original and it's available now on DVD and Blu-Ray!",
      "total_reactions": 0,
      "user": "AlnORTIZ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "I absolutely amazed at how much I enjoyed this movie.  Coming from a girl who usually is into comedies, the close adaptation and historical value really entertained me.  This movie is a great break from the crap that has been in the theaters lately.",
      "total_reactions": 0,
      "user": "EcoFriend"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "This movie was amazing. I know im writing a reveiw for it late but i enjoyed this movie and saw it the day it opened. Jeff Bridges was amazing and held his role through out the movie. Of course it it hard to be as amazing as John Wayne in the original movie. But after all everyone held their role through out the movie and i recomend this movie to all Jeff Bridges and John Wayne's fans.",
      "total_reactions": 0,
      "user": "taywah09"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2011
      },
      "score": 5,
      "text": "With all the hype surrounding this film: 10 Oscar Nomination, a star studded cast, blah blah blah. This film just ended up being pretty average. To be honest after seeing the trailer I had high expectations for this film , but it just seemed to be a miss!!! The storyline was a little weak, and at time the film just seemed to drag along. The only bright spot in this film was the performance by 15 year old Hailee Steinfeld who in my opinion is a lock for Best Supporting Actress. Bottom this film is a snoozer so don't bother!!!",
      "total_reactions": 0,
      "user": "MrC3030"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "It is safe to say that I am mixed about this movie. I walked out in disappointment because it was THE Coen Bros. and i felt that something was missing. It was their second adaptive work and I can easily say that this movie made me laugh at it's silliness and the constant feeling of waiting for it to get going and no actor was more outstanding than the other. No one stepped out of their comfort zone to deliver a stellar and memorable performance.",
      "total_reactions": 0,
      "user": "Aiden26"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "As a great fan of westerns I was very excited to see this picture. While the acting was universally strong, the cinematography beautiful and the look authentic the film seemed to misfire. There are several very long passages that meander and are rather dull. The journey section picks the pacing up but, still there is very little suspense until the final twenty minutes. Jeff Bridges owns the role of Rooster Cogburn. He is a man's man, heroic, brave and gritty. Damon too is earnest and steadfast at Texas Ranger LaBoeuf. Newcomer Hailey Steinfeld, as Hattie Ross, truly holds her own these veteran actors. Her determination, poise and resolve are very powerful to watch, she is an engaging and compelling character. Perhaps having seen the original John Wayne version in the last year took away some of the impact. The action sequences were exciting and unverving. On the whole it was just okay. I would love to see the Coen Brothers write an original wester film. I don't think True Grit needed a re-telling, the first was less than stellar. True Grit has it's moments, but, they are few and far between.",
      "total_reactions": 0,
      "user": "Cornelius"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2011
      },
      "score": 7,
      "text": "Hailee Steinfeld is the outstanding performance in this movie, which has a decent plot line if you're into westerns, Bridges' interpretation of the character isn't bad and the pace of the film is fast enough to keep you entertained but not enthralled. Cinema: If you're into westerns, or fancy a change, DVD Rental: Yeah why not, but rent 3:10 to Yuma first",
      "total_reactions": 0,
      "user": "MrSteer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "Remaking a classic film is a very daunting task but The Coen Brothers and company pull it off with undeniable finesse and even manages to improve on the original.One area of improvement is the actress who played Mattie Ross.In the original Kim Darby came across as just a naive and annoying young girl.However,newcomer Hailee Steinfeld is very believable as an emotionally hardened,intelligent,and articulate young women.She can hold her own with Jeff Bridges and Matt Damon and make it seem easy.Jeff Bridges(as always)gives an outstanding performance and puts his own spin on this character and makes it his own.Matt Damon is also great and has beautiful and natural chemistry with both Bridges and Steinfeld.True Grit is also filled to brim with snappy one-liners delivered mostly by Bridges.One I thing I was gawking at more than anything was the simple beauty of the scenery.The entire area truly creates a feeling of \"your on your own out here\".The film has a completely even mix of dry humor,action,emotional impact,and just sheer badassnes.For fans of the original don't worry,The \"fill your hands you son of a **** is still intact.Some aspects of the film feel kind of off for me,such as how Mattie comes in contact with Ned.The ending also left me wanting more.These are just small gripes of an otherwise amazing movie.\"True Grit\" is an energetic,humorous,entertaining,and subtlety brilliant movie.It easily exceeds all expectations of a John Wayne movie remake.",
      "total_reactions": 0,
      "user": "Hman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "It's a gorgeous Western, simple and traditionally authentic. The cinematography delivers, as it rightly should. The performances are first rate (though Bridges mumbles too much) - all in all, it deserves all the BAFTAS, while the King's Speech doesn't.",
      "total_reactions": 0,
      "user": "Denisovich"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "The Coen Brothers have had a rough ride in the movie bussiness, but this one is really brings some remarkable work. The acting was great, the story was execllent, the gunfights were intense and the actors were perfect. Only little faults such as not explaining everything. I rate this one: 9.3 out of 10.",
      "total_reactions": 0,
      "user": "ps3gamer181"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "The coen brothers yet again do not disappoint. The characters and acting is excellent. If it were up to me Jeff Bridges would win an oscar for his role. The movie is so griping 2 hours went by and i found myself wanting more.",
      "total_reactions": 0,
      "user": "BathtubTom"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "I think we're in the presence of a quite interesting Western. And altough it's a sort of remake I do feel it brings a new picture of the story itself.",
      "total_reactions": 0,
      "user": "RurouniPedro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Without any doubts this is one of the best film currently on the cinema.  The twist and the suspense at the end of the cinema was fabulous! Must watch!",
      "total_reactions": 0,
      "user": "simonlondon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Right after seeing this movie I'd tweeted that Hailee Steinfeld should be nominated for a Best Supporting Actress Oscar. I guess whoever does the nominations read my tweet. This is a must see movie.",
      "total_reactions": 0,
      "user": "Efreet69"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Glad to see the Coen Brothers return to form after last year's rather silly and aimless \"A Serious Man\". \"True Grit\" was not quite what I expected, much less an action western or a machismo canon as a film about character development and writing. As with any Coen Brothers we get several scenes of hilarious and quirky dialogue, which I highly enjoy from them. Bridges was good but not his best (I thought his voice was a bit much), and Damon continues to impress in his varied roles. I came into the movie thinking Hailee Steinfeld would be cheesy and over-the-top, but I think she really held her own and gave strong believability to the feisty young main character. A well deserved Oscar nod in her case, much like Jennifer Lawrence in \"Winter's Bone\". The soundtrack was FANTASTIC, as was some of the subtle ironic cinematography. My main complaints are in the the ending, Bridge's voice, and the seemingly pointless behavior of some of the characters (often a complaint I have with some Coen Brothers characters). Nevertheless, a good addition to their filmography, and a welcoming addition to Western Cinema.",
      "total_reactions": 0,
      "user": "LiveForever"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "Good Jeff Bridges, good Matt Damon, good Hailee Steinfield. Good cinematography, great plot. Not great linear flow-I thought it was too slow, and I wish the Coen Bros weren't so anachronistic in preserving the time period of the Western genre-maybe they should've modernized the length so that it would more curb out instant gratification generation?",
      "total_reactions": 0,
      "user": "POV"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "I don't like western movies, and I don't know why. This movie however not only was enjoyable, but was brilliant and excellent in almost anything in my opinion. The story is really linear and very predictable, but what actually makes the story good is \"how\" it's told, because the girl protagonist is very disturbing and I can't hide a small chill whenever I saw her determination and her intelligence: she looked more like an anti-heroine other than anything else, so much that not even Cogburn (the old gunman and second protagonist) couldn't stop her in any way: this was very interesting to watch and this proves how old stories can still be good with just few changes in story telling and character development, without mentioning that the movie is a story of morality and behaviour and it's both touching and disturbing. The action is good too though and the shooting scenes were actually very well done, and aside of the main characters even the secondary ones were not only good, but actually remarkable (even the three men, near the start, who said ONE line, gave me a brief moment of sadness). Maybe I'm skipping something, but I highly recommend to watch this movie, however don't expect mindless shooting or senseless action: it's a story to watch, enjoy, and learn.",
      "total_reactions": 0,
      "user": "vahn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "The movie is supremely entertaining, the cinematography is a work of art, and Jeff Bridges' relationship with Matt Damon on-screen is perfectly funny. Hailee Steinfeld stands out as the audacious and sassy Mattie Ross. The Coen Brothers, as expected, have done it again. Not necessarily their best; but you can't miss this one.",
      "total_reactions": 0,
      "user": "harlanpepper"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "I have not seen the John 60’s original so am unable to make any comparisons but judged purely on its own merits the Cohen brothers have certainly created a competent modern western. The simple story involves 14-year old girl Mattie Ross enlisting the aid of an experienced bounty hunter in order to track down the man who murdered her father.",
      "total_reactions": 0,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "Seriously, what's not to like about this movie?  It's perhaps the best western I've ever seen.  Bridges is phenomenal, even better than John Wayne, in his portrayal of Cogburn.  Damon -- at his best since the Bourne movies -- is just spot-on damn good.  He comes across as a real piece of work at first, but by movie's end, my attitude towards his character did a 180.  The girl who plays Mattie Ross (Hailee Steinfeld) completely floored me with her acting abilities.  I loved this flick.  Matter of fact, it is not only my favorite western but could compete for top spot in any genre, save for horror.  That honor goes to the Swedish made Let the Right One In.",
      "total_reactions": 0,
      "user": "google_calasade"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "There is nothing frantic about True Grit, it's basically a good retelling of an old John Wayne movie. However, the performances keep this film high and amusing especially Hailee Steinfeld as the straight-to=the-point Mattie.  True Grit might stand out as One of the Best Cowboy Remakes but it has its powers to stand on its own. The direction of the camera and the scenic landscapes all add depth to the film, accompanied by Carter Burwell's piano-driven score. The story is about a 14 year old girl named Mattie who wants to avenge her father's death but not without the help of a Marshal. She chooses Mr. One-Eye-Patched Rooster Cogburn played by Jeff Bridges, who manages to be convincing enough. Matt Damon and Josh Brolin also play as supporting (enemies) characters.",
      "total_reactions": 0,
      "user": "Leeway"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "Great movie especially for a remake! This is a must see. The best way I explain it is too quote another review, \"The Coens combine their original and witty dialogue with incredible performances by top notch actors to create a film thats so engrossing that you're taken on a ride back in time with true outlaws.\" -horrorboy",
      "total_reactions": 0,
      "user": "Princess_Peach"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "Great acting by Jeff Bridges and Matt Damon, and of course the glue that binds these two characters together Hailee Steinfeld.",
      "total_reactions": 0,
      "user": "avj37"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "Fantastic. I haven't seen the original, but the original would have to be phenomenal to be better then this. Entertaining, suspenseful, and somewhat emotional, True Grit is great western entertainment. Deserving of all of the awards that it was nominated for.",
      "total_reactions": 0,
      "user": "AtTheMovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "I only have 2 complaints: Some of the dialogue was difficult to understand in places, although the parts I was unable to discern were not likely necessary to understand the plot. Secondly, The ending was rather abrupt for my liking. It seemed that once they found Chaney, the movie was finished in a matter of minutes. I felt like Josh Brolin was in the movie for 3-4 minutes total to me.",
      "total_reactions": 0,
      "user": "harlthegr8"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "True Grit is a great remake and remarkable addition to the trend of new Westerns. All the performances are genuine and engaging, but Matt Damon steals the show as the **** Texas Ranger, LaBoeuf. Jeff Bridges' incomprehensible garble compliments his ill-tempered and intemperate Rooster Cogburn. And Hailee Steinfeld makes the precocious Mattie Ross most likable of all. Scenes of short, sudden violence add realism to the film, especially in a time which physics-defying, CGI gunfights are the norm. Longtime fans of John Wayneâ",
      "total_reactions": 0,
      "user": "T-A"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "I may not have seen all that many westerns to compare True Grit, but maybe that's for the best. True Grit is an extraordinary western film that gets the tone and atmosphere right. It immerses you into the world that it puts you in and weaves a decently interesting tale too. The entire cast does a great job with this movie, they had me truly believe that they were actually form that time period. The redemption story is done pretty well and it's a good central driving force that keeps the plot moving forward. Jeff Bridges does a good job as the US marshal Rooster Cogburn. Matt Damon also does a great job with his character a Texas Ranger named LaBoeuf. The most surprising performance came from the new comer, Hailee Steinfeld who caries most of the film. Steinfeld does a great job as the lead character, it's pretty impressive. I guess my only complaint with the film is that there are a few pacing issues, there were times when i admittedly began to wander off wondering when something would happen. Just as soon as boredom would set in, though, an action scene or an argument between the characters would break out and would instantly snap me back into the film. As a western film this movie succeeds, it may not be the most action packed film but then again it really doesn't need to be.",
      "total_reactions": 0,
      "user": "RoscoeY"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "When you read the negative reviews of this movie, you understand why so many of the movies made today are vapid, puerile and meaningless. True grit is a classic. Whether it's a remake is beside the point. It will never lose it's shine or cease to stand out among most other films. This film is poetic, timeless, artful and true. If you don't like it, hopefully you may live enough until you will one day.",
      "total_reactions": 0,
      "user": "Chapstick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2011
      },
      "score": 9,
      "text": "A visual feast containing great art direction, cinematography but more than that really good performances from the Bridges, Damon and newcomer Steinfeld. Especially Steinfeld carries the movie with great conviction and emotion. The Coen Brothers takes on a involving western adventure and by the end I felt like I had gone back in time and witnessed a plausible inspiring story. Very good film.",
      "total_reactions": 0,
      "user": "AVCITY"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "A truly incredible movie. Amazing acting by every character, gorgeous and realistic scenery, a somewhat cliche vengeance plot that is redeemed by the sparse (but impressive) action moments that are entertaining and suspenseful. One of the best westerns I have ever seen, and definitely a must-see movie. I adored every second of this film thanks to the brilliant acting and superb excellence in every department. On the ride to the conclusion, there is witty and interesting dialogue, beautiful western scenes and a few great cowboy battles. Nothing disappoints in True Grit.",
      "total_reactions": 0,
      "user": "Jman4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "Headed by strong acting from Hailee Steinfeld, Jeff Bridges and Matt Damon, lifted by an eye-popping cinematography, filled with witty dialogues and beautifully directed by the Coen Brothers, \"True Grit\" is a near-perfect masterpiece and one of the greatest cinematic accomplishments of the year.",
      "total_reactions": 0,
      "user": "Potter17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "MÃªme si l'on s'intÃ©resse plus aux personnages qu'aux sÃ©quences de fusillades, il est quelque peu dommage d'arriver Ã  s'ennuyer devant ce film. Mais les joutes verbales que se lancent les protagonistes, la mise en scÃ¨ne soignÃ©e, les interprÃ¨tes, la reconstitution d'Ã©poque, la musique et la bande son rÃ©parent cette erreur, nous permettant de regarder un western dans la plus pure tradition...en mieux!",
      "total_reactions": 0,
      "user": "avatar16"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "True Grit tells a classic western story.  After her father is murdered by lowly criminal Tom Chaney (Josh Brolin), 14 year-old Mattie Ross (Hailee Steinfeld) hires the drunken old US Marshal, Rooster Cogburn (Jeff Bridges) to help her track down Chaney and bring him to justice.  Texas Ranger, LaBeouf (Matt Damon), who is trying to track down Chaney for a separate crime he committed in Texas, accompanies them on their journey.  The ten Academy Award nominations True Grit earned including nominations for the Coen Brothers, Jeff Bridges, and Hailee Steinfeld were all very deserved.   Read the full review at:",
      "total_reactions": 0,
      "user": "TheMudDoctor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "True Grit shines because of it's brilliant direction, acting and it's set and costume design, making you feel like you're back in the Old West. It's a worthy companion to it's source material, although I felt it should have gone on a little longer. 3 1/2 out of 4 stars.",
      "total_reactions": 0,
      "user": "marnee96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "I don't usually watch a lot of westerns, but this one was good. A great story really the only thing you can talk about, but thats not a bad thing by any means.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "There isn't a remake here so much as there is a retelling of a classic story, someone else's interpretation if you will. Joel and Ethan Coen go down a different path from their unique storytelling and take on a Western, one which John Wayne occupied in the original outing. The Coens take a very toned down approach to what we are accustomed to see in their films, but they still have an eccentric tone to the film when the dialogue comes into place. Hailee Steinfield delivers a confident and mature performance as Mattie Ross, a young girl travelling away from home to see justice take place after a ruthless man murders her father, she is a well read and surely individual, wanting the help of the local bounty hunter, Rooster Cogburn, played with grit and hardened experience by Jeff Bridges, who begrudgingly agrees to help this 14 year old girl track down Tom Chaney (Josh Brolin), the man who committed the murder.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "Powerful performances. Excellent writing. Raw western violence. True Grit is a masterpiece- in every sense of the word. The Coen Brothers have performed flawlessly once again.",
      "total_reactions": 0,
      "user": "Critic2012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "The movie starts of at very slow pace but slowly gathers momentum. the movie centres around a girl who just lost her father to a brutal murder and she vows to exact revenge on the murderer with the help of a marshal and a ranger. superb performances by hailee steinfeld. Jeff bridges once again performed superbly alongside matt damon. For action movie goers, this is not the movie for you. A brilliant western movie.",
      "total_reactions": 0,
      "user": "Boozerx7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "True Grit is... well, just that: truly gritty. Leave it to Joel and Ethan Coen to take an average old western and make it into a new cinematic classic. And give it up for Jeff Bridges and Matt Damon!",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "One of the most overrated movies of all time. Started brilliantly and continued to be good until they got to the antagonists...then it just went downhill from there. Had potential but they botched the climax and ending.",
      "total_reactions": 0,
      "user": "aznassassin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "The cohens are none for the creative writing and while they did a solid job with the script i just couldn't get over the fact i didn't understand what Jeff bridges was saying but hey maybe that made his part more enjoyable to watch.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "First off, I would give this a 9.75 out of 10. Acting is great. Everyone does a great job. Score is pretty good. Story is also good. I honestly think true grit was robbed in the oscars. I mean it deserved a few at least. Overall, this is a great film, and a great remake. You really should see this movie",
      "total_reactions": 0,
      "user": "Juanolo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "A great movie with some outstanding acting. A simple story that carries great depth. The Coen Brothers really understand how to craft a movie. A western that shines in a genre that is presumably gone. They have reinvented it.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "After their 2007 No Country for Old Men, the Coen brothers try their hand at a true western with True Grit, an adaptation of the novel of the same name which John Wayne won his only Oscar for the 1969 version.",
      "total_reactions": 0,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2013
      },
      "score": 5,
      "text": "I like the Coen Brothers as directors and they do a good job here as well, as do the actors, but the movie was honestly boring. I have no issue with slow movies, but the first hour plus was extremely boring. However, after LeBouef gets shot, the film certainly picked up big time. If the whole film was the second half, it would've been more of a 7, but with the beginning being about a 3, it's hard to give it any higher of a rating than I have.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "The Cohen brothers couldn't disappoint me if they tried. True Grit is beautifully made and acted very well. Watch out for this one when the cinematography Oscar is announced.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 8,
      "text": "There's some supreme directorial work here, but \"True Grit\" is most notably carried high by its collection of pristine performances.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "I expected it to be quite boring, and only watched it because it was nominated for Best Picture. I was pleasantly surprised, and found myself rooting for the three main characters. The acting was quite good. The pacing was well balanced and I never became bored. Jeff Bridges delivers a memorable performance definitely worthy of the Oscar. The movie deserved the Oscar more than The King's Speech, which failed to move me. If they keep on making westerns like this, I will continue to watch them.",
      "total_reactions": 0,
      "user": "Swati"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "Not was I was expecting. First off, this is a great film! The Coen Brothers really did a good job of adapting a remake with an identity all its own. Many critics and alot of viewers have raved about how this new version is much better than the original. However, I personally feel like it's not that much better than the original. This version adds alot to the story, but even with a fresh touch and interpretation, the story didn't feel all that intense nor interesting. With this being said, this fault may not even be because of the films; the story is adapted from a book. That's really my only sort of negative thing about the film. I was led on to believe this new version is tons better than the original, but I liked them both about the same.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "True Grit. WOW! This movie was very enjoyable to watch. It had some comedy, some drama, some action and some thrill! Very good motion picture. The story was good, but I felt it was a bit straight forward and predictable. And without subtitles, Jeff Bridges was quite hard to understand. But it overall it was a great movie!",
      "total_reactions": 0,
      "user": "ag10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "So much better than the original! It's way more realistic and way more entertaining. The performances were all great especially Jeff Bridges. The story moves a lot faster than the old one and these actors seem to fit their roles a lot better than the actors in the original. My favorite part was the climax. It was so much more satisfying than the old True Grit's sappy last 5 minutes. In this ending, nothing is completely happy and forced. It's cool how it doesn't explain Matt Damon's fate. That makes the ending way cooler when you don't know what happens to every single character.",
      "total_reactions": 0,
      "user": "mds03"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "The Coen Brothers continue to direct gems.  True Grit is a well written, acted, and directed western that dies justice to the original.  Jeff Bridges also does a great job playing a role made famous by John Wayne.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2016
      },
      "score": 6,
      "text": "Predictable and unexpected at the same time. Why i'm saying this, is because some scenes were really surprising. While the overall plot was predictable.",
      "total_reactions": 0,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2014
      },
      "score": 9,
      "text": "The Coen Brothers remake of the classic western is one with grandiose style and wit, and it even feels authentic. Bridges and Damon shine here, and they carry this old-style movie made in the 2000's.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "New grit is true to its roots.",
      "total_reactions": 0,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "One of the Coen Brothers' best pieces of work. As always, it includes the Brothers' signature dark humor and clever plot progression. The film is very culturally accurate and ties you into the story to keep your attention for the full 2 hours.",
      "total_reactions": 0,
      "user": "willkulka"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "One thing we can expect from a Coen brothers' movie is strong character building and performance. And True Grit does not disappoint at all. The characters are generally strong and feel unique. However, Mattie stands out on a shining pedestal. Her performance is strong and her character  although difficult to bring  very convincing. Notable too is the performance of Jeff Bridges, who succeeds in setting down true grit.",
      "total_reactions": 0,
      "user": "Jwv"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "This movie saw the Coen bros. at there best. This movie was masterfully crafted and acted. This may have even surpassed the classic, which is hard to do, but if anyone can do it, the Coen brothers can. This winning multiple Oscar nominations, including best picture, best actor (Jeff Bridges), and best supporting actress (Hailee Stienfeld). Loved this Coen brothers remake!",
      "total_reactions": 0,
      "user": "jools123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "I'm glad I never have to watch True Grit again. It just really was not my style at all. Mattie's father was killed, and in a way this is her coming-of-age story and one of her defining life moments even if it doesn't go the way as planned. Originally Mattie does seem like a parent to me because of her tremendous responsibility of actually finding her father's murderer and the way she orders the men Cogburn and LaBoeuf around to do what she wants.",
      "total_reactions": 0,
      "user": "hanneguacamole"
    }
  ]
}