{
  "mc_avg_user_score": 6.2,
  "mc_metascore": 58,
  "mc_mixed_rating_frequency": 49,
  "mc_movie_name": "Turbo",
  "mc_negative_rating_frequency": 17,
  "mc_positive_rating_frequency": 60,
  "mc_pro_critic_reviews": [
    {
      "critic": "Laremy Legel",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 85,
      "summary": "Particular credit must be given to Samuel L. Jackson’s voicing of Whiplash and Paul Giamatti’s work on the voice of Chet. The chemistry between the two is awesome, hilarious even."
    },
    {
      "critic": "Genevieve Koski",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 80,
      "summary": "There’s nothing remotely revolutionary about Turbo’s underdog-sports narrative, but that’s okay—it’s one of the sturdiest plots in film for a reason—and the film’s emotional beats are no less potent for being expected, thanks to the ground-level focus on the human-snail relationships that fuel them."
    },
    {
      "critic": "Nell Minow",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 75,
      "summary": "The movie gets a bit slow, with too much time spent on the human characters, who are dreary and underwritten, compared to the big dreams of the little snail. But the film picks up when the racing snails come back onscreen, thanks to the adorable character design, with expressive use of those googly eyes, and especially to the voice talent."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 75,
      "summary": "A fresh, fast and funny little fable."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2013
      },
      "score": 75,
      "summary": "While there's no denying that the film is a harmless, wholesome, and heart-warming ride crafted with polish and skill, it's also so predictable that you'll see every twist in the story driving down Fifth Avenue."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 70,
      "summary": "In the end, Turbo is an unambitious movie about a very ambitious character, but it has an infectious sense of fun. Don’t expect too much from it, and you’ll be pleasantly surprised."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 70,
      "summary": "A series of strong emotional crosscurrents tied to the notion of winning and losing are in the hands of a very eclectic and capable cast."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2013
      },
      "score": 70,
      "summary": "Here, the laughs come not from the silly voices but a blend of snappy editing and clever character bits, including a recurring joke about an inappropriately named sidekick who calls himself White Shadow (Michael Patrick Bell)."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 67,
      "summary": "By the time Turbo reaches the finish line, this new iteration of the fable about pursuing one’s dreams no matter how unlikely they seem joins the winner’s circle without quite nabbing the trophy."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 67,
      "summary": "For all its chronic familiarity, the movie has its minor pleasures, many of them visual. Though at this point it's basically a given that a new studio-animated movie will look good, Turbo often looks downright exceptional."
    },
    {
      "critic": "Trey Graham",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 65,
      "summary": "Turbo is harmless good fun — and impressionable kids could take worse lessons away from the multiplex."
    },
    {
      "critic": "Matt Zoller Seitz",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 63,
      "summary": "Turbo is just strange and lively enough to make you wish it were better."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 63,
      "summary": "Has some appealing characters, a few laughs and then devolves into a predictable Tortoise and the Hare spinoff."
    },
    {
      "critic": "Jen Chaney",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 63,
      "summary": "A derivative but nevertheless good-hearted movie that’s peppered with enough clever touches to engage adults as well as moviegoers of the smaller, squirmier variety."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 63,
      "summary": "Turbo makes an entertaining go of it by borrowing very liberally from the “Fast & Furious” franchise — Michelle Rodriguez even voices a character — and sticking a slime trail onto “Rocky” for the rest."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 63,
      "summary": "While small children may be enchanted by this little gastropod that could, adults will be more sorely tested. For all the horsepower Turbo boasts about, the movie tends toward the sluggish — as in slow as a slug."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 63,
      "summary": "As a film about social issues, and simply being yourself, it's commendably progressive, going so far as serving as a kind of coming-out story."
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "Rather than bionically enhancing all its characters, a better movie might have found ways to celebrate their sloth and slime."
    },
    {
      "critic": "Ken McIntyre",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "Paul Giamatti shines as Theo’s pessimistic brother Chet, and the uplifting message never smashes you over the head."
    },
    {
      "critic": "Anna Smith",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2013
      },
      "score": 60,
      "summary": "Kids should be game for the ride, and the colourful characters offer humour and poignancy: Paul Giamatti’s cautious snail Chet shares a sweet friendship with reckless Turbo. Comparisons with Pixar’s ‘Cars’ are easy to make, but that’s no bad thing."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 60,
      "summary": "Families who have already raced to “Monsters University” and “Despicable Me 2” will find Turbo an acceptable third-place finisher. A sort-of escargot-meets-“Cars” adventure, it has some sharp vocal turns and remains fun even when its inventiveness runs out of gas."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 60,
      "summary": "Competent, pretty funny in places, awfully nice to look at, that sort of thing. There’s just not a lot of excitement, though."
    },
    {
      "critic": "David Hiltbrand",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "Let's face it: Kids aren't a very demanding audience. If there's color, movement, and a high quotient of silliness, they're happy."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "This is such a generic endeavor — not a poor effort, just one that doesn't attempt to do anything besides splash a screen with color and movement."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "It is interesting to note that a movie strenuously preaching the virtue of being different should be so fundamentally — so deliberately, so timidly — just like everything else of its kind... Still, even in the absence of originality, there is fun to be had, thanks to some loopy, clever jokes...and a lively celebrity voice cast."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2013
      },
      "score": 50,
      "summary": "An attractively designed but narratively challenged, one-note film."
    },
    {
      "critic": "Nick de Semlyen",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2013
      },
      "score": 40,
      "summary": "If you want to see Paul Giamatti as a snail - and who doesn't - you've come to the right place. If you don't, wait for Cloudy 2."
    },
    {
      "critic": "Nick Schager",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "Content to be merely cheerfully clichéd, it's an assembly-line kids' film that, unlike its daring protagonist, risks little, and thus reaps only modest rewards."
    },
    {
      "critic": "David Fear",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 40,
      "summary": "All Turbo does is give Reynolds, Paul Giamatti, Samuel L. Jackson and Snoop Dogg the easiest paychecks they’ll ever make, and its corporate overlords the chance to sell a few toys."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 25,
      "summary": "One of the more disappointing big studio animated features this year, a movie can't even muster the energy to be visually engaging, let alone give you anything to care about story-wise."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "There's nothing overtly wrong with Dreamworks Animation's slick (from snail slime) new summer kid-pleaser, but for a movie about a speed-obsessed snail who  just go with it  enters the Indy 500, it sure does sit there. It's easy, formulaic and light on laughs. But, for those dragged to see it by children, it won't make you want to rub salt in your eyes. So it's a faint fail or a faint pass, depending on your resilience. Ryan Reynolds voices Theo  aka \"Turbo\"  a snail inexplicably determined to be as fast as a Nascar racer. As if you could hear it coming straight out of a pitch meeting. \"Wouldn't it be funny if a snail wanted to be fast? Because they're so slow!\" Paul Giamatti plays Turbo's \"isn't the life we have just fine?\" brother, Chet, who mostly shouts things like \"It's not natural!\" and \"That's not what Mother Nature had in mind!\" at Turbo so much that you come to realize, after 10 minutes, that the villain in this film is reality. And after endless bickering between a sourpuss and an contrived dreamer, you begin to resent both sides of the argument. In fact, and this is where I'll lose some of you (but it's where my mind goes when I'm bored during a kids' movie), there's a struggling LGBT undercurrent to whole story. Especially when it comes to how much Turbo wants to desperately change who he is as a creature entirely. And, subsequently, how much he's told that he's wrong for wanting to be something different. You get relentlessly beaten about the head by both sides of the fence so much that after a while you have to clear the cobwebs and remember that you're watching a stunt-casted cartoon flick.",
      "total_reactions": 3,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Saw it with my 7 year old son  we both had a great time. Yes, the story is hardly innovative, but the animation is great, the humor is great, the voice acting is great and it's overall just a lot of fun. Turbo is getting a bit beat up for the wrong reasons. Critics should take in account the target audience, like my son, who loved it. And as an adult, believe me, you could do far worse. So, if you are 2 dudes in your 20s, you probably won't be blown away (as you might with Pixar) but for families with easy-going kids, you won't be sorry you dropped some cash on a Saturday afternoon.",
      "total_reactions": 4,
      "user": "dpc"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "\"Dreamwork's Turbo\" suffers greatly from its already weak premise, unoriginal tale, and unsatisfying group of characters, and still struggles greatly to convey a message. The film greatly struggles with making likable characters from the start, as the protagonist Turbo is hard to like due to his whiny and weakly developed personality. Turbo's growth through the film is a basic one that doesn't develop as well as it should have, with moments of humor interacting into awkward moments of slight emotional edges. While the humor derives mostly on characters, it isn't that laugh out loud hilarious that you could have gotten from films like \"Despicable Me 2\" or \"Monsters University\", and that the fact that this movies tries to be hilarious but evidently fails to show extremely funny humor (example as only a few chuckles were found in my theater in Turbo, as opposed to bawling laughter while in MU and DM2)  Along with the humor from the characters, a lot of the supporting characters are not even developed well, aside from Turbo and maybe his human counter part Tito. The themes are very (seriously) close to those from Pixar films \"Ratatouille\" and \"Cars\", and while compared to those, it is fallen back way behind. While the themes from \"Ratatouille\" and \"Cars\" are put into emotional depth with characters, you aren't as emotionally attached or even care for the ones in \"Turbo\". Starlight Plaza isn't as deeply inspired as Radiator Springs, and Turbo isn't as strong as a character as Remy, which leaves this film nearly impossible to be matched with movies similar to it. The main idea to \"Turbo\" is that \"dreams can come true to everyone\", which to the opposite of \"Monsters University\", but in this case, the message isn't able to influence the audience due to the case of Turbo's situation. Turbo's ability to get a radio attached inside of him and his physical speed is obviously aimed to reach the younger audience and to get a couple of laughs, but interacts negatively to the message because of the fact that it tells us that the impossible can happen, even though impossible. The message in \"Monsters University\" counteracts the one in \"Turbo\" much better, because it tells us the truth, even though the truth hurts. Turbo's positives are that its wonderfully animated (except the strange looking snails that are obviously prone for kids to like) and that its got some humor in it. While \"Turbo\" has its downsides, you may want to watch it on DVD instead of theaters, as \"Monsters University\" and even \"Despicable Me 2\" are much better than this film. While \"Turbo\" may be not as tight and well executed as it could have been, it is most likely that it will be the third best animated film of the summer (not that optimistic on Planes and Smurfs 2).",
      "total_reactions": 3,
      "user": "jeff_reviews"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2013
      },
      "score": 1,
      "text": "This movie is boring, poorly original, with a terrible plot and terrible characters. The \"bad guy\" is really the worst example for an antagonist in such a movie. I've seen tons of child-related movies and this one is surely the most boring.",
      "total_reactions": 2,
      "user": "marzapower"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "This just an average animation movie, has absolutely nothing original, not a good main plot, no great characters. Not even a great looking animation, I can't give it more than 5/10.",
      "total_reactions": 1,
      "user": "PStakhiv"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "A light hearted hybrid of Pixar's Cars and Ratatouille; Turbo never quiet manages to hit the high notes from either its plot or action but its entertaining enough for a watch. The comedy is sharp which helps the film but for a film called Turbo I expected it to get to it's main plot faster.",
      "total_reactions": 1,
      "user": "Ryatta"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2014
      },
      "score": 5,
      "text": "this is okay animation film . Starring Ryan Reynolds as a s snail who develops powers then  he enters a race . i find that hard to believe  a snail could enter a race  . David Soren did a terrible job at this film and as a director he has poor  creativity and imagation .",
      "total_reactions": 1,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2014
      },
      "score": 6,
      "text": "This film is a mixed bag providing some decent humor and entertaining characters but a bland and uninspired story. In all honesty there is no need for you to see this movie as it has little to offer. That being said though I have to give the film points for making me laugh a bit whereas The Croods didn’t. Now for granted this isn’t that much better than The Croods it’s only slightly better and one of the weaker films to come out Dreamworks. You are going to be fine if you don’t see this film but if you get stuck watching it its not that bad and you might laugh a bit. Look at this way you could be watching Planes which is far worse. However, Dreamworks has but together some good films over the years and it’s a shame that with Pixar falling behind in the race Dreamworks didn’t turn on their nitro shell and speed past them. If you saw the film in theaters though you saw a teaser for How To Train Your Dragon 2, which was better than the movie and has a lot of promise. Again not a bad film just forgettable. I saw it once and I’ll probably never see it again.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "DreamWorks once again delivers another fantastic, family friendly animated movie. It takes the usual underdog story about a main character who no one believes in, yet he manages to prove them wrong, and makes it worth revisiting this overused plot theme by introducing the studio's expected sense of humor and excellent animation. As always with DreamWorks movies the voice cast is an excellent selection of big name actors. This is an absolutely charming animated movie that will enchant it's younger viewers and maybe even bring a smile to the faces of their parents. All I know is that I loved every second of this animated delight.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2014
      },
      "score": 5,
      "text": "Turbo is colourful yet mediocre. There is certainly some funny moments in the film and it is an enjoyable one, but it is tainted by hit-and-miss laughs, a by-the-numbers storyline and plenty of cliches.",
      "total_reactions": 0,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2015
      },
      "score": 5,
      "text": "This just an average animation movie, has absolutely nothing original, not a good main plot, no great characters. Not even a great looking animation. No big deal",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2013
      },
      "score": 6,
      "text": "Less engaging than M.U. (which for me was pretty good but I didn't saw the monster's first movie so I had no expectations) it does't stand out but it's ok.",
      "total_reactions": 0,
      "user": "ARGO"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "Nothing substantially wrong with this movie, but I found it almost impossible not to compare it to Cars.  In the movie Cars, Lightning McQueen did not win either race but he and the characters around him became better \"people\", and succeeded.  In Turbo, victory seems to be essential to a happy ending, a more shallow message.",
      "total_reactions": 0,
      "user": "bob516"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "After a funny and promising start, in which all the snails gather in the tomato patch to gorge on the ripest fruit, Turbo deteriorates in the second half when our day dreaming hero suddenly finds himself living his dream as a racing contestant after a freak accident gives him the power of speed.There are some very nice touches along the way; The snails being picked off by the birds, the cruelty relished by the young boy, and also Turbo viewing all the cars he is racing against as very ripe tomatoes. Sadly, though, a lot of the other snails he meets when his racing dream is realised are the usual animated cutesy types. These stock characters ensure that Turbo runs out of fuel way before our slimy friend has rolled past the finishing line.",
      "total_reactions": 0,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "I can't really fault this movie too much as I really didn't expect anything from it going in. Surprisingly I thought it was allot of fun and the premise work allot better than I thought it would. Animation is what you can expect from Dreamworks, the voice acting is generally good all round (Paul Giamatti in particular giving a strong performance.)",
      "total_reactions": 0,
      "user": "Rox22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "This is an enjoyable children's movie, but it's nothing spectacular.  I would say it's similar to Monster's University you are hoping for something a little more, but it's worth a mild recommendation.  B-",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "Great animation! Very enjoyable to watch! It was unpredictable and exciting! A little bit more would be great, but it's still awesome. Looking forward for Turbo 2! My score is 8/10",
      "total_reactions": 0,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "It may lean towards kids, but honestly I really liked this movie a lot. Yet predictable, but absolutely interesting to watch. Overall, one of the best animated movies of the year so far. Be sure to check out my YouTube channel \"TheMovieManLife\" for all things movies.",
      "total_reactions": 0,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Turbo is despite having a predictable and all-seen-before plot, it is terrifically enjoyable for adults and kids. The animation looks beautiful, the 3D is insightful, the characters are lovable although flat with no depth just to carry on the movie, it is enjoyable, funny and entertaining throughout. Intense at times.",
      "total_reactions": 0,
      "user": "MovieGoer14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "The story of the movie is very similar to Ratatouille and Cars, nothing original. But you can pass a good time watching this movie with your friends or family.",
      "total_reactions": 0,
      "user": "Erikito"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "While I enjoy Dreamworks films, I never thought they were anywhere near what Pixar puts out in the department of story and humor.  \"Turbo\" isn't going to win any awards for dynamic characters or any for having a rich deep story but I found myself having a lot of fun with the film.  While it was clearly geared more towards kids rather than being a family film that both young and old can enjoy (the sheer logistics of a world where a snail can go fast and the human race kinda accepts it a little too easily will, no doubt, rub some older viewers the wrong way), I still thought the movie had some great animation, a fantastic cast doing an astonishing job and it was really funny--especially the snail character White Shadow (man, he was funny).",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "A movie about a racing snail? Yes it can be done (and it has)! Although you may have felt like you've seen something like this story before *cough*Herbie*cough*, there is a certain level of charm in watching an underdog trying to follow their dreams. Not just talking about the snail either. Some parts of the movie are a bit slow, and it takes awhile before things really pick up. Overall though, there are enough moments, character-building, and comedy to keep interest up.",
      "total_reactions": 0,
      "user": "chaostheorem"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "Very cute, nice animation. Very underrated. It's really worth watching, MUST SEE. Kids will be happy. Go and see, especially if you have children or you're child.",
      "total_reactions": 0,
      "user": "Annthisway"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "This was an all around fun movie to watch, its a good underdog story with good animations and anyone can enjoy it. Although the ending is quite silly in a bad way. Overall Score= 75/100",
      "total_reactions": 0,
      "user": "SJ-ULTI-Reiews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "A hilarious family friendly movie! Funny characters, hilarious jokes, and so much more! If your just wanting a casual movie to see during the week, then this movie is the one for you!",
      "total_reactions": 0,
      "user": "CriticalThink"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "I liked it because turbo s brother had faith in turbo. I also like it because the man was kind to turbo. I liked the way turbo won the race and good triumphed in the end",
      "total_reactions": 0,
      "user": "Lexitaylor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "Turbo is far from original and climaxes way too soon. However, its vibrant visuals and enjoyable characters will keep most younger viewers enthralled.",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "I had a great time with the movies. movie about a speed-obsessed snail who just go with it enters the Indy 500 dose make thing lot groundbreaking.But, for those dragged to see it by children, it won't make you want to rub salt in your eyes it just make you run from the salt to ensure your safe. its an great pick. i give 8 out of 10.",
      "total_reactions": 0,
      "user": "Jrc126"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 2,
      "text": "DreamWorks Animation’s Turbo tells the story of Theo, a garden snail with large ambitions. His role model, Guy Gagne, inspires him to become a racer, even though he is ridiculed for his unrealistic dreams. After a freak accident involving Nitrous Oxide, Theo’s DNA and life will never be the same. After meeting several friends along the way, he and his human friend Tito start on a journey to win the Indianapolis 500, despite the arguments put up by their down-to-Earth brothers.",
      "total_reactions": 0,
      "user": "Spikerr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "Derivative and brief, but colourful and enjoyable, Turbo sets aim at a very specific target audience and seamlessly hits it's mark in mildly enjoyable fashion.",
      "total_reactions": 0,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "Really not all that great. It's like Pixar's Cars, but without that special magic that made Cars good. It's a cute concept and borrows elements from quite a lot of other movies but doesn't straight up copy them. Overall it's okay.",
      "total_reactions": 0,
      "user": "Delaforce828"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "Amazing film. Love the animation, love the twists and turns, love everything about the movie. Also love how a snail enters a race! Turbo is a fun family film that can be enjoyed by everyone. A master film.",
      "total_reactions": 0,
      "user": "Tbone413"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "\"Turbo,\" DreamWorks Animation's latest cinematic story, isn't the studio's best film, nor is it the worst, but rather, it's a middle-of-the-road adventure with a predictable underdog tale we've seen before in other films. The story is just kind of bland and uninspired. I mean, we already know what's gonna happen at every turn, and how the film will inevitably end, so it probably wouldn't have hurt if the filmmakers did something more with the plot to liven it up. But then again, this is a movie about a talking snail who races in the Indy 500, so I guess I shouldn't have expected too much.",
      "total_reactions": 0,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "If I may break down my experience, this movie has a crazy premise; crazy characters; crazy setup; and a crazy villain. And yet somehow, Dream Works created an experience that I'll never get back. The movie is just that good. If I had any nitpicks, the character of Turbo isn't anything original, but it's not a bad thing either. Keeping the character simple was a great decision from the writing staff.",
      "total_reactions": 0,
      "user": "thifer20"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2015
      },
      "score": 9,
      "text": "I love this freakin movie! Odd movie about extremely fast snails, but entertaining as heck. It was certainly one unique movie, and it have no idea why everyone hates this movie.",
      "total_reactions": 0,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "Tamam dünyanın en yavaş hayvanını en hızlıların yarışına sokma fikri eğlenceli ve üstelik seslendirmeler de bence muhteşem. Çizgilere bayıldım ancak çok da yaratıcı bir senaryo olmadığını söylemeliyim. Açıkçası araya atılan bir kaç parça beni çok eğlendirse de, örneğin eye of the tiger ve matrix filminden bir sahne gibi yine de beklediğimden daha az etkili olduğunu söylemeliyim. Ancak yine de 6 yaşımdaki oğlumun izlerken attığı kahkahalar bir altı puan eder bence... Çocukların sevimli salyangozları seveceğine eminim. Bu arada filmin müziklerine bayılım.",
      "total_reactions": 0,
      "user": "yardash"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2015
      },
      "score": 10,
      "text": "Funny ironic and very encouraging are all the great things about this movie, all the snails play  a great and sometimes hilarious purpose( Like White Shadow)",
      "total_reactions": 0,
      "user": "Jollyjoe1000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2016
      },
      "score": 6,
      "text": "So while the formula isn't exactly the most original in the universe, Turbo does succeed at certain things. The humour I would give a 7/10, for some reason white shadow always makes me laugh. The animation looks ok.",
      "total_reactions": 0,
      "user": "ChosenKukky03"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "There's hardly anything wrong with this movie. One snail wants to dream of being the fastest snail in the entire planet. Well, here it goes. Another decent work to make up 2013 in one way or the other.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    }
  ]
}