{
  "mc_avg_user_score": 6.1,
  "mc_metascore": 55,
  "mc_mixed_rating_frequency": 30,
  "mc_movie_name": "Tusk",
  "mc_negative_rating_frequency": 27,
  "mc_positive_rating_frequency": 62,
  "mc_pro_critic_reviews": [
    {
      "critic": "Brad Wheeler",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2014
      },
      "score": 100,
      "summary": "A parable that concerns the monstrous conduct of humans, Tusk is a salute to storytelling, a comic send-up of Canadiana – with awesome references to Degrassi and Duplessis – and a terrorizing vehicle for sharply conceived absurdity."
    },
    {
      "critic": "Clark Collis",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2014
      },
      "score": 83,
      "summary": "Tusk lands close to Human Centipede territory in gross-out-ness — a warning, not a complaint — but it also has a genuinely haunting quality as Long's ties to humanity become ever more tenuous."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2014
      },
      "score": 83,
      "summary": "Despite its ludicrous turns, the movie benefits from the far-fetched events for its sheer willingness to go there, not unlike Smith's goofy, self-deprecating public persona."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2014
      },
      "score": 80,
      "summary": "An utterly bizarre, weirdly compelling story of manimal love that stakes out its own brazen path somewhere between “The Fly” and “The Texas Chainsaw Massacre.”"
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2014
      },
      "score": 75,
      "summary": "This is not a movie you forget about as you’re heading for the exit. I’m not sure it’s a movie you’ll ever forget."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2014
      },
      "score": 75,
      "summary": "There are strange, midnight movie pleasures found in Smith's movie."
    },
    {
      "critic": "Kevin C. Johnson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2014
      },
      "score": 75,
      "summary": "It has a game cast, it’s watchable, fun, sick, sad and has to be seen to be believed."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2014
      },
      "score": 75,
      "summary": "At it’s best, Tusk is outlandishly unforgettable."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2014
      },
      "score": 70,
      "summary": "It's ultimately Parks who carries Tusk, and carries it farther than it should have gone."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2014
      },
      "score": 70,
      "summary": "The picture is deeply weird, with an entrancement factor almost entirely dependent on the performance of Michael Parks."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2014
      },
      "score": 67,
      "summary": "There is a glee to the filmmaking that is matched by a greater sense of control than I've seen from Smith before, and while I think the film is wildly uneven at times, I think that's also the point."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2014
      },
      "score": 63,
      "summary": "Tusk is a mesmerizing mess that will make Joe Popcorn yak. Jay and Silent Bob will love it."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2014
      },
      "score": 60,
      "summary": "Both overindulgent and the writer-director's most fascinatingly strange movie to date."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2014
      },
      "score": 60,
      "summary": "The result is so out there that you can imagine Mr. Smith and his collaborators rolling in the aisles at their own preposterousness. If you can find your inner 16-year-old, you might just join them."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2014
      },
      "score": 60,
      "summary": "Tusk is alternately amusing, appalling and frustrating. It’s also unique."
    },
    {
      "critic": "Ben Nicholson",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2014
      },
      "score": 60,
      "summary": "The sheer insanity of the premise alone is enough to make Tusk a surreal hoot."
    },
    {
      "critic": "Kate Erbland",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2014
      },
      "score": 59,
      "summary": "Tusk is revolting, but that’s entirely the point of Kevin Smith’s admirably imaginative and utterly disgusting latest feature, a twisted fairy tale that trades on gross-out gags and visual shockers instead of actual story."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2014
      },
      "score": 50,
      "summary": "Tusk is not a particularly good movie, but the vivid anxiety dream at its heart makes it one of the most personal films this writer-director has ever made."
    },
    {
      "critic": "Simon Abrams",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2014
      },
      "score": 50,
      "summary": "Tusk is bearable thanks in no small part to its game cast, particularly character actor Michael Parks's Vincent Price-esque baddy."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2014
      },
      "score": 50,
      "summary": "Tusk is kind of terrible, annoying and self-congratulatory in all the ways we’ve come to expect from Smith (without even, say, any of the silly sweetness of the 2008 Zack and Miri Make a Porno). But Tusk is at least trying to be about something."
    },
    {
      "critic": "Thomas Lee",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2014
      },
      "score": 50,
      "summary": "Crazy plot aside, Tusk offers some thought-chewing ideas on human duality, both good/evil and man/beast."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2014
      },
      "score": 50,
      "summary": "The chief argument regarding his (Smith) \"Human Centipede\" riff is pretty basic: good trash or stupid trash? I'd say roughly half and half."
    },
    {
      "critic": "William Goss",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2014
      },
      "score": 50,
      "summary": "This feature-length joke isn’t for us so much as it’s on us for holding out hope that sheer weirdness might be enough to sustain this lark through to its violent finish."
    },
    {
      "critic": "Noel Murray",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2014
      },
      "score": 50,
      "summary": "Even for a fairly low-budget movie, Tusk doesn’t feel thought-through, or focused enough."
    },
    {
      "critic": "Mike D'Angelo",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2014
      },
      "score": 42,
      "summary": "Like most self-conscious attempts at a “midnight movie,” Tusk lacks the conviction that would make it anything more than an outré curiosity; it’s essentially a filmed dare, combined with fan service."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2014
      },
      "score": 38,
      "summary": "It’s been a while since there’s been this much dead air onscreen; over and over, Smith sets up a sequence, lets his actors shpritz, and stands by as the energy fades into giggly catatonia."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2014
      },
      "score": 38,
      "summary": "There’s a fine horror film inside Tusk, but it’s only 20 minutes long. The rest is just blubber."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2014
      },
      "score": 38,
      "summary": "In this not-even-faintly scary, rarely funny horror comedy, Smith is still sucking down big gulps of empty calories and hoping we’ll laugh at his belch."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2014
      },
      "score": 38,
      "summary": "It suggests the worst possible gene splice of a barbed Terrance and Phillip South Park appearance, Fargo's blithe condescension, and the smuggest of Quentin Tarantino pastiches."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2014
      },
      "score": 37,
      "summary": "Tusk seems to harbor no grander ambitions than to create a gross-out gag."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2014
      },
      "score": 36,
      "summary": "It's not even that the film shifts wildly in tone as much as the fact that none of those tones work at all: the horror parts aren't scary and, surprisingly for Smith, the comedy bits aren't funny."
    },
    {
      "critic": "Gary Goldstein",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2014
      },
      "score": 30,
      "summary": "This tonal mishmash is a misfire of literally gross proportions."
    },
    {
      "critic": "Stephen Whitty",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2014
      },
      "score": 25,
      "summary": "Tusk is a step backward into an insular world. True, it will probably play well to gore fans, and that dedicated audience who already cheer everything Smith does."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "A film that I had really high expectations for (probably too high). I'm a huge fan of the SmodCast show Kevin Smith and Scott Mosier host and when I heard \"The Carpenter & The Walrus\" episode I couldn't wait for them to make this film. The final product is a film which I admire more when thinking about it rather than when I watched it. Individual scenes are great, Michael Parks is great, Justin Long is surprising great and everyone involved all commit to their roles commendably. However, I feel that the whole product is too uneven, and the final scene had me more baffled then amused. Also be warned that listening to that episode of their podcast ruined some of the surprises of the movie for me so just a heads up.",
      "total_reactions": 2,
      "user": "Longbottom94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2014
      },
      "score": 0,
      "text": "I don't mind high-concept films, i don't mind gore, the bizarre films, i don't mind comedy, but unfortunately this film fails (spectacularly) on all of those fronts. Easily the worst film I've been unlucky enough to buy a ticket to for many, many years. A nasty, humorless, adolescent, heavy-handed, badly acted crap-fest that leads one to wonder exactly how the supply-side of the crack trade keeps up with Kevin Smiths evidently Herculean intake. If you are a Smith fan-boy and you are STILL supporting Kevin and his films, it's not too late to shake off your uncritical and blind devotion (he will never write another Clerks) and find something worthwhile to align yourself with.",
      "total_reactions": 2,
      "user": "Max_Kadillac"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "Come back to us, Kevin Smith.  I know what it's like, I used to smoke weed every single day.  Eventually, it makes you think that your ideas are much better than they really are.  You don't realize it until you take some time off.",
      "total_reactions": 1,
      "user": "Motoflou"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "For those of you who enjoy Kevin Smith, as a writer, director, comedian, pot smoker, or just a fat guy, this is the movie for you to watch. If you don't, then this may not be the movie for you, because this is about as Kevin Smith as it gets. If you have no idea where you stand, then watching this movie is certainly what you should do.",
      "total_reactions": 1,
      "user": "ToFewViews"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2014
      },
      "score": 0,
      "text": "Kevin Smith, whose repeated threats in recent years of permanently exiting the world of filmmaking have taken on the dubious credibility of retirement announcements from, say, most classic rock bands, has apparently found his creative mojo once again with the batsh*t crazy Tusk. Smith's previous film, 2011's Red State, was justifiably poorly received by critics and audiences, souring him even further on the filmmaking process. Then in 2013, a bizarre discussion on an episode of Smith's SModcast podcast hastily inspired him to write and direct Tusk, a high-concept movie (in more ways than one, I'm sure) that can be summarized with one sentence: Los Angeles podcaster visits Manitoba and gets kidnapped by a lunatic who turns him into a walrus. Still with me? Smith, during the film's second TIFF screening I attended after its world premiere the night before, joked that he had reached the point in his career where \"I don't give a fu*k anymore\", but just because Smith has reached a bitter crossroads in his career that's resulted in quite literally one of the worst movie experiences I've ever sat through doesn't mean you should also be subjected to the man's lack of impulse control.",
      "total_reactions": 10,
      "user": "MediaboyMusings"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2014
      },
      "score": 1,
      "text": "Wow! How the mighty have fallen. The movie's trailer looked ok, but once the movie started I was just waiting and waiting for something good to happen. The movie tries to be funny and scary, but is neither. Die hard Kevin Smith fans will enjoy it, but it isn't a good movie at all. The pre-climax scene is disturbing, but that doesn't make it scary at all. It seems more like one of those movies that seemed great on paper, but doesn't look good on the screen at all. The movie is about a podcaster named Wallace Bryton ( (Justin Long) who is a total jerk and has no regard for the audience he talks about in his podcast, but goes to Canada to interview the Kill Bill Kid who had a terrible accident. When the inital meeting doesn't turn out as expected, the podcaster finds a letter written by a mysterious adventurer who lives in the middle of nowhere in Canada. From there, the podcaster arrives to the mansion where the mysterious old man adventurer Howard Howe (Michael Parks)  talks about his stories and how he befriends a walrus. The old man is obsessed with everything about walruses. The podcaster drinks tea with the old man and soon realizes that his tea has been posioned. Then, flashbacks go to the happy days of Wallace and his beautiful girlfriend Ally Leon (Genesis Rodriguez) before all the torture begins. Rodriguez is the only good part of the movie. She plays a really great part.",
      "total_reactions": 7,
      "user": "Whiskey187"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2014
      },
      "score": 3,
      "text": "I followed Kevin Smith's work on Tusk very closely as I listen to his pod-cast. I love his stuff, sure the guy has bad movies but most directors that have been in the business as long as he has have made at least one less-than-stellar film. So naturally I was excited to see what Kevin Smith did with this material. When him and Scott came up with the concept, I remember thinking it had potential to be a great horror-comedy if handled right.",
      "total_reactions": 7,
      "user": "NyxFears"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2014
      },
      "score": 0,
      "text": "This movie was a piece of trash!!! I love horror films, but this was beyond bad. The premise is ridiculous - something that you'd expect from a bad TV movie made on USA Network or something. There's nothing scary about it - it's a gore flick minus the ... uh gore... and it was an infuriating BORE. Save your money folks. I kept wondering while watching -- WHO approved this film and funded it??!!!",
      "total_reactions": 8,
      "user": "marco34la"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2014
      },
      "score": 4,
      "text": "Oh, A24 Films, why did you do this to us? You pamper us with amazing and unique movies like Locke, Spring Breakers, Enemy, and Under the Skin, and then you give us this? Not only is this movie unoriginal and lazy, being derivative of The Human Centipede (which if that’s your starting off point, then you’re already kind of screwed), but it’s also tonally inconsistent and boring.",
      "total_reactions": 5,
      "user": "MattCipolla926"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2014
      },
      "score": 4,
      "text": "While watching this movie, I couldn't figure it out: starts as a creepy thriller (with nods to \"Human Centipede), tosses in campy elements and features several extremely verbose rants (featuring an uncredited Johnny Depp in heavy disguise…again).  Then I discovered it was written/directed by Kevin Smith, which explains a lot. Justin Long plays a podcaster who travels to Manitoba and discovers a man with eloquent stories, only to find himself captive and turned into a walrus. This bizarre curiosity offers some fun, but lots of head-scratching. Ultimately, it's too self-indulgently talky and downright silly. NOTE: Stay thru the credits to hear Smith in the actual podcast that served as the inspiration AND to see Depp in one final gag.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "One of Kevin Smith's best! Michael Parks was brilliant! I was really into it until the very end. That ending......I walked out kind of in disappointment, but then as my buddy and I started to digest it, it started growing on me. When you think of the ending in these terms: Kevin Smith was likely just sitting around planning this movie and I can envision him saying...\"How do we end this? You know what would be funny...?\" It is beautifully filmed as well. I'm stuck between a 7 and 8 out of 10...probably a 7, but the guilty pleasure side of me wants to scream EIGHT!",
      "total_reactions": 2,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "This horror comedy works even when it goes to the absurd.  I am a Kevin Smith fan (minus Cop Out but I even like Jersey Girl) and this film has many of his normal traits.  I can see why this might not work for some especially after the big cameo, but I kind of dug this film even the big fight scene.  B+",
      "total_reactions": 2,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "Kevin Smith's black comedy horror is a sly dig at torture porn and all the better for it. Genuinely unsettling, \"Tusk\" is a film that will stay with you for days. Highly effective and well worth watching.",
      "total_reactions": 2,
      "user": "manofthemoon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "An interesting coincidence occurred on the drive home from seeing this movie. I was listening to my local rock station, and the song “More Human than Human” by Rob Zombie came on. As I listened, I couldn’t help but feel the song was all too appropriate for the experience I’d just been through. Both pieces of work were twisted, unique, and contained a dark comic edge. Not to mention the incredibly apt title of the song, poignantly reflecting a central point of the film. It caused me to appreciate even more what was already an incredible and chilling experience brought on by one of my all-time favorite directors, the one and only Kevin Smith.",
      "total_reactions": 2,
      "user": "CapnAmar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "This film is just, amazing. I think it is one of the best films I've seen in a long time, it has something most films don't. It doesn't take itself seriously, whilst it may appear this way to someone who doesn't know anything about Kevin Smith, but this is just amazing. After watching this film, I have decided that I do in fact, want to be turned into a walrus man, this film is going to help me live my dream",
      "total_reactions": 2,
      "user": "IamTheWalrus"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "Ones and zeros?  Give me a break.  This movie was hilarious.  It's a perfect send-up of all the torture porn/gore flicks that we've been inundated with.  Perhaps this has gone over the heads of the reviewers here?  \"Now, we'll finally get the answer to the question that's been burning ever since we crawled out of the surf: Is man actually a walrus at heart?\"  If you go into this movie looking for anything other than Clerks/Dogma satire and subversion, just stay home.  It's more like an 8/10, but I'm attempting to balance two ridiculously pedantic reviews.",
      "total_reactions": 10,
      "user": "madmantwentyone"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "One of the most consistently funny movies throughout its entirety that has released in some time. The humour isn't dictated by gags or literal jokes but the actors reactions to situations. In addition, the universe of the film in more, if you will, rooted in the real world more so than most comedic films. What I mean by this is that despite its absolutely insane concept, generally everything about this movie is a \"serious\" world rather than, say the universe \"This Is The End\" takes place in. This contrast makes for a really interesting movie. You'd never know the budget is low as the dialogue takes it through the few sets perfectly.",
      "total_reactions": 5,
      "user": "MikeyMo"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2014
      },
      "score": 9,
      "text": "This movie isn't for everyone. Though If you are a Kevin Smith fan or into B rated horror movies then you are in for an amazing treat. Kevin Smith spins a wonderful story of a man wanting to relive the one true friendship in his life that just so happened to be with a walrus.",
      "total_reactions": 3,
      "user": "ShadowScathe"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "I thought that it was a funny, yet horrific torture movie, that will leave me terrified of walruses forever. With great acting and an original plot, Tusk brings out the best of Kevin Smith..in my opinion...",
      "total_reactions": 3,
      "user": "TotallyEpicHD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 10,
        "year": 2016
      },
      "score": 8,
      "text": "There's some surprising depth underneath this weird as hell horror-comedy. Themes about humanity being the real monster and human cruelty can be found throughout. It can be hard to pick up on them though. Most of the time you're too busy being baffled by everything else that's happening onscreen.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "A true oddity if ever there was one. A young podcast presenter visits Canada and ends up talking to an old man that says he has stories that the guy will find hard to believe. One involves his encounter with a walrus and his wish to rekindle the friendship. What happens next is funny, horrific and original. Maybe too talky for some looking for all out horror, but for those looking for something miles away from the mainstream this is right up your street",
      "total_reactions": 0,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2016
      },
      "score": 8,
      "text": "I have such mixed feelings, the internal conflicts still clash, hours later. I intensely disliked the main character, in equal parts for his character and him being such an awful actor. Maybe it's just the strange place I'm in myself. In spite of it's flaws, I quite liked it.",
      "total_reactions": 0,
      "user": "sometimes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "I don't pretend to be a film critic, but I will give a layman's review of how I reacted to the movie.  Overall I liked the movie and was entertained by it. It was a smart movie. It succeeds at being both funny and scary...up to a point. Michael Parks was GREAT. He basically made the movie an 8. Without giving anything away, at the point when we see Mr. Parks' finished masterpiece the movie lost steam for me.  I loved it until that point, when it went from being horror to absurdity. Unfortunately I was also aware that the inspector was being played by Johnny Depp, so that was distracting - I would have liked to have seen somebody in that role as entertaining as Mr. Parks was in his.",
      "total_reactions": 0,
      "user": "hapycampr2002"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 3,
      "text": "You know i honestly didn't expect this film to amongst the worst films of 2014 with the likes of Transformers: Age of Extinction and I, Frankenstein. Seriously though WHAT THE F**K!!!! was was Kevin Smith thinking when he was making this film its neither scary or funny and all it does is leave you with your hand over your face the whole time. Everything about this film pissed me off from how its **** story begins (in the bathroom of a Canadian bar) to its horrible f**king ending. I seriously cant say much more about this film i don't even care to explain its story because it doesn't matter no one should ever watch this movie simple as that. The fact that this is even getting a sequel is a f**king disgrace i just hope Clerks 3 isn't this bad.",
      "total_reactions": 0,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2015
      },
      "score": 3,
      "text": "This film is a highlight of Kevin Smith's inability to direct a coherent movie from a singular, stupid idea. Smith's dark brand of humor is a tempting bait that fails to develop into a full fledged meal.",
      "total_reactions": 0,
      "user": "Olivander_Wilde"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2015
      },
      "score": 2,
      "text": "I like Kevin Smith, I like most of his movies, and horror is my favorite genre.  That's the only reason I gave this a 2 instead of a 0.  It is easily one of the worst movies I have seen in the last couple years.  The kevin smith fan boys that will never say anyting bad about him will try and tell you all kinds of BS about how this is a tongue in cheek jab at horror/torture porn and how subtle and witty it is.  It is none of that, it is simply a poorly executed movie in every way.",
      "total_reactions": 0,
      "user": "brafcauknid"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "I didn't had expectations when the movie started.The story is original and weird the makeup for the walrus are amazing and he acting is really good.The movie is disturbing only when Justin Long's character start to change.Unfortunately the movie is not so funny and the main theme is stupid,plus it's a pretty slow movie.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2014
      },
      "score": 5,
      "text": "its an ok movie. i think some scenes dragged on, and typically this would have been better as a short. the script was great, justin longs character was ok. the makeup was ok too. glad to hear fleetwood macs song in the film.",
      "total_reactions": 0,
      "user": "jrodfilms"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "It is terrific, and it is absolutely one of the scariest and one of the most disturbing movies of 2014. \"Tusk\", directed by Kevin Smith (Red State), is a must see for horror fans.",
      "total_reactions": 0,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "This is one of the most unique films you'll come across, how it started is so cool on Smodcast #259 on June 25, 2013, and being a Kevin Smith fan since Clerks led me to this podcast that introduced Tusk's plot synopsis (in which of course was a rant/joke). And now it's on of my favourite Kevin Smith films to date after 2011's Red State also with Michael Parks, he is one of those actors that can entice you very easily by telling a story. Props to Kevin Smith and the Crew! Also Johnny Depp is amazing as always, i absolutely loved his character!",
      "total_reactions": 0,
      "user": "TrevorDevendorf"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2014
      },
      "score": 3,
      "text": "Tusk was a disturbing mess, started clean with an intriguing first act, I set my hopes high. Boy was I in for disappointment, the film eventually faded into a dark comedy with vile humor and desperate search for story, Tusk had me thinking to myself what in the world have I just seen. If the film-makers were serious about creating an uncomfortable plot so full of disgust they should have left it to Tom Six. Sorry Kevin Smith.",
      "total_reactions": 0,
      "user": "SushiStoner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2014
      },
      "score": 4,
      "text": "Odd...disturbing...so so acting...had to force myself to stay.",
      "total_reactions": 0,
      "user": "intuitivejohn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2014
      },
      "score": 2,
      "text": "Jaw-droppingly bad, which is kind of surprising because there are many ways that it could have been at least decent. An engrossing performance by Michael Parks is wasted.",
      "total_reactions": 0,
      "user": "benutty"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2015
      },
      "score": 3,
      "text": "This movie is just weird. It's overwritten, overacted and full of offensive Canadian stereotypes. It does have its funny moments, but one can't help but think that Kevin Smith totally missed the mark with this one. Even Johnny Depp, who gives a bizarre interpretation of a French Canadian detective doesn't use his name in the credits. It's just a disappointing film all the way around. It does have good make-up effects though.",
      "total_reactions": 0,
      "user": "WJS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "If you didn't like the movie, you may just not be clever enough. it was a strange ride down through this mountain of Black-comedic-gold that left me wondering if what I saw was genius or stupidity with a hint of clout.",
      "total_reactions": 0,
      "user": "lachatdurabis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "The movie is ridiculous in all aspects but it's not meant to be taken seriously. The actors all put on good performances and even in the most sinister and sickly situations, they still manage to bring humor out of it. The movie manages to pull jokes throughout but they're far between, and most of it is in the first half. All-around, just a silly movie that brings some laughs and evokes some gags.",
      "total_reactions": 0,
      "user": "Coedy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 5,
      "text": "Wallace Bryton: \"I don't wanna die in Canada!\".",
      "total_reactions": 0,
      "user": "MattBrady99"
    }
  ]
}