{
  "mc_avg_user_score": 6.0,
  "mc_metascore": 22,
  "mc_mixed_rating_frequency": 6,
  "mc_movie_name": "Twelve",
  "mc_negative_rating_frequency": 6,
  "mc_positive_rating_frequency": 12,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "I found twelve to be a fun and interesting movie, I would have to say that those critics that score it poorly are not paying attention I've seen many movies that were billed as \"must see\" that were much worse. Give the movie a chance and you will be happily surprised...",
      "total_reactions": 0,
      "user": "pacbreaker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "I think twelve was a great movie.  Shows that a troubled teen can pull it together and do what is rite in the end.  Although he has to learn it the hard way. Its movies like this that you can cuddle up to with a good girl and enjoy.",
      "total_reactions": 0,
      "user": "shepardn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2010
      },
      "score": 6,
      "text": "Twelve may not be your perfect film, but it's sufficient enough to fill your film needs. The only standout roles were Chace Crawford, but anyone between 15 and 20 (even though I'm 11) will love it.",
      "total_reactions": 0,
      "user": "mrcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2010
      },
      "score": 6,
      "text": "It seems like a movie that just doesn't really go anywhere, there's no real plot, just about a drug dealer making his rounds in manhattan. Even so, I didn't really mind it, and I'd probably watch it again. If you're looking for a lot of action, this probably isn't your flick.",
      "total_reactions": 0,
      "user": "LondonTruelove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "I haven't seen the movie yet; so I'm not going to critic on it. But I read the book, I believe it was beyond great.  I also have to remind those who already knew and those who don't know that Nick Connelly was only 17 years old when he wrote the book.  Thus, before you criticize the movie, consider the age and the lack of experience of the author of the book. I'm waiting on Nextflix to send me the Blu-Ray, then I'll let you know my thoughts.",
      "total_reactions": 0,
      "user": "CoollyF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "The load of characters add to the pace of the movie. The over-indulgent, self-absorbed rich kids, has been played, but still amazes to see how far down some go when it's done right. A great last scene wraps up an intense flick with some solid acting. Absentee parents allow for nefarious activity and it shows no one is safe from the grip of addiction. I enjoyed the storyline of White Mike struggling to find relief, forgiveness and a way out.",
      "total_reactions": 0,
      "user": "MNMovieFan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2011
      },
      "score": 4,
      "text": "Twelve is a movie with a lot of unexploited potential and a really bad directing.",
      "total_reactions": 0,
      "user": "Valentyno482"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Gossip Girl meets Limitless in this clever, fast-paced, independent drama by Joel Shumacher. The story follows Manhattan's elite teenage population and illustrates how even the wealthy aren't immune to the problems of the big city. The film has a ton of characters and is cleverly narrated by Kiefer Sutherland, who helps us keep everything straight. Twelve refers to a new designer drug on the street and the film centers around High School drop out, White Mike (Chance Crawford), who is connected to just about every one. Forced by unforeseen circumstance, White Mike has become their dealer and has all the dirt on these elite people. As for the story, it's a complicated, winding tale, that I honestly found to be intriguing. Crawford is phenomenal as the center piece to everything and finally proves that's he's not just a pretty face. A former model, Crawford has gained popularity as one of the leads in Gossip Girl and it has been said, on more than one occasion, that his looks are the reason, but he proves them all wrong with a gutsy and amazing performance in Twelve. As for the rest of the cast, it's such an amazing random mix of people that you can't help but fall in love with it. In Twelve, there are appearances from everyone from 50 cent to Macaulay Culkin's little brother, Dewey from Malcolm In The Middle, and even Lenny Kravitz's daughter. You never know whose going to show up and what their story might be. Twelve is one of the smartest and most innovative dramas I've seen in years and has earned the rare honor of being called a can't miss film!",
      "total_reactions": 0,
      "user": "Tss5078"
    }
  ]
}