{
  "mc_avg_user_score": 6.5,
  "mc_metascore": 59,
  "mc_mixed_rating_frequency": 73,
  "mc_movie_name": "Unbroken",
  "mc_negative_rating_frequency": 40,
  "mc_positive_rating_frequency": 148,
  "mc_pro_critic_reviews": [
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 100,
      "summary": "When you get through it, though, you can’t help but feel uplifted by this tough-skinned movie that can stand with the best muscular wartime dramas in the American movie canon."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 100,
      "summary": "Put this one at the top of your must-see list. Angelina Jolie might not, in my opinion, have yet reached the heights of the acting profession, but with this passionate, inspired, technically awesome and profoundly exciting chronicle of the life of Louie Zamperini, she rises to the top rank of first-class film directors in a male-dominated field overcrowded with hacks."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 88,
      "summary": "If you can take it, Unbroken will lift you like the classics of adventure cinema."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2014
      },
      "score": 88,
      "summary": "Jolie has an army of craftsmen in her corner, notably camera poet Roger Deakins (No Country for Old Men). But it's her vision that gives Unbroken a spirit that soars. In honoring Louis' endurance, she does herself proud."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 83,
      "summary": "There is a genuinely epic quality to Unbroken, cribbed from masters and capably traced. That's really all this inspiring story needs."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2014
      },
      "score": 80,
      "summary": "If the Unbroken needle stops at Impressive and doesn’t quite rise to Enthralling, it’s because Jolie stints on exploring the doubts that tortured Louis nearly as much as Watanabe’s punishments did, and whose details so enriched Hillenbrand’s biography."
    },
    {
      "critic": "Kate Stables",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2014
      },
      "score": 80,
      "summary": "Jack O’Connell’s, wiry, indefatigable Zamperini holds your attention without effort."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2014
      },
      "score": 77,
      "summary": "Ultimately, the strengths of Unbroken far outweigh its flaws."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "Unbroken may not exactly be mired in sanctimony, but it’s standing, almost up to its ankles, in an unhealthy sense that its subject — about whose simple humanity the film otherwise goes to great lengths to illuminate — is a candidate for sainthood."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "Jolie's account is mostly accurate but coldly clinical. The story is effective in relaying Zamperini's narrative but lacks both the gut punch one often gets from prisoner-of-war narratives and the full catharsis one expects at the end."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "Jolie keeps the narrative afloat thanks to first-rate craftsmanship, a few well-honed moments of bonafide suspense, and a terrifically restrained Jack O'Connell in the lead role. While it only hints at the sweeping epic that never fully materializes, Unbroken offers further proof that Jolie's directorial instincts pass muster alongside her other talents."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 70,
      "summary": "A rousing old-fashioned yarn with numerous exciting set-pieces and an uncomplicated hero you root for all the way through. It’s entertaining throughout and made with a high level of technical skill. If made 40 years ago, it would have been a leading Oscar contender and a huge hit, whereas today it’s a bit “meh” in both categories"
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 70,
      "summary": "It is a harrowing journey, and an inspirational one. But, as director, Jolie takes far too long to tell it, particularly in such a conventional manner."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2014
      },
      "score": 70,
      "summary": "A great true story is telescoped down to a merely good one in Unbroken. After a dynamite first half-hour, Angelina Jolie's accomplished second outing as a director slowly looses steam."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2014
      },
      "score": 67,
      "summary": "Zamperini’s life story is genuinely inspirational, but the movie seems fashioned as a standard-issue profile in courage, with Zamperini, after a troubled youth, transformed into an almost saintlike figure. He would have been every bit as inspirational, even more so, without the halo."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2014
      },
      "score": 67,
      "summary": "It's moving, admirable, and occasionally exhilarating. What it's missing is the one thing that could always be counted on with Jolie as a star: the spark of danger."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2014
      },
      "score": 67,
      "summary": "When it comes to this particular story, I find myself unconvinced in the end. Unbroken looks like the real thing, but evaporates upon closer scrutiny."
    },
    {
      "critic": "Brian Tallerico",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2014
      },
      "score": 63,
      "summary": "It’s one of those inspirational Hollywood dramas about which there isn’t anything \"overtly wrong\" with it. It’s well-cast, it looks great, it has that intense centerpiece in the raft, and it certainly conveys a true story worth telling. And yet I keep coming back to that beautiful sunrise that opens the film. It’s just too damn pretty."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2014
      },
      "score": 63,
      "summary": "Unbroken stirs a moviegoer by default; it’s an astounding story of human endurance that has been brought a little too safely to the screen."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 63,
      "summary": "As directed by Angelina Jolie, it is occasionally powerful, with soaring visuals. It also is, however, stately and slow to the point of tedium."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 63,
      "summary": "A beautifully shot, well-acted, and worthy-to-a-fault Second World War survivor story that only intermittently achieves the kind of emotional impact for which it aims."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 63,
      "summary": "The bigger problem is that neither Jolie nor the script bothers to flesh Louis out as a fully formed person with faults and fears and regrets, which keeps the film from ever capturing you emotionally."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 63,
      "summary": "Unbroken is an ambitious, sometimes moving film that suffers from a little too much self-conscious nobility, and far too many scenes of sadistic brutality."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 63,
      "summary": "Rightly, Jolie didn't want to tell the man's entire life story. But as is, at too-convenient dramatic junctures, the screenplay darts back into flashbacks of Zamperini's childhood or young adulthood, when we should really be sticking with the crisis at hand."
    },
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2014
      },
      "score": 63,
      "summary": "The film's chief misstep is taking its title too literally, and ultimately depicting Louie as an indestructible, and thus largely inhuman, superhero."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2014
      },
      "score": 60,
      "summary": "What the movie ends up in desperate need of is a sense of life made real and palpable through dreadful, transporting details, not a life embalmed in hagiographic awe."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2014
      },
      "score": 60,
      "summary": "With what we see on screen weighted too much toward pain and too little toward redemption, this is a film we respect more than love, and that is something of a wasted opportunity."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2014
      },
      "score": 60,
      "summary": "Jolie gets the dirty/ennobling job done. If the narrative is finally unsatisfying, it’s because the last vital chapter — the way in which Zamperini was able to have a life after years of unspeakable cruelty and the dashing of his Olympic hopes — is signaled in a couple of title cards before the closing credits. Unbroken proves that Zamperini could take it and make it — but make what of it?"
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 60,
      "summary": "As glossy and well-produced as Unbroken is, it doesn't stray too terribly far from Hollywood convention. In fact, its very story structure is so traditional that it's mirrored by Clint Eastwood's \"American Sniper.\""
    },
    {
      "critic": "Cath Clarke",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2014
      },
      "score": 60,
      "summary": "Jolie has assembled an A-list team – Roger Deakins behind the camera, the Coen brothers in charge of the script - but while her film is perfectly competent, it hardly dazzles."
    },
    {
      "critic": "Ian Nathan",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2014
      },
      "score": 60,
      "summary": "Lavish and sporadically powerful, Jolie's POW biopic may have just enough gravity to entice the Academy, but struggles to bring truth to an unbelievable truth."
    },
    {
      "critic": "Andrew Pulver",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2014
      },
      "score": 60,
      "summary": "Though high-minded and well-intentioned – as well as being conceived on an epic scale – there’s something faintly stodgy and safety-first about the endeavour."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "We don’t see his alcoholism and post-traumatic stress disorder after coming home, the decay of his marriage, the vengeful hatred that led him to strangle his captors in his nightmares. Nor do we see his conversion to Christianity after a 1949 Billy Graham crusade in Los Angeles, an event he credited with saving his sanity, marriage and perhaps his life."
    },
    {
      "critic": "Jeff Baker",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "Those who watch Unbroken, Angelina Jolie's movie about Zamperini's life, only have to suffer for a little more than two hours, but it's a cruel and unusually harsh punishment."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "The title isn’t “Broken,” so there’s not much doubt of the outcome. But it’s certainly regrettable, because this long and increasingly sluggish film version of the Laura Hillenbrand book celebrates an American life of singular heroism."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "One of these days, Angelina Jolie might very well direct a great movie. She has a rare talent and intense concerns and interests. But first she is going to have to suppress some self-defeating impulses that have now twice taken potentially effective films and rendered them ridiculous."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "Unbroken, is a cinematic scrapbook, a collection of well-composed scenes practically cut and pasted from “Memphis Belle,” “Chariots of Fire,” “Life of Pi” and “The Bridge on the River Kwai.” Unlike those other films, though, Angelina Jolie’s second effort as a director is more a series of similar events than a story, and lacks an underlying message except that torture hurts."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "Unbroken wants it all: the big cinematography, the close-up grit, the postcard flashbacks, and the grisly Götterdämmerung that earns directors awards. But it aches for a lighter touch -- the facts of Zamperini's life more than stand on their own."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "As Zamperini, Jack O’Connell is the film’s strongest asset. The actor holds our attention from beginning to end, making us care deeply about the man’s fate instead of becoming an empty icon of stoicism."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "Unbroken just piles on the misery without tonal shift, any sense of rise and fall, or any interest in Zamperini’s inner life, beyond his catchphrase, “If you can take it, you can make it.”"
    },
    {
      "critic": "Keith Uhlich",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "Moral and spiritual triumph lie at the end of this hellish gauntlet, but though Jolie is shooting for Christ-like passion and redemption, she only ends up slathering one man’s very real, very morbid struggles in the usual reductive “greatest generation” sentiment."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "Unbroken stumbles into most every movie of the genre in ways that suggest she (Jolie) hasn’t figured out how these things work. Suspense and pathos evade her as she turns an admittedly unwieldy biography into a dull, perfunctory and truncated film."
    },
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "Respectfully presented, Unbroken is competently made and even has a sequence or two that’s impressive, but it’s ultimately very familiar and eventually draining."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2014
      },
      "score": 50,
      "summary": "A bit embalmed in its own nobility, it’s an extraordinary story told in dutiful, unexceptional terms, the passionate commitment of all involved rarely achieving gut-level impact."
    },
    {
      "critic": "Joe Walsh",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2014
      },
      "score": 40,
      "summary": "With Unbroken, Jolie fails to captures Zamperini's life, and she focuses too much of what he endured and how he survived such suffering, crafting a lacklustre and dull film about an incredibly remarkable man."
    },
    {
      "critic": "David Denby",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 40,
      "summary": "An interminable, redundant, unnecessary epic devoted to suffering, suffering, suffering."
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2014
      },
      "score": 40,
      "summary": "The film settles into a Forrest Gumpian groove that doesn’t glorify the human spirit so much as sap it."
    },
    {
      "critic": "David Hiltbrand",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 38,
      "summary": "Unbroken is a grueling endurance test - for the audience just as much as for its cutout champion."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "I was expecting more from Unbroken, I guess its hard to have high expectations for a director with such little experience. Angelina Jolie is directing her first big film with Unbroken. The movie had a lot of hype but it didn't impress me. The movie was too long and there were long periods of time where nothing exciting was happening. I didn't care much for the cast either. Jack O'Connell is still a young actor but I felt that his role needed a better performance. Takamasa Ishihara was very strong as the main antagonist in the film. He was certainly good at making me hate him. Overall this film could have been a lot better.",
      "total_reactions": 4,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "Angelina botched this film. It had no inspiration, left out the last part of his life which was what I was looking to see. Instead I was stuck with what seemed like stock war film footage of being stranded at sea and brutality at a Japanese POW camp. How many times have you see that already? Did she run out of budget and couldn't tell the post war part of life? What she did show was flat and motionless, no peaks, no valleys. A major disappointment.",
      "total_reactions": 2,
      "user": "JamesL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "Louie Zamperini (Jack O’Connell) was an Olympic runner who survived in a raft for 47 days after his plane crashed, then endured 2 years in a Japanese prisoner-of-war camp. Through it all, he remained determined to survive. It's important to feel the desperation and suffering in a movie like this, but director Angelina Jolie has taken it to painful extremes, presenting scene after scene of mistreatment. It's effective, but went on way too long. Ultimately, it's about a man's stamina faced with overwhelming odds, but the film lacks the emotional power that would have made the suffering worth it.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "This movie definitely deserves a positive review. It's a mixture of everything good: It relateable on a historical level, personal level, emotional and spiritual level. I won't say more, but that the movie is worth seeing.",
      "total_reactions": 1,
      "user": "AaronM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "Angelina shows real talent in her second film as director. Based on the true events surrounding Louie Zampirini during WW2, \"Unbroken\" acts a testament to human strength and willpower. It shows that even during the worst of scenarios so long as one can persevere they can overcome. Or, as the film puts it, \"if you can take it you can make it.\"",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2015
      },
      "score": 2,
      "text": "An uninspiring sluggish film that has corniness written all over it. Jolie rushes through the early life of the man, shows the guy living through hell and ends on a flat note. What Zamperini went through was a tragedy and sadly was the way this film was made.",
      "total_reactions": 1,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2015
      },
      "score": 8,
      "text": "First of all I must admit, that I'm not a fan of Angelina Jolie. In fact, I never liked her. Moreover, after reading some negative reviews here I didn't expect much from her movie. However Zamperini's story (about whom I never heard before) interested me, so I decided to spend couple of hours of my life watching \"Unbroken\".",
      "total_reactions": 1,
      "user": "Smoothrunner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "After a relatively slow and uninteresting start, that is both trite and dull, UNBROKEN really takes off and becomes quite a stunner. The film does something so rare--combining the horror of war as experienced by it's victims and the victimization of it's villains. This brutal film, does an astonishing job of depicting both the courage of man and our petty evil. Angelina Jolie has made a fine and complex film that seems glossy and \"Hollywood\" on the surface but is actually something quite different underneath. Like Jolie's first film, THE LAND OF BLOOD AND HONEY, there is a humanity so strong it will haunt you.",
      "total_reactions": 1,
      "user": "LowbrowCinema"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2015
      },
      "score": 7,
      "text": "The non-fiction novel Unbroken: A World War II Story of Survival, Resilience, and Redemption is an incredibly riveting, moving biography of Olympian and prisoner-of-war Louis Zamperini that I believe is an important book to read. Naturally, a movie based on the book was inevitable; the film adaptation does do its subject justice, even if it's only sporadically compelling. Unbroken is a bio-pic about the life of Louie Zamperini in World War II, whose bomber plane was shot down, and he was forced to survive on a raft for 47 days. He was then captured by the Japanese and placed in various camps for over two years, where he was severely abused until he was rescued at the end of the war. There are a lot of great things about Unbroken: the spectacular cinematography, breakout performances from the entire cast, an explosive opening act and some genuinely moving scenes throughout the rest of the film. Angelina Jolie directs the film in a surprisingly graceful way. Despite some obviously unpleasant war scenes present in the film, Unbroken is a beautiful movie to look at. An opportunity that the film misses, however, is the effects of the war on Louie. His battle with alcoholism and PTSD is never mentioned in the film, and although it would have made the movie longer than it already is (137 minutes), there should have been an emphasis on those ideas. Even if it doesn't resonate as strongly as it should, Unbroken is compelling enough to do justice to its subject matter and a must-watch if yo're a fan of World War II movies.",
      "total_reactions": 1,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "\"Unbroken\" 10 Scale Rating: 7.0 (Good) ...",
      "total_reactions": 1,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "All right,",
      "total_reactions": 1,
      "user": "Ladanye"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "I was very moved by the film and came out of the theator in tears.  I thought of my father and the veterans he would meet for coffee in the morning and swap war stories.  I understand now.  Those veterans shared with each other things that they were reluctant to share with others who could not understand.  My only concern was that the hair and beards rarely grew!  I would think their heads would be shaved in a POW camp because of lice. But the emaciation of the actors was powerful!",
      "total_reactions": 1,
      "user": "RIDERCHI"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "When I heard that this film was directed by Angelina Jolie, I had my doubts about how good it could get to be, knowing her much more for being an actress than a director. But when I finally watched, all my doubts were erased, because this movie is pretty good. It tells the true story of a young man that, being an Olympic athlete, was caught and retained as a war prisoner by Japan in the World War II; and all the things that he had to put up to being there.",
      "total_reactions": 1,
      "user": "Dokalu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "A very competent movie that takes you through the endurance and resilience required to survive. Very well shot and smooth editing. Maybe a bit long but ultimately achieves its goal.",
      "total_reactions": 1,
      "user": "JPJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "Book was very captivating.  Movie not so much.  Way too much time spent with Japanese beating the daylights out of the hero.  Over and over again.  Very patriotic, but, very tedious.",
      "total_reactions": 1,
      "user": "Gbubrick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "I have heard so much about this movie, I finally took the time to sit down and watch it as it is rather long.  Although that being said the length didn't bother me as I thought you needed the full amount of time to tell the story and do true life justice.  For me we we all know stories of incredible human endurance, but this one will rank up there in the top of your mind.  To know actual events like this took place throughout the course of history blows ones mind.  If you haven't seen this one I would recommend setting aside an evening and taking in this historic and epic movie.  For me it hit on all cylinders, being well written, acted, and directed, as I had heard Ms. Angelina Jolie had done her homework and it shows in the movie!",
      "total_reactions": 1,
      "user": "horizonbts"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "This is a great movie. If you enjoy old fashion movies you will like this. It has long scenes and very intense ones. It helps put what it was like in this war in perspective. since its only pg-13 they couldnt really show what it was like over there but they did a good job.",
      "total_reactions": 1,
      "user": "jgray232"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "It's hard to watch the brutality of war but it's films like this that helps us to see the sacrifices that others have made for our country.  I thought the film was beautiful done and I'm grateful that Laura and Angelina have taken the time to shared their talents and keep the story alive.  The film made me feel proud that I can walk free in a country with so many great Americans.  I purchased the DVD and I also enjoyed watching the clip about Louie's life and his interview.   I will be buying a copy of the DVD for all of my family.",
      "total_reactions": 1,
      "user": "stacynelson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "It's a story of survival. Survival thorugh the worst of the worst. Yes, it's slow-paced, and no, there aren't a lot of key events that happen in this movie, and no, there isn't really any action in it. It's based on a true story and the story feels accurately portrayed, or ralistic, not to say that I know the differences between it and the movie based on it. It's worth a watch if you're okay with slow movies. You'll hate the antagonist and pity the protagonist by the end for sure.",
      "total_reactions": 1,
      "user": "Epik_Ninnja"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "Treads over familiar waters that still inspire and despite its flaws is a solid piece of work by its director.",
      "total_reactions": 1,
      "user": "james417"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "As Americans, we are drawn to bravery, courage and heroism. Louis Zamperini has each of these. Angelina Jolie, along with a stellar group of writers, vividly show us how he kept his strength and determination even at the lowest points of his life. Jack O'Connell gives one of the best breakthrough performances in some time.",
      "total_reactions": 5,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "Unbroken is my favorite book ever, so I really didn't expect (my expectations were low.to love the movie.) But I did.  I can say that the film exceeded my expectations, and I’m glad that it did. I think you should see it. Really great movie, stunning cast.",
      "total_reactions": 9,
      "user": "SamDuffrey"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "While a worthy stand alone movie, because we know the book and this man's life story, we also know that the movie, by focusing primarily on survival in a life raft and survival as a POW, misses what \"Unbroken\" was about.  It is a story of strength and weakness of character, of the people who influence our lives, of falling and redemption and falling and redemption.",
      "total_reactions": 8,
      "user": "tpcam"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "Shows what the deep hearted love of a family and a physically healthy body can endure so that the mind doesn't snap. Zamperini's heart and body pulled him through and shut out his mind from the incredible daily pain. That comes across in this movie very strongly, he says as much when they first get on the dinghy. The actor, Miyavi , playing the 'Bird' could be up for for best supporting actor Oscar.",
      "total_reactions": 7,
      "user": "Kingofspin"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "It took 55 years to get this movie done, and it took a woman to do it. The movie affects you strongly, if you have empathy. I understood the flashbacks. It reinforced what made Louis cope with his many bad situations. The bad reviews have to do with a story that not everyone thinks needs to be told, unless more of the bad stuff is left out, which it can't be. It's a story about what the human spirit can endure. Most of us can't take it. That's the point of the story, and some people don't get it.",
      "total_reactions": 9,
      "user": "ledaumas"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "This movie was quite good. It ends at the end of the war, and that's where this movie should have ended. Some people wanted to delve into the guys aftermath where he battled alcoholism and all that stuff, but that would have made this movie 6 hours long, and no one in their right mind would have sat through a movie that was all that.",
      "total_reactions": 3,
      "user": "Tick"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "A film that looks great and is well worth your time.  There were some moments that were inspiring, but many times I felt the film was lacking the soul that the source material was going for.  In the end this is a good film that I wanted to be great.  B+",
      "total_reactions": 3,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "\"Unbroken\" tells a true story worth commemorating. It's ambitious, passionate, harrowing, often rousing and immaculate filmmaking, directed with vigour by Angelina Jolie, well-acted (particularly by Jack O'Connell and Miyavi; their interactions are mesmerising) and gorgeously shot by cinematography veteran Roger Deakins. It would have benefited from a more in-depth treatment and picking up the pace a little, but the film is certainly not a bore (at least not in my opinion) and it is most certainly worth watching.",
      "total_reactions": 3,
      "user": "googolendtimes"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "The \"critics\" can shove it where the sun don't shine. I don't understand how you give a movie based on the real life events of an American hero a bad rating. Do yourself a favor and see this movie. Kuddos to Jolie for creating a movie in the spirit of Louie himself. I don't recall a curse word in this movie which is remarkable in and of itself. Is there violence...yes but no where NEAR what we see in the likes of other movies. If you've seen Saving Private Ryan you can see this as it doesn't even come remotely close to that. Most of the violent nature is insinuated and not really show (i.e. they will show The Bird swinging a cane but won't actually show him making contact). This movie is a must see for the story of it. Surviving 40+ days at sea followed by years of abuse in a POW camp is unthinkable to me and just makes one realize exactly how amazing the soldiers of the great world wars were! I gave it a 9 only because I could have sat another 15 minutes and enjoyed a little more on his life after the war.",
      "total_reactions": 3,
      "user": "Udhoop"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "An eye opening and captivating movie, Unbroken is a true story that really makes you think about human race on a deeper level, check it out i personal really enjoyed it and i know you will too.",
      "total_reactions": 3,
      "user": "nataliya3845"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "An ambitious but nevertheless overlong effort that frequently (and unfortunately) resorts to cliche, formula and the safe route in favor of taking chances that would have served the picture better. While I certainly don't expect a lot from director Angelina Jolie, I definitely expect something more inventive from the screenwriting Coen Brothers, who seem to have turned uncharacteristically timid here. Louie Zamperini's story is indeed an inspiring tale, one that deserved better treatment than it received here.",
      "total_reactions": 8,
      "user": "Brent_Marchant"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "I have to wonder if the critics were shown a different film? Or is this just the annual SLAM Angelina Jolie event. Any real negatives on this piece are down to the screenwriters . all four of them. IMO it is a stunning and top-notch film!",
      "total_reactions": 10,
      "user": "kataghaway67"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "Typical Oscar bait. It is a good adventure though. Well thought out and executed with great visuals. I found the \"Where are they now\" text at the end of the movie to be the most interesting part though. I would of wanted to see that movie instead.",
      "total_reactions": 2,
      "user": "analogkid280"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2015
      },
      "score": 2,
      "text": "I thought this would be a very interesting movie, but it is far from entertaining, and it is far too long and the pacing is far to slow.  There are a lot of scenes that just don't need to be in the film, there is to much padding.  It feels like a hundred other films that have been done before and this is one of the worst of its type.  Very disappointing movie.  Probably should have gone straight to DVD.",
      "total_reactions": 2,
      "user": "itmo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "I never thought that academy award winner Angelina Jolie can direct a magnificent dark true story into a major motion picture. Jolie directs her second film, however i did not see her first gut-wrenching film \" In the land of blood and honey\" but she gets back into the war genre and directs it so beautifully. Her directorial debut was not a success on Metacritic or Rotten Tomatoes also metacritic users but she won awards. But this movie however isn't like her first film, its like the under ratted version of it though. I have been reading the novel of Unbroken (Louie Zamperini's story) but to be honest the story kinda bored me a little bit but it is has it's entertaining moments. Jack O' Connell as Louie is a shockingly good and outstanding performance and so as Miyavi's devilish performance as Wannabe. This film and This true story shocked me and haunted me throughout and it's entertaining vibe and Jolie gives that to the movie goer.",
      "total_reactions": 2,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "Over all, it was quite an excellent movie. I really enjoyed watching it. Although the only thing wrong with it is that it feels too short. They mainly focused on when his bomber crashed and his life as a PoW. They didn't show much of his life pre-WW2, and they barely showed any of his life after it. I definitely would see this movie easily being 3 or even 4 hours long if they focused more on his life out of the war, when he was growing up to build some sort of background and extra feelings for the protagonist, and really feel sorry for him and his family when he went MIA. Also, when he returned and how he lived his life as a war hero with all the fame. It was an excellent movie, but not perfect.",
      "total_reactions": 2,
      "user": "plainawesome"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "Whoever read the book will not even remotely want to see this movie. So many great moments that I experienced when reading and was hoping to have a good visual and story wise representation to find in this picture. But not even close. The whole movie is visually so clean and nicely made, which fits the theme of world war II, POW and survival not. Then there is the scenes where you await for the moments, like when the Japanese zero plane is attacking their raft and they need to fight of the sharks underwater, which were a real threats, oh wait the sharks are just swimming peacefully around. Oh well, how...uninteresting. Some dark shapes in the night and you await a shark to jump on the raft to attack the men....oh no. Also they wouldn't even include the original national anthem of Germany in 1936 and how Louis met Hitler.",
      "total_reactions": 2,
      "user": "ChrisFilou"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "It's handsomely mounted, well-cast, it looks so great . and it certainly conveys a true story worth telling. cinematographer Roger Deakins is exellent.",
      "total_reactions": 18,
      "user": "BramStocker"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2014
      },
      "score": 0,
      "text": "The real life story of this man is sugar coated in such a painfully bad movie.  After reading the book several times, it has become one of my all time favorite books.  This movie did such a disservice to the book and to the real life events that Jolie should be ashamed to even call herself a director.  This film had the source material to be one of the greatest films of recent history, yet failed to offer any characterization or depth to just about every aspect of the film.",
      "total_reactions": 8,
      "user": "JoeQuaglieri"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "Unbroken fires all cylinders onto the audience to mount a sense of discomfort. The shocking truth and amazing direction leaves me amazed that 2015 has already delivered the goods. Unbroken stands above many in it's genre and provides viewers with a deep hearten story that is sure to give you shivers down your spin. To top it off the excellent cast forms a overall movie of the year materiel and ensures us war never changes! Unbroken is your go to block buster of 2015.",
      "total_reactions": 3,
      "user": "busbfran"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "The worst part about Unbroken is just how mediocre it is. Such a hero deserves a film less interested in trying to get its director an Oscar, and more interested in doing its hero justice.",
      "total_reactions": 3,
      "user": "cryhardhumor"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "It is Extraordinary! Angelina Jolie is taking the world by the storm with this directorial effort; Unbroken indeed has that Clint Eastwood-Steven Spielberg sense of direction, clearly Angie has been taking notes.",
      "total_reactions": 3,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "I have to admit, no matter what movie Angelina Jolie or Brad Pitt star or produce, we will go see it. All of us who like their movies are helping so many people in need because of Angelina's and Brad's causes. Who better to support? However so far, all of their movies are worth watching because they're inspirational and teach us lessons in humanity. As to \"Unbroken,\" this gives us a hero. Most of us could not withstand what Louis went through. We would love it if there's a \"Part Two.\" This would be about everything else Louis did that was not mentioned in the movie as strongly as his suffering was. That Louis misbehaved a lot, yet achieved redemption. That's another side of the same story. Movies need drama to make them interesting, so I know Angelina focused on what affects people, the drama. But we'd still like to see part 2 even if it doesn't have as much drama. It could almost be a comedy because Louis was quite a character.",
      "total_reactions": 3,
      "user": "Janewhistler"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "This is a \"we've been here before\"  movie, so I hoped Jolie would give us \"Zamperini the complex,\" and instead we get  \"Zamperini the stoic.\" My guess is this movie works for those who don't know his amazing life. Those of us who do know he was a tough nut, a great runner whose career was cut short by war, and ruined by it. Broken, he resurrected himself through religion, but only after skirting too long with self destruction, a poster boy for massive PTSD, courtesy of war and the sociopaths it breeds. What we get from Jolie is a hagiography of stoicism. We see the toughness, we just don't see the turmoil.",
      "total_reactions": 7,
      "user": "jeremyp"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "Read the book, the movie doesn't do it justice.",
      "total_reactions": 8,
      "user": "Bshop"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "When hollywood directors are out of ideas, they turn to inspiring and critically acclaimed biographies, Angelina Jolie is a culprit of such. Unbroken, the true story of Louis Zamperini- who was a famous Olympic runner who survived on a lifeboat for 40 days and taken as a prisoner at a Japanese camp. Sadly, even with the premise here, it's not a good movie. Jack O Connell does a good job, his performance is very praising. But the supporting cast is not even there, as Jolie never sheds light on them. The cinematography is slightly on the okay side but the music is lifting. The story is not as inspiring as the book and it falls flat and stretches during the climax. Overall, rent it if you LOVED the book, otherwise beware: it's not THAT good.",
      "total_reactions": 4,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2015
      },
      "score": 1,
      "text": "How do you take a story as dramatic as Louis Zamperini's and turn it into a borefest? Hell if I know, but Angelina Jolie has the secret! Stolid, tedious, she has turned his 'chockful of incredible incidents' life story into an interminable, dramatically inert TV movie.",
      "total_reactions": 4,
      "user": "Eilidh2"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 3,
      "text": "Chapter 1 of this movie could have been called \"Angelina Jolie Does \"Chariots of Fire.\"  Chapter 2: \"Angelina Jolie Does \"Castaway.\"  Chapter 3: \"Angelina Jolie Does \"Bridge on the River Kwai.\" Chapter 4: \"Angelina Jolie Does \"Flags of Our Fathers.\"",
      "total_reactions": 5,
      "user": "Harmiclir"
    },
    {
      "neg_reactions": 18,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2014
      },
      "score": 0,
      "text": "If you like to watch a guy get hit with a stick, by all means go out and watch this movie. If you don't like watching a guy get hit with a stick, stay very far away. Overall, this movie was very frustrating to watch. Scenes were dragged out making the movie a lot longer than it needed to be, particularly a raft scene and a pow camp scene. I mean, how many times can you get hit with a stick before we just tire of it and beg for the movie to end. Sure it may be a true story, but I'm quite positive there were some embellishments and exaggerations to make it more movie worthy. It's mostly a story of struggle and physical torment, and the ending just left me wondering why did they even bother making this into a movie.",
      "total_reactions": 21,
      "user": "Key_Notes88"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2015
      },
      "score": 0,
      "text": "This is a terrible movie. The plot is roughly divided in two parts: the first third of the story is about Zamperini surviving a plane crash and the remaining two thirds are extremely repetitive scenes of him suffering at the end of a sadistic Japanese camp warden. Both parts seem to drag on forever, the part in the prison camp being particularly bad and nothing more than the same scene played differently time and again. In the end, the movie is in itself a torture inflicted to the viewer by an over hyped, mediocre director.",
      "total_reactions": 1,
      "user": "dierregi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2015
      },
      "score": 4,
      "text": "Like some reviewers said, this is a series of scenes throughout Zamperini's life.  Unfortunately Angelina Jolie fails on providing any storyline except that one thing happens after another.  This guy's life is an incredible story but telling it requires more than just the regurgitation of facts.  Too bad, he deserved more than this.  She is definitely not a good director.",
      "total_reactions": 1,
      "user": "mccaff"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "good movie but doesn't do justice to the book which is incredible, anyway Angelina Jolie did a good job trying to reacreate the Whole saga of Louis Zamperini's very own odyssey",
      "total_reactions": 1,
      "user": "Xeryus"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "So hard to do justice to a great book, but I thought it was pretty good. Louie Zamperini's abuse in the POW camp was tough to watch, but it was tough to read about, too. (Not to mention, how did he live through it?!) Have to agree w/ critics who wished his postwar life had gotten some screen time -- but that whole other saga could have added another couple of hours to the film.",
      "total_reactions": 0,
      "user": "Lyn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "Unbroken is a film that would’ve worked better as a miniseries. While the film has some great moments that were well done, nicely adapted, and gripping especially in the first third, there are other moments that either glossed over or omitted entirely preventing the film from having the kick it needs. Its frustrating when some parts of the film are executed really well and other times the film is screaming “Notice Me, Nominate Me, Oscars where we come.” Had the filmmakers been more focused on making a good movie for the sake of making a good movie and not going for the gold and/or if the film had been a miniseries it could’ve been great and fleshed out the characters and effectively told the story. As it is, its alright. I didn’t feel like I had completely wasted my time although I do wish I had been able to see American Sniper. In a month where Hollywood tends to give me garbage I’m glad that there was something out there I could see and get something out of. People who haven’t read the book will be able to follow the film ok and might enjoy it more without familiarity with the story. This is a depressing, interesting, and important aspect of World War II and its nice that so many people are being exposed to. If you have read the book though and are a fan of the story, you’ll be disappointed at the alternations and omissions made that prevent the film from being as great as it could’ve been. In all seriousness though if you are curious read the book its really good. As for the movie its ok. It was engaging and wasn’t a waste of my time but I’m probably not going out of my way to see it again and I’m not going to highly recommend it either. Check it out if you are interested but if you’ve read the book, lower your expectations.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "I was telling everyone I know - read the book before you see the movie - as I knew there would be large chunks of the story left untold - if for no other reason that the time limits of average films. I was certain that some of the more subliminal plot points of Louie's story would be left behind - and they were.",
      "total_reactions": 0,
      "user": "Headcrusher"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "The true story of Louis Zamperini is so incredible and humbling it seems churlish to criticise a film telling his life story, but unfortunately Jolie treats the whole thing with way to much respect which produces a very bland film. The performances, photography, sets and music are all exemplary and Jolie has obviously watched a lot of David Lean, but what the subject matter needed was a little more of its lead characters free spirit, and a little less reverence.",
      "total_reactions": 0,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2015
      },
      "score": 6,
      "text": "La historia de Louis Zamperini esta bien redactada, pero la dirección no termina por anclar con el público, la emotividad no debería ser tan forzada, pasable para la primera película dirigida por Angelina Jolie.",
      "total_reactions": 0,
      "user": "chepod8"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2015
      },
      "score": 3,
      "text": "The first part of this tragedy begins by having a first time director, Angelina Jolie, direct this incredible story. This is an epic story and even a highly experienced director would have struggled. She managed to leave off perhaps the most important part of the story - what happened to Louie after the war. Perhaps she ran out of time or money or perhaps she didn't agree with that part.  Most of the scenes were simply way over acted which made intense scenes seem almost comical. Overall, a huge disappointment.",
      "total_reactions": 0,
      "user": "koconnor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2015
      },
      "score": 3,
      "text": "As a fan of uncensored war movies, I went into this one with a positive mindset. That quickly went away after the raft scene. Or scense. That's the problem with this movie is that it acts like it has to little material to work with and lags on for far too long. Yes, we know that they were on the raft and in the camps for a long time. But we don't have to sit with them for every minute they went through to get that across to us.",
      "total_reactions": 0,
      "user": "DirtyDave"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "While Angelina Jolie's well acted Unbroken is a powerful portrayal of war, the movie is incohesive and fails to differentiate itself from other  similar biopic.",
      "total_reactions": 0,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2015
      },
      "score": 6,
      "text": "Director Jolie manages to squeeze some very effective performances from her handsome young cast and the film looks amazing but, unfortunately it tends to drag on quite a bit in the middle even though it does maintain a sense of humor, which is probably due to the writing skills of the Coen brothers. This kind of bleak story requires some humor now and then and the fact that it's based on a true story takes any surprises out of the narrative. It's an intriguing story that has been told before in many war films of the past 50 plus years.",
      "total_reactions": 0,
      "user": "WJS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "A moving and (in the end) very uplifting story; however, for the length of the movie it missed a lot of the book and more good points of the driving message.  Everything about the film was powerful and great, but being adapted from a book with a much bigger story and message I think the film should had included more especially for it's long run time.  Defiantly worth the watch but readers of the book will be left disappointed knowing the film only brushes on the Olympic section then moves full focus to being stranded in the ocean followed by life in a POW camp.",
      "total_reactions": 0,
      "user": "Stevesitz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "I hate when a movie hits you over the head with it's message and tells you how to feel. Unbroken does this with obvious dialogue and overly dramatic music and acting. The dramatic climax came off laughably cheesy. Lots of people will like this movie because it plays to the center of what people like, but it could have been so much more.",
      "total_reactions": 0,
      "user": "kriebelr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "In spite of this film's good cinematography and score, and a compelling true story, it never fully pulled me in.  It's as though you're waiting for some sort of relief that doesn't come until the very, very, very end, and, by that time, your exhausted.  Perhaps this was intentional, but it didn't work for me. Wait for discount theater or home release.",
      "total_reactions": 0,
      "user": "Unclefunnyman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "Like most films adapted from books if you read the book your reaction to the movie will be much different than had you not read it. I myself hadn't read the book and felt mixed about the film. At times it comes off way too cliche and comes off a bit forced, especially towards the beginning. The writing is definitely lacking which is incredibly surprising considering the scribes. As the movie progresses and less dialogue is spoken the film improves immensely and becomes quite enjoyable. It's definitely not one of the best films of 2014 but will leave you feeling encouraged and motivated which seemed to be lacking this year.",
      "total_reactions": 0,
      "user": "ajarias96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2015
      },
      "score": 4,
      "text": "If you watch the movie \"Unbroken\" or read the book, think about the torture of POWs by Japanese in WWII employed similar methods to those used by the US at Guantanamo.",
      "total_reactions": 0,
      "user": "CheneyLikeBird"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "My girlfriend wanted to watch this and so I did so reluctantly and was quite surprised. As Jack O'Connell who I don't particularly like because in most films he plays a young man who gets angry and breaks things actually did a decent job in this role and was enjoyable throughout the film.",
      "total_reactions": 0,
      "user": "boubadiop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2015
      },
      "score": 2,
      "text": "Yikes! I gave it a generous '2'.",
      "total_reactions": 0,
      "user": "ggusta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "If I Can Take It, I Can Make It. True words of wisdom right they.",
      "total_reactions": 0,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "I'm giving it a 6 out of respect for the gentleman the story was written about.  I personally became bored with it half way through.  It has it's moments but not enough of them to satisfy my taste",
      "total_reactions": 0,
      "user": "moviecritic68"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "You will basically know the result/ending of he movie from the title. Yet, Unbroken is still a powerful war-drama movie that touched me for days. The movie was a bit intense for a PG-13 movie.",
      "total_reactions": 0,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2016
      },
      "score": 0,
      "text": "Shocking. This is a terrible film. The story is interesting but I googled it after and obtained a more moving delivery. Boring to the point of ridiculous. Disappointing as it could have been better in the hands of a better film maker.",
      "total_reactions": 0,
      "user": "kpm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2016
      },
      "score": 6,
      "text": "Unbroken shows a real-life story about the wars that destroys our world an how stupid is it. Anyway, despite its some-kind-of defiancent direction and it's simple interpretations, this film's doesn't show nothing new or something that makes worth to watch this unremarkable film with a dull sorry-telling and plot, as well.",
      "total_reactions": 0,
      "user": "Futuredirector"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2016
      },
      "score": 5,
      "text": "Jack O'Connell plays Olympic athlete and American war hero Louis Zamperini in Angelina Jolie's well-mounted but underwhelming WWII drama.",
      "total_reactions": 0,
      "user": "MovieMasterEddy"
    }
  ]
}