{
  "mc_avg_user_score": 7.3,
  "mc_metascore": 44,
  "mc_mixed_rating_frequency": 35,
  "mc_movie_name": "Underworld: Rise of the Lycans",
  "mc_negative_rating_frequency": 13,
  "mc_positive_rating_frequency": 107,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2011
      },
      "score": 4,
      "text": "\"Underworld: Rise of the Lycans\" is the same tedious vampire vs werewolf movie. There's nothing new, but its Michael Sheen's brilliant performance that will keep you entertaining.",
      "total_reactions": 2,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "Definitely the best of the bunch (which may change when I re-watch Evolution) but this was more enjoyable to watch than the first two as it was much more involved. You got to learn a lot more about the history and, as the title says, the Rise of the Lycans who turn on their Vampire owners. Beckinsale is absent but is replaced by the equally as stunning Rhona Mitra, and its also great to see Michael Sheen back playing a more likable Lucian. Overall an enjoyable film and fans will be pleased",
      "total_reactions": 2,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "It's a decent movie and it's nice to know more of the back story to the rest of the Underworld series. I love Rhona Mitra, sexy sexy sexy sexy. Pretty good action in this one.",
      "total_reactions": 1,
      "user": "TheChaser1985"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "Underworld - Rise of the Lycans is a 2009 horror film directed by Patrick Tatopoulos. The film is about the beginning of the feud between vampires and Lycans Lucian came when he decided to rebel against the tyranny of vampires. The film is the prequel to the first two and could also be considered the best in the Underworld saga. With a great cast, dark atmosphere, great fights and good special effects, the film manages to entertain the audience well and never bored.",
      "total_reactions": 1,
      "user": "Mad_Hatter91"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Altough I'm a little late with the review.. After watching U: Awakening, U:RotL seem's like a treat to the eyes. The era in which it takes place, the story behind the entire UW realm makes this 3rd installment one of the best in the series. UW, was great. U:E was so so. U:RotL rises above the others (including U:A). The acting by Bill Nighy is just amazing, to his character. In most scenes.. There was something to focus on. In Viktors (Bill Nighys), I couldn't overt my eyes from his character for nothing. Those gazing stares, that amazing accent and the over-all UMF he puts in every one of his scenes, was simply awesome. Micheal Sheen held the second best character of Lucian. His acting was flawless as well. You could really tell he put his heart into it, as well as Bill Nighy. Both set the stage for an awesome flick for those die-hard fans of the UW saga. And last but not the least, Rhona Mitra as Sonja was great. She held the character well and did her part to make this an epic addition to the UW series. A must watch and definite see on Blu-Ray!",
      "total_reactions": 1,
      "user": "MAXAEMILLION"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "44? You're kidding right?",
      "total_reactions": 1,
      "user": "Loganis"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2011
      },
      "score": 0,
      "text": "I liked the first one. This one...well...it is SO bad that it really doesn't deserve the words to review it. There is absolutely nothing good to say about this movie. Don't they screen these things before finally releasing it ? Somebody, anybody, must have noticed that it sucks on each and every level. Simply appalling !",
      "total_reactions": 3,
      "user": "Nazgulero"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2013
      },
      "score": 7,
      "text": "First off, this is the first Underworld movie I've watched, and for a medieval vampire movie it's pretty epic, and story-line wise pretty interesting. If you're a first-timer to Underworld movies then the ending will leave you confused, but it also leaves you wanting to watch the previous movies to understand it, which in my book is a plus. Watch it",
      "total_reactions": 1,
      "user": "Patrick94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2012
      },
      "score": 7,
      "text": "Underworld: Rise of the Lycans is a very good prequel that delivers a lot of payoff moments for longtime fans. The movie goes deep into the lore and history of the franchise, imbuing itself with an excellent atmosphere of old-world horror-fantasy. With the emotions fixed center stage (it is ultimately a film about star crossed lovers) and some fantastic performances from the series' staple's Michael Sheen & Bill Nighy, Underworld: Rise of the Lycans is a movie that will delight Underworld fans and entertain most other people as well.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2012
      },
      "score": 4,
      "text": "I'm very disappointed at Underworld: Rise of the Lycans. The script is just not looking too good and I was feeling emptied on why Kate Beckinsale didn't return as the sexy vampire hunter, Seline. I thought the series were going to be dead on arrival, but thanks to her comeback in Awakening, I feel like I'm in heaven for more of that wickedly kick-ass moves and killing more vampires. Nothing new for Lycans, however, Martin Sheen's performance look pretty good, I might say. So in conclusion, Rise of the Lycans, rather safe than sorry, but this is one of the worst sequels in the Underworld series.",
      "total_reactions": 0,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2011
      },
      "score": 5,
      "text": "While nowhere near as bad as the 2nd installment of the Underworld series it is still a toothless, soul sucking experience. The change in setting and time period actually help with the return of menacingly good villain Bill Nighy. The loss of Kate Beckinsale can only be seen as a positive (although she does bookend the film) with a prequel story which knows how to have fun. Rise of the Lycans doesn't take itself seriously which is one of the main reasons its enjoyable. However they have gone from one wooden female lead to another with Rhona Mitra's Sonja being just as useless and tiresome as Beckinsale's Selene. While bringing back Michael Sheen and making it an origins story does add a certain gravitas, it fails to wow or at least entertain mainly due to its clearly reduced budget, wooden female lead and depressingly bleak design. Not awful but nowhere near great.",
      "total_reactions": 0,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "I have to admit, during the whole movie I kept whining in my mind why did they have to cast Kate Beckinsale (from the previous two movies in the series) to play the role of Sonja. Only after the movie ended did I realize it wasn't her at all. So, Rhona Mithra and Kate look a lot alike, I guess, which is good for the sake of the plot itself. (Still, it was a bit annoying that in \"Underworld\", the Sonja we saw was blond. Oh well, details...)",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "Certainly the best of the Underworld movies but that's not really saying anything because the previous films were not that good at all. Acting was a little on the poor side, The story is ok but there is no real plot to it. Action is a little below average and not that satisfying either. Overall, It was an ok movie, At least it was watchable, Unlike the other Underworld films.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2012
      },
      "score": 6,
      "text": "Eh, it's really not the same with Kate Beckinsale. I understand the fact that it's a prequel and it's supposed to explain back story, but it just doesn't have the same feeling or level of enjoyment that the first Underworld movie had. The film itself is just okay, I'll give it that. It's not boring and it has some cool moments, but the obvious CGI blood is a bit distracting at times and it lacks the kind of energy that the first 2 Underworld movies had.",
      "total_reactions": 0,
      "user": "Captain_Kirk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "I really don't have many bad things to say about this. The fact that this movie was done by a different director but still turned out on par with the first two, to me, is unheard of in the industry. Well DONE!",
      "total_reactions": 0,
      "user": "sindronian"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2016
      },
      "score": 7,
      "text": "The story of the prequel was interesting and the result wasn't bad, The acting was good, the practical effects were well made and there was enough action and blood to keep viewers entertained.It's still the weakest out of the three.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "This is definitely the best one after the first and second \"Underworld\" films. Simply because on the story and the background are more like for werewolves and vampires. While the first and second films they put both of those legendary races fighting with modern weapons, which made them almost powerless on their own but too much rely on the weapons. I am looking forward on the 4th and 5th one.",
      "total_reactions": 0,
      "user": "Risger"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "Underworld: Rise of the Lycans is a great prequel that abandons the modern day setting of the previous movies and instead goes to a medieval style setting for some epic vampire vs werewolf battles",
      "total_reactions": 0,
      "user": "Kraven"
    }
  ]
}