{
  "mc_avg_user_score": 4.1,
  "mc_metascore": 32,
  "mc_mixed_rating_frequency": 16,
  "mc_movie_name": "Unfinished Business",
  "mc_negative_rating_frequency": 24,
  "mc_positive_rating_frequency": 12,
  "mc_pro_critic_reviews": [
    {
      "critic": "Brad Wheeler",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 63,
      "summary": "Not without charm, Unfinished Business mixes the cute with the raunchy. Penises adorably happen. But besides the schlongenfreude, there’s a subtext about how-did-I-get-here lives, and righting oneself before it’s too late. Is the star himself listening?"
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 63,
      "summary": "While by no means a masterpiece, the comedy, by Canadian director Ken Scott, is a careful calibration of crass gags and genuine sentiment that succeeds more often than it fails."
    },
    {
      "critic": "Dana Rose Falcone",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "The movie struggles to find its comedic footing by trying to bring out the family man in Dan Trunkman and underutilizing Franco, whose character clearly has much more to his disadvantage than a lack of prior business experience. Bottom line: Unfinished Business doesn’t deserve that handshake after all."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "This is just a slightly better than mediocre film with a disconcerting grasp of the truth."
    },
    {
      "critic": "Brian Truitt",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 50,
      "summary": "A bland road-trip film that falls flat while heaping on the raunchiness."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 45,
      "summary": "Unfinished Business isn’t a laugh-free experience — Nick Frost steals every scene as a business underling with a kinky side — and some of the comic set pieces actually work."
    },
    {
      "critic": "Jesse Hassenger",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 42,
      "summary": "A once-energetic comic talent (and underrated serious actor) slows down to a pace he must feel matches his audience these days."
    },
    {
      "critic": "Andy Webster",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "A “EuroTrip” with balance sheets, the slick, innocuous comedy Unfinished Business fails to seal the deal."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "Unfinished Business is a jumble of half-baked ideas, none particularly interesting."
    },
    {
      "critic": "John Hazelton",
      "publication": "Screen International",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "The supporting cast takes some of the comic weight off the always likeable Vaughn’s shoulders. But Wilkinson’s character is too sad-sack to be really funny and Franco’s verges on the mawkish."
    },
    {
      "critic": "Dave Calhoun",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "This limp, sometimes lifeless business-trip comedy can’t decide whether to aim for teenage boys or their fathers. So it plumps for – and misses – both."
    },
    {
      "critic": "Sheila O'Malley",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 38,
      "summary": "The characters are not people, but rough drafts of simplistic character-traits, and the actors (game as they all are) cannot create something out of nothing."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 38,
      "summary": "Is it a hard-R road trip comedy that makes no apologies for politically incorrect humor — or a sweet family film with a message about tolerance and acceptance? It’s both, I suppose. And neither element is particularly convincing or particularly funny."
    },
    {
      "critic": "Eric Henderson",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 38,
      "summary": "The whole point of Vince Vaughn's cinematic existence is that he's a paragon for reformed chauvinism. He's an irrepressible but highly tamable id. Not so here."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 38,
      "summary": "Almost all mainstream movies steal from other movies, but the better ones get away with it because they possess some distinctive identity. The best that Ken Scott’s Unfinished Business can come up with is Vince Vaughn — as the straight man."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 38,
      "summary": "Unfinished Business, the second film Vaughn has done with the deliberately paced Canadian Ken Scott (“Delivery Man”) groans under the weight of expected laughs, expectations that are rarely met."
    },
    {
      "critic": "William Goss",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 30,
      "summary": "The result is about as memorable as an evening spent shitfaced at your local Applebee’s."
    },
    {
      "critic": "Gary Goldstein",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 30,
      "summary": "A sluggishly paced collection of go-nowhere sight gags, flat-footed set pieces and incoherent business chatter that offers few laughs and little real payoff."
    },
    {
      "critic": "Jon Frosch",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 30,
      "summary": "Unfinished Business is the cinematic equivalent of sub-par fast food (think Carl’s Jr. or Jack in the Box); it’s cheap, easy and maybe even tasty for a second or two, but leaves you feeling queasy and undernourished."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2015
      },
      "score": 30,
      "summary": "A comedy with its heart in the right place and everything else bizarrely out of joint."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2015
      },
      "score": 25,
      "summary": "Unfinished Business is bad - not epically bad but bad enough. Little contained in this misfire of a film works and the few successful things are dragged out to the point where they die a lingering death."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 25,
      "summary": "Mostly Unfinished Business is a tale of unfinished jokes."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 20,
      "summary": "Unfinished Business squanders almost every opportunity provided by its potentially funny premise. Instead, it becomes yet another blotch on star Vince Vaughn’s résumé."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 20,
      "summary": "Mawkishness, gay panic, and lazy jokes make Vince Vaughn's workplace comedy considerably less fun than work itself."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 20,
      "summary": "Unfinished Business aspires to high-spirited antics, but it feels defeated and exhausted from the very start."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "summary": "Unfinished Business is the type of movie that is so awful that as it rolls along (its 91-minute runtime feels agonizing) you get more and more restless."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "Unfinished Buisness is the top contender for the most forgettable comedy ever made, and I mean forgettable as hell. Vince Vaughn plays a beat up buisnessman, who teams up with Mike Pancake, played by Dave Franco and Tom Wilkinson to go to the annual business summit, and meet up with clients to sign their deals. But, a massive sex fetish event blockades their plans, as we see hazy party scenes and a lot of silly drug use. Director Ken Scott, makes his movie to be unfunny, even in the sex fetish event. There are great actors murdered here, Nick Frost, Sienna Miller, Tom Wilkinson and even our own, Vince Vaughn. There is not even a hint of funny, in this gross and poorly made comedy. This one doesn't deserve your 10 dollars at the box office, or a rent at Redbox, or your time being wasted watching it on Netflix. Unfinished Buisness gets a perfectly deserving 0 out of 10.",
      "total_reactions": 4,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Great premise that could have worked. I was more looking at the plot as to what it takes to succeed when working with people who take advantage of their upper hand. So the laughs were a welcome relief to what goes on in the business world.",
      "total_reactions": 4,
      "user": "ledaumas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "It's an amusing movie, and Vince Vaughn really makes it funny.  As does Bro Franco.  Lot more dicks and breasts than I expected, but also a lot more belly laughs. if you go in with modest expectations, you'll have a great time. Tom Wilkinson brings a dash of credibility to the proceedings. And Sienna Miller is also terrific in a small role.  It's just not all that ambitious of a movie.  But a good time.",
      "total_reactions": 0,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2015
      },
      "score": 6,
      "text": "It's got issues that keep it from being one of the best comedies out there. Yet there are enough belly laughs to make it a pretty entertaining movie. Some crazy scenarios along with some very funny one liners help keep things mostly enjoyable. Especially with the goofy Dave Franco. His character might be a little too stupid at times, but he still manages to bring some laughs with his cluelessness.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2015
      },
      "score": 2,
      "text": "This film is such a pointless mess.  There is very little that works the comedy falls flat, the characters are dopey, and the story just doesn't matter.  The film tries to pull the heart strings on the issue of bullying unfortunately the rest of the film makes you just not care.  D",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 3,
      "text": "Dave Franco is a terrible in this movie he is annoying and dumb, Tom Wilkinson tries and Vince Vaughn is just \"Vince Vaughn,\" how could a comedy be this boring? It has a few laughs time to time but that's all it's gonna get. It has lazy party scenes and it's not fun, we can't root for the characters (cause we don't care). Vaughn's one liner's are cheap and unfunny. Grade D+",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2015
      },
      "score": 4,
      "text": "UnFinished Business is partially Entertaining, partially Funny and partially works. However, the excessive amounts of nudity and the excessive amounts of unrealism just puts you out of the whole Goddamn thing!",
      "total_reactions": 0,
      "user": "HaithamB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "I think this movie has got a lot of unnecessary hate. I know that business movies aren't always the most entertaining in the world. There are points were the movie is a little boring but for the most part I found the characters pretty funny. A lot of people have been ripping on Dave Franco's performance in this movie but really I thought it was different. Tom Wilkinson was fairly funny as well and really I'd say that both of these guys are funnier than Vince Vaughn who is one of my favorites but I wasn't really happy with him comedy wise in the movie. I'm a little bit worried about True Detective season 2 after watching this movie hopefully he'll be able to pull off a good performance in that.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2015
      },
      "score": 6,
      "text": "It has it's moments but the movie doesn't really give laugh out lout type funny. It was just okay. Dave Franco did a good job along with Vince Vaughn. It's the type of movie that you can watch once and forget it. If you want silly humor than watch it. Definitely worth a wait on Redbox or Netlix.",
      "total_reactions": 0,
      "user": "DavidV293"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2015
      },
      "score": 3,
      "text": "The reason why this review is late because at the first I had zone interest in this movie and what change my mind at the end is the people telling me to watch.",
      "total_reactions": 0,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2015
      },
      "score": 2,
      "text": "Negocios con Resaca nos cuenta como el  propietario de una pequeña empresa de ventas recién creada (Vince Vaughn) y sus dos socios (Tom Wilkinson y Dave Franco) viajan a Europa para cerrar el acuerdo mientras deben superar los obstáculos que les interponen.",
      "total_reactions": 0,
      "user": "Barbudez"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2015
      },
      "score": 3,
      "text": "Gratuitous and unfunny. Unfinished Business is intermittently amusing out of sheer ludicrousness, but it never becomes laugh-out-loud funny due to its horrifically uneven script. Waste of a good cast.",
      "total_reactions": 0,
      "user": "SolInvicta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2015
      },
      "score": 5,
      "text": "It was a fun movie, even though nothing that interesting happened and you will most probably forget about it after few weeks that you even saw it. There are many funny moments though, but what I didn't like was that some of the characters were just quite bland in my opinion, and Vince Vaugh himself, maybe better than in other movies I have seen with him, still wasn't that funny.  You shouldn't expect much from it, but it is still a fun watch and if you are bored it's not your worst option to see",
      "total_reactions": 0,
      "user": "Ralfbergs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2016
      },
      "score": 4,
      "text": "Unfinished Business squanders a good cast with a confused tone, inane plot, and poor attempts at humor. Dave Franco has a couple of funny scenes, but not enough to make the movie recommendable.",
      "total_reactions": 0,
      "user": "johnem95"
    }
  ]
}