{
  "mc_avg_user_score": 5.6,
  "mc_metascore": 59,
  "mc_mixed_rating_frequency": 64,
  "mc_movie_name": "Unfriended",
  "mc_negative_rating_frequency": 56,
  "mc_positive_rating_frequency": 95,
  "mc_pro_critic_reviews": [
    {
      "critic": "Calum Marsh",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2015
      },
      "score": 88,
      "summary": "When the genre-film spectacle arrives, it's in full force, and the strictures of the framing device manage to amplify, rather than suppress, the impact of the shocks and scares."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 83,
      "summary": "The filmmakers here completely commit to their gimmick, turning its limitations into benefits and exploiting the chosen technology for maximum effect. In the process, they hit the refresh button on the entire found-footage format."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2015
      },
      "score": 80,
      "summary": "Director Levan Gabriadze is adept at the sinking something's not right creepiness too few horror films dig into. His techniques are certain to be copy-pasted by imitators."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2015
      },
      "score": 76,
      "summary": "Unfriended commits to its idea and continually finds new ways to creatively exploit it, building the tension as each character reveals his or her own dark deeds, thus justifying the brutal vendettas visited upon them."
    },
    {
      "critic": "Brad Wheeler",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 75,
      "summary": "Perhaps Gabriadze has created a new genre here, but do we want to sit all day in front of an office computer and then go out and spend dollars to watch a small screen on a bigger screen for entertainment?"
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 75,
      "summary": "Blowing this small-screen cyber horror tale out to the big screen makes for fresh and fearsome fun."
    },
    {
      "critic": "Clark Collis",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 75,
      "summary": "Though not particularly ground-breaking — last year’s Elijah Wood-starring Open Windows pulled the same trick, and much more ambitiously — we’re still going to “like” the result."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 75,
      "summary": "What kind of a movie takes place entirely on one screwed-up teen's computer screen? That would be Unfriended, a creep-you-out experiment in terror that damn near pulls off every trick up its cyber sleeve."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 70,
      "summary": "Unfriended really does use everything teens cherish about their technology lifestyle against them. It’s a mean, potent little movie."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 70,
      "summary": "No, it’s therefore a movie to be seen, if you can endure it — as a shrewd commercial venture, as an online opus that undoes your self-composure and, last and foremost, as a window on a mode of thinking that equates to a state of being."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2015
      },
      "score": 67,
      "summary": "It's obvious that they're aiming for something more fun than genuinely haunting, and it helps that there is a good deal of humor used to punctuate the horror. It doesn't all land, but there's a fair amount of wit in something as simple as watching what someone types, deletes, then retypes."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 63,
      "summary": "If nothing else, Unfriended does an excellent job portraying the frenzy that is on-line teen interaction. This is the new equivalent of \"hanging out.\""
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 63,
      "summary": "More funny than scary."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 63,
      "summary": "All we’re really in the end is the gimmick and an appreciation for how cleverly it comes off. And a reminder to not “answer messages from the dead.”"
    },
    {
      "critic": "William Goss",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2015
      },
      "score": 60,
      "summary": "Clever cybernatural thriller."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 60,
      "summary": "Even though Unfriended begins to cheat, springing loud noises and gory cutaways that can’t be explained, there’s a rigor to its dopey, blood-simple conception that you might smile at."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 60,
      "summary": "It's interesting to wonder how the film will age, given the short shelf life of technology. In two years all this might seem as dated as a dial-up modem, technology not nearly advanced enough to support the action here. But for now Unfriended lives in the moment, as do its characters."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 60,
      "summary": "As a harangue about cyberbullying, it's purely exploitative, but when Unfriended zeros in on the whiplash mixture of freedom and torment we get from multitasking our online lives? It's srsly fun, imo."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 60,
      "summary": "It reminds you that today’s horror movies still owe a great debt to Val Lewton, the producer of cheapie classics like “Cat People” (1942) and a virtuoso of shadows who realized that audiences could be entertained if the characters they watched looked like them. “Unfriended” doesn’t have Lewton’s poetry. Yet the filmmakers understand that one way into an audience’s head and nervous system is to fill the screen with the kind of “insipidly normal characters” (as the critic Manny Farber described Lewton’s) you’re happy to see shiver and scream."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 60,
      "summary": "For everything here that’s new and exciting, there’s much that’s way too familiar. The kids are so one-dimensional and unpleasant, it’s hard to care once they start dying off.... Unfriended is often more innovative than scary, too, with some memorable but not particularly chilling and hilariously foreshadowed death scenes."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2015
      },
      "score": 60,
      "summary": "Simultaneously clever and exasperating, the film puts a novel spin on the genre Roger Ebert dubbed “the Dead Teenager Movie.”"
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 50,
      "summary": "A horror pic with a new gimmick that likely will spawn an entire subgenre of more substandard rubbish."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 50,
      "summary": "The acting is actually pretty solid. These characters are never in the same room, so the performances amount to a collection of solo scenes. But these kids aren’t likable. Perhaps director Gabriadze and writer Nelson Greaves intended to create a Social Media “Scream” and a commentary on cyber-bullying, but Unfriended comes across as disdainful of millennials."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2015
      },
      "score": 50,
      "summary": "Unfriended is sometimes a blast to watch and is occasionally funny and unnerving, but by its conclusion it becomes screechy and overwrought."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2015
      },
      "score": 40,
      "summary": "Unfriended provides a modicum of chills and more gore than you’d expect."
    },
    {
      "critic": "Jacob Hall",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 40,
      "summary": "Unfortunately, the engine underneath that gloss is woefully familiar, offering the same jump scares we’ve seen a thousand times before."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 37,
      "summary": "At times, Unfriended really clicks — but ultimately, it’s a drag."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 4,
        "year": 2015
      },
      "score": 30,
      "summary": "In the end one would rather be back at one's own computer, tending to the tedious details of digital life, than watching this clique get pinged to death."
    },
    {
      "critic": "Mark Dujsik",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 25,
      "summary": "The movie might just make people associate bullying with a hollow, tedious endeavor that lacks any satisfaction."
    },
    {
      "critic": "Michael Ordona",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 25,
      "summary": "There’s no one to root for, not even the dead girl. Nothing seems important enough."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2015
      },
      "score": 6,
      "text": "\"Unfriended\", like \"Paranormal Activity\", explores and discovers a whole different method of bringing refreshing scares to the audience, which, despite the shallow plot, is pretty enjoyable to watch.",
      "total_reactions": 2,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2016
      },
      "score": 6,
      "text": "Who: Shelley Hennig, and a whole bunch of mediocre actors who are probably in tons of MTV shows",
      "total_reactions": 1,
      "user": "RvwFromUpHere"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "---MAJOR SPOILERS ALERT!!!----",
      "total_reactions": 7,
      "user": "Snoww"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2015
      },
      "score": 0,
      "text": "from start till the end you're watching bunch of teenagers chat use facebook, youtube so on and FOR GOD SAKE messaging, If i wanna watch people typing on the computer I will sit at my own home and surf the internet myself, DO NOT BOTHER WASTING YOUR MONEY TO THE CINEMA, I feel like punching everyone and everything since I left the cinema, never in my life I watched such movie, wait what did I just say \"movie\"? no omg I dont even know how to describe this terrible ****",
      "total_reactions": 4,
      "user": "hunkybaby"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2015
      },
      "score": 0,
      "text": "This was an awful movie. I left the theater 45 minutes into the movie. The movie was literally 45 minutes of talking and then 10 seconds of a death scene, and the dialogue was not interesting. Any buffoon with a computer could have made this movie for free, and likely even better than what it was. I had such high hopes for this movie, as it seemed like it could be cinematically intriguing, but it wore off, and the rest was just god awful. I would have demanded a refund had I left 15 minutes earlier, and I should have. Good luck if you go to see this because it is the worst movie that I have ever seen. I repeat, this is the worst movie that I have ever seen.",
      "total_reactions": 4,
      "user": "bigtunaonfilm"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2015
      },
      "score": 2,
      "text": "With the idea of moving a horror film into social media and the internet, it gives you an opportunity to watch a film in a more realistic way. In fact, you can give it an even more realistic feeling in the comfort of your own home!",
      "total_reactions": 6,
      "user": "SuperWooper"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2015
      },
      "score": 2,
      "text": "I really can't say I blame the naysayer reviews for this movie.  There is a long list of movie elements missing from this, and caused me a great deal of disappointment.  Literally, there's 6 or 7 main characters.  Anyone with a PalTalk, YouTube, Skype, Facebook, and understanding of QuickTime could have made this movie.  There's zero talent there.  The plot of the movie leaves a lot of predictability for the end outcome, right from the first few minutes!  Probably worse than anything else is that I was hoping this might actually be a believable thriller about social media and internet technology that might teach a few people a good lesson.  On this front, it failed miserably.  This is total fiction.  Unless you believe that ghosts are computer-savvy, or that people using social media could be talented enough to form a collective group of 6 individuals networking to coincidentally knock off 6 people that had something to do with the death of a teenager on the date of her anniversary, this is a waste of time.  Sadly, the characters in this movie were compelled not to shut down their browsers and simply meet in person?  Holes, holes, holes.  Not only was I not scared in the least by this \"video\", I wasn't entertained, enlightened, fascinated or even marginally impressed.  I couldn't wait for it to be over.",
      "total_reactions": 6,
      "user": "areality40"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "If you're looking for a good time for your weekend than. Try Unfriended. It's not the perfect horror but it's actually a pretty good idea. Every scene you expected something to make you sweaty and it actually did it. The reason why I give this movie a (5) is because of the cheesiness. Like for some reason I found Unfriended quite funny. But it is a good time and you sure will have fun.",
      "total_reactions": 3,
      "user": "DavidV293"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2015
      },
      "score": 0,
      "text": "1 83 minute group Skype call where teens are scared enough of a troll that enters the chat to call 911 but apparently are incapable of leaving their bedrooms for any reasons whatsoever and apparently none of these teens have any family living in their homes as no mentions of brothers, sisters or parents, just 6 kids sitting on their asses in their own bedrooms on a Skype call , not once does the camera leave the computer screen of this chat , at some point someone's screen glitches and freezes up and well assume they are dead , I hardly consider this a Slasher film as far as these death scenes go or should I say images of a death scene since every death scene glitches up and freezes. It was fun for a bit watching the teen drama unfold as they dish out each others dirty laundry but the cattiness gets annoying quick enough. IMO it's more for reality TV Junkies that like their cattiness and verbal fights where everyone is calling everyone %$#@ or %#$@^and using the the f word",
      "total_reactions": 3,
      "user": "Milkshake2424"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2015
      },
      "score": 0,
      "text": "This movie did not cost more then 500.00 bucks to make and could have been made in a day. Heck I'm thinking of making my own movie and spend 600.00 and two days to make it. Im a horror freak and this is and never will be a horror movie. Anyone that said this is scary is probability afraid of a dead ant on there computer monitor. Do not waste you money on this movie. They should be arrested for putting this movie out .",
      "total_reactions": 5,
      "user": "bigfoot6463"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "Wow! This movie is absolutely incredible! It was fun and fascinating. The whole movie is done in real time. The characters are intriguing and the suspense builds from beginning to end. This movie has its flaws, therefore it's not a 9 or a 10 but for what it is, it does well. It's obviously an anti-bulling message. The whole movie is basically sharing the screen with the protagonist. You see her messages, ims, skypes, etc. That was a very neat concept and I praise that aspect infinitely. However, the cliches are also very obvious and the killer talks in the way that a mother would text, which kinda took away from the zing. However, the story was neat and the acting was awesome! There is also a lot of comedy thrown into the mix. It's a little bit of everything. You'll laugh your butt off and you'll also feel the dread building. Personally I'll say this is a very innovative horror movie and could've totally been a 10 but fell into too many cliches. See it if you're interested; I'm sure you'll enjoy. But it kinda sucks to know how great of a movie this could've been had it not done some of the things it did. The ending is absolutely incredible; it is one of the greatest endings to a horror movie I've seen in a while.",
      "total_reactions": 12,
      "user": "BrushedRed"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "Unfriended nails it. It's been a great season for horror fans with It Follows and now Unfriended in the lineup. (Though I'm not looking forward to much of the rest of the samey, occulty crap the industry has in the pipeline.  Vatican Papers?  Ugh.)  It fallows is more classic, retro horror, but Unfriended is horror for the new tech-savvy generation. It's a bit of a fable, really. I love the use of technology and the rules that define the action. In the same way that Blair Witch introduced the found footage element to horror, Unfriended does the Skype/YouTube thing perfectly.  Shelley Henning as Blair holds down the sympathetic lead role extremely effectively.  She's always been an underrated actress who has played the supporting role in such teen fare as Teen Wolf, Secret Circle, and Zach Stone is Gonna Be Famous, and I'm hoping that her exposure in this movie puts her into that category of actor who is considered for leads. Speaking of acting, all of the young actors in Unfriended bring a level of authenticity to the proceedings - they simply feel real. The film's only drawback - and this is something that bugs me about many horror flicks such as the Paranormals - is the excessive reliance on demons or spirits of the dead. It's almost a cop out - how does a spirit use Skype?  Oh well, don't worry about it, it's a leap!  I suppose I'm yearning for a bit more tangible reality in my horror such as the raw, depraved humanity of Rutger Hauer in The Hitcher.  But that's just nitpicking, I suppose.  If your'e looking for intensity and a horror flick with a moral message to it (\"don't bully!\"), this one will work for you.",
      "total_reactions": 9,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 1,
      "text": "iSwear iHated iMac Unfriended - one hour and twenty insufferable interactive minutes online with a bunch of kids in their terrible teens . A disconnect between a good message - anti cyber bullying - and a bad horror flick. A Blair Witch upgrade with not a scare on the big screen on the small screen - not a care of what comes next- and a googled explanation to boot. I kept wishing for a North Korean hacker to make it go away. Likes: 0.",
      "total_reactions": 9,
      "user": "hotfromcauldron"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "Unfriended is different and deserves credit for that.",
      "total_reactions": 4,
      "user": "busbfran"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2015
      },
      "score": 0,
      "text": "Don't waste your time. It's not scary. Don't think: *Maybe fun to watch because it's a bad movie and could therefore be entertaining.* Well if you just happen to have a heavily security-guarded cinema filled with people raging about the stupidity of this film be welcome to somehow enjoy part of the movie but by no means think you won't feel disappointed in the end.",
      "total_reactions": 4,
      "user": "Asumon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "This is the latest variation on revenge thrillers: 6 high school friends are chatting online, when a former classmate (who recently killed herself) joins their conversation to seek payback. What makes this concept so unique is the point of view: one girl's computer screen. All the action takes place via Skype, YouTube, Facebook, Google, other popular internet-based apps, even Spotify for the soundtrack. That's interesting, but then you have to put up with the teens who constantly over-dramatize, freak out and scream a lot. The murder moments are just that, quick brutal forced suicides…even too short for today's abbreviated attention spans. It's pretty much a clever one-note notion without any surprises or suspense.",
      "total_reactions": 2,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "Being a huge sucker for found-footage movies, of course I was gonna check this one out, given its unique concept of the whole thing taking place on a laptop screen. And while I wouldn't call it scary by any means, it definitely was unique just like I'd hoped. I really enjoyed some of the creative things they came up with in the film during the Skype chats. Too bad the whole point of the film was for it to be scary though, which, like I said, it wasn't really. But overall, it was just a dumb but somewhat fun film to kill an hour and a half, and also the film's unique concept and some of the clever things and ideas that were in it saved it from being as disappointing as the last horror film I saw (the highly overrated It Follows.) Personally, I'd go see this film again over that any day.",
      "total_reactions": 2,
      "user": "moviemitch96"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "Unfriended is so far the best comedy of the year, I mean how can anyone watch this movie and take it seriously. It's just a bunch of stupid white teenage's that are to stupid to leave they Skype chat when some one is trying to hack them, you know turn off your computer or quickly report them, that's what most people do.",
      "total_reactions": 2,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "Silly movie, but it has a message.  Things you do on the internet stay there forever. Acting is pretty crummy and pretty predictable.  Don't expect much from this except a message.",
      "total_reactions": 2,
      "user": "merashjr"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 4,
      "text": "Most of Unfriended is uninteresting and sappy. But the few ideas it chucks at it do click. The story plays out like MTV's Catfish meets a really bad horror movie. The first half of the movie is not horror, it's young brats' Facebook and Twitters being shown, family photos, scam websites, so basically it's a teaching of the Internet plus a stupid teen love story you know you are gonna hate. The other 80 minutes is where the sh*t hits the fan, and it is... Pretty fun. Really, the jump scares and high octane thrills are well timed and just there and provide us with a better side of this already bad movie. It is a pretty good idea though, a psychopathic killer hunts down the people who shot an embarrassing video of her and she committed suicide, turns out is she alive? The thrill is nice but it could have been placed in a better movie than what we have here. I could have recommended it just for the thrills, but I review on the whole movie, and it isn't good. Unfriended is an awesome idea gone rotten.",
      "total_reactions": 5,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "I actually really liked this movie, they really did something most 'horror movies' didn't do and that was make me laugh. they added so many parts that were funny and that most teenagers can relate with, honestly the only problem i had was how fast this movie was! it was like 82 minutes, and to confirm anyones guess, yes it is 100 percent a pure skype call the whole time, not once do are we actually in any of the people's bedrooms with them, actually another problem would be that there really isn't any character development at all, other than that the ending is amazing and it's also kinda sad, i recommend this movie but don't go in taking it too seriously, just sit back relax and enjoy 82 minutes of this film.",
      "total_reactions": 5,
      "user": "metalupyourass"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2015
      },
      "score": 1,
      "text": "This movie sucked and I hated it!!  The characters were terrible.  The plot is contrived and boring.  So poorly shot, so poorly directed and so poorly written and it didn’t have to be any of those.  This film has been billed as the next ‘Blair Witch’ or ‘Paranormal Activity’ but those films didn’t aim to be phenomenon’s they were more accidental and based on word of mouth.  This film is clearly trying too hard and I think it will be forgotten when the new ‘Paranormal Activity’ movie comes out later this year.",
      "total_reactions": 5,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "It's almost jarring to see SEGA finally deliver on their generation-old promises that SEGA \"does what Nintendon't.\" They have finally re-purposed Sonic as a platforming mascot that is, for the first time in ages, wildly definable by its own merits instead of trying to play catch up, tagalong or sorority sister with its mustachio partner in crime. Instead, Sonic Generations decides to ditch the plight of spending decades chasing Mario's happy go lucky hop and bop, vacational romps through paradise in favor of a vigorously fast and unforgiving speed drive through dystopia that honors expertise over bubbly luck.",
      "total_reactions": 9,
      "user": "BillClinton"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "Ill keep this short, this movie is having an out of body experience whilst masturbating to MIlf porn. The story was genuinely creepy, and innovative! Ive never seen a horror film take a spin on internet horror as this film does. The entire thing is presented via a desktop setting, which sounds crap but amazingly, works. Apart from the obvious jump scare crap and rather horrendous ending, this movie is definitely worth seeing once. The second i went home i was fapping away (Quite vigorously) when a pop up almost scared the **** out of me. It will be a while before i recover. Anyway, go see this movie. Its not crap!",
      "total_reactions": 7,
      "user": "Unladenswallow0"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "It Follows may have been classier, but Unfriended is by far one of the scariest and most intense movies since Paranormal Activity. The film relies on so much effective tension and well-timed jump scares that the entire movie is intense and often disturbing throughout its 82 minute running time. Buffering and slow download speeds have never been more terrifying. Unfriended is so realistic that you feel like you're in the conversation the entire movie. Whenever the characters are yelling and arguing with each other, you feel uncomfortable as if you're caught in the middle of it, and a sadistic game of Never Have I Ever will make you never want to play the party game again. The actors talk to each other exactly how teenagers would in real life, and the fears of your biggest secrets being irreversibly exposed online are all too real in this movie. There were a lot of scenes in this where I was deeply uncomfortable because of those real-world fears. You might miss some of the more disturbing aspects of the film if you're not from this technology-obsessed generation, but Unfriended is an extremely scary and disturbing film that you won't want to press ctrl-alt-del on.",
      "total_reactions": 19,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "Unfriended is a very gripping movie it knows how to create tension and atmosphere, Unfriended is easily one of the best horror movies of the last few years",
      "total_reactions": 4,
      "user": "TheDude-"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2015
      },
      "score": 6,
      "text": "Better in theory than execution. It's pretty creepy for a while, but becomes ridiculous and somewhat grating. The actors do what they can in the scenes of high intensity, though they're best early on playing regular teenagers wondering who the creeper is on the other end of the Skype call. In the end, it has something to say about cyber bullying and that's enough.",
      "total_reactions": 1,
      "user": "j1train"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "Honestly the best horror movie I've seen in decades. The characters",
      "total_reactions": 3,
      "user": "Lansdenrs"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "Cool movie with great premise. At 1. hr. 23 min., the movie is still a bit too long. It isn't as scary as people say it is and there weren't any real jump scares. Some character developments were really weak, but overall it was watchable.",
      "total_reactions": 1,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2015
      },
      "score": 0,
      "text": "Sorry but thats really really bad, i dont know why i go to see this movie...",
      "total_reactions": 3,
      "user": "MrDavidorro"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2015
      },
      "score": 2,
      "text": "I could pretty much get unfriended after this review, but Unfriended is just another way to basically 'unfriend' the audience the bad and disappointing way.",
      "total_reactions": 2,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2016
      },
      "score": 1,
      "text": "I think desktop films are a very interesting storytelling technique for the 21st Century however this was not a good one. The first act sets up an interesting premise that quickly dissolves into an uninteresting horror movie. What a waste. The characters are all annoying and the only real good part of the movie is hoping they all die painful deaths. There is way too much showing found on in the desktop. Most people use at least a few keyboard shortcuts from time to time which would also help the place of the film. We know you are copy and pasting something we don't need to see you click the buttons that say that.",
      "total_reactions": 1,
      "user": "AquaMorph"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2016
      },
      "score": 3,
      "text": "This film acts like a vengeance to bullying and bad use of the social networks, beaching an educative film on a horro movie, that doesn't scare at all. It also uses nudity for win viewers, but there's not much difference.",
      "total_reactions": 1,
      "user": "Futuredirector"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2015
      },
      "score": 7,
      "text": "Clever ideas and new twists make for a surprisingly original mainstream horror movie. The all too familiar jump scares and cheap theatrics the usual generic, teenage date night, cash-grab horror flicks use aren't found here. What we get here is a creative revenge story with some cool ideas that manages to be enjoyable even if it doesn't quite nail the horror aspect.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2015
      },
      "score": 4,
      "text": "The story of five teens being terrorised by an unseen force on social media is a good concept, and for the first half hour works fairly well, but the novelty of watching a whole film via laptop screens soon wears thin. Plot holes abound and the general stupidity of the kids soon starts to grate. Kudos to the filmmakers for trying to do something new with the found footage film, but the problems that exist within that genre just seem to be magnified here",
      "total_reactions": 0,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2015
      },
      "score": 5,
      "text": "Unfriended is a completely new concept in the genre, and it does well for what it is, however I'd argue that some parts feel a bit too empty and characters are generally undeveloped.",
      "total_reactions": 0,
      "user": "dakydaky"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "Unfriended is Paranormal Activity meets MTV's Catfish over a group Skype call.",
      "total_reactions": 0,
      "user": "sandeep"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2016
      },
      "score": 7,
      "text": "In this viral going social media era, our actions must be very cautious!",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2015
      },
      "score": 5,
      "text": "Give credit where credit is do the concept works for the most part.  I wasn't expecting much and I got a film that at least kept me interested in a game of Never have I ever. C+",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2015
      },
      "score": 7,
      "text": "Although Unfriended isn't very scary (it sells itself as a thriller/horror movie), it manages to be innovative. It is done in real time on a Mac computer screen, and we only see the narrator (Blaire's) point of view the whole film. This same technique was done on an episode of Modern Family, so maybe the creators of this \"movie-in-a-computer\" setting are on to something.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2016
      },
      "score": 4,
      "text": "Unfriended doesn't entirely capitalize on its #cool premise through its lack of scares, but still delivers a reasonably fun horror movie that its specific target audience will enjoy.",
      "total_reactions": 0,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2016
      },
      "score": 5,
      "text": "Yep, this is the \"Skype horror movie\".",
      "total_reactions": 0,
      "user": "cjm868"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "Wow the film is a total rip off! I think the trailer should have been this movie and it would have been better. There's no character development and the film has less storytelling  odd for a horror flick? The dialogue is crap and the character's are your typical cliche'd horror characters. The cybernatural thriller is clever more jump scares and more gores less character development. The characters should have more originality,In this film we have **** whining teenage girls, a stoner who's the funny one (haven't we have  seen this before?). The script written by Nelson Greaves takes a scary idea that teenagers are having trouble with \"this issue\" online and make it into a cheesy clever not original film. The directing by Levan Gabriadze uses some realistic sound effects and weak jump scares some are scary. Grade B-",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "When it was first announced I had big expectations. I thought horror was brough to a new level, and so I tought for the first 5 mins of the movie. But then I realized Unfriended is a slopy try, a wannabe new type of horror. Where it succedes is the concept. Where it totally lacks is the truehorror, jump scares and an appealing story. The acting is blended, except Sheley Hennig, which made it easier to swallow. I like it for what it tried to delivers, but to the point where it give us any good horror movie would is a long way. It's a movie you watched, perhaps enjoyed but in time you forget about it.",
      "total_reactions": 0,
      "user": "Skitte"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2015
      },
      "score": 6,
      "text": "Always loved commentaries about cyberbullying. This one is a special of a kind... but also a disappointing one. Now, the movie was immensely entertaining and creepy, with effective scary deaths and believable performances. However, I did hate the ending. So, they're all dead? That's kind of clichéd. I just wish that the ending could have been more thought out. Overall, pretty entertaining movie with a clever premise but a poor ending.",
      "total_reactions": 0,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "Unfriended is directed by Levan Gabriadze and stars Heather Sossaman, Moses Storm and Renee Olstead. The film revolves around six friends who socialize in an online chat room together and mysterious things begin to occur when an account belonging to a dead girl joins their chat. This film debuted at the Fantasia Festival last year and got a wide release this spring. I like the premise of Unfriended, the internet can be a scary thing and many people really never think about how dangerous it can really be. The whole film takes part on the computer screen of Blaire Lilly (Sossaman) so if Blaire searches something on Google or checks her Facebook we get to see it all and that’s an interesting way to shoot a film, but the film quickly starts to take on the characteristics of other horror movies with all these weird events occurring without any real reason. I thought the young cast did very well to start the film but I think you could begin to see cracks as the film went on. I like the way that tension builds up throughout the movie and it helped to keep me interested. The story got a little too crazy and when the tension builds up more and more the acting weakens. You will find out that everyone in this chat room is a terrible person and they are so awful that they are no longer believable. Unfriended is a film that is original enough that it can be enjoyed despite having a lack of scares. I’d rather watch this than another found footage movie.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2017
      },
      "score": 6,
      "text": "This movie was a solid: Okay.",
      "total_reactions": 0,
      "user": "Kooledud"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 1,
      "text": "To start this review off I would buy this movie on Blu Ray if i liked garbage. Disappointing horror movie. This movie can be so predictable it's not even funny, if your a big fan of horror movies I want you to guess how this movie will go down... yep it will go down just like that. The one thing that I liked was when that barely saved the movie was when the haunting finally happened it was entertaining, but the absolutely worst part was the first 5-10 minutes was the main characters (I forgot their names, that's how forgettable this movie is) are having their romantic dialogue that your suppose to care about but you don't  and the point were it goes on for to long I came so close to throwing my popcorn at the screen and leaving. This movie was not very good of this movie is still some how playing at your theater or when it comes out on DVD or Blu Ray and you haven't seen it don't waste your money. I probably should of watched True Story instead of this.",
      "total_reactions": 0,
      "user": "Red-Opposom-098"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "Entertaining new age take on the slasher flick with an effective and convincing young cast. The film explores the timely concept of cyber bullying that’s quite chilling and creepy at times. Its high concept premise is well written and directed and a good example that modern day horror movies don't have to be all about blood and guts splatter.",
      "total_reactions": 0,
      "user": "WJS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2016
      },
      "score": 4,
      "text": "[4/10]",
      "total_reactions": 0,
      "user": "mm007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "Unfriended is a really good and different found footage movie.This whole movie takes place on a computer screen which is something really rare and unseen before.",
      "total_reactions": 0,
      "user": "GentM2015"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "Unfriended is a movie that focuses on our completely on-line lives and our obsession with technology centered bye a revenge possession story tha plays out in video chat. I wont play spoiler so ill get to the point. I went and seen this with my 16 year old stepdaughter her boyfriend and my wife while they raved on and on about it being due to the younger generation being deeper invested to today tech and us thinking it could have been better point being the younger crowd will love this and must see little older crowds might pass here not to say i hated it i give unfriended a 6 just ok.  Positives: some good acting,can be suspenseful ,and good tech  Negatives:not scary,story not great,could have shown us more during possession  scenes to heighten  the scares",
      "total_reactions": 0,
      "user": "jjetme"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "I had absolutely zero expectations going into this movie and I must say I was pleasantly surprised. The movie takes itself just seriously enough to still make an effort, but not so seriously as to become unwatchable. The scares are light hearted and fun, and everybody in the theater was entertained and involved in what was happening. This is a great movie to go see with a bunch of friends, or with someone who is not a fan of more intense horror movies. Great and funny movie that is definitely worth checking out if you are just looking to pass the time and get a few laughs. I must add however, that the ending was pretty awful and unfortunately cost the movie a positive review. Not worth seeing in theaters but would recommend renting!",
      "total_reactions": 0,
      "user": "kkartco"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2015
      },
      "score": 7,
      "text": "People seem hellbent on hating this movie for it mimicking a realistic internet experience. Well that's kind of the point - it's relatable and we've all been in these situations before (sans the dead girl) so why criticize a movie for pandering to its tech-addicted audience? It works wonders, and while it's far from perfect, Unfriended provides a level of intrigue and suspense that has been sorely lacking in the genre as of late.",
      "total_reactions": 0,
      "user": "SolInvicta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "Unfriended has one positive thing going for it and that is originality, other than that, there is not much else to it. Having the film centered around a computer screen and all that it encompasses turned out to be far more entertaining than I could have expected. With this said, there also could’ve been a lot more work done with this film to really enhance it as a whole. For example, it would’ve been nice to see some more character development either in the beginning or towards the end of the film between Laura and Blair. A better understanding of these two characters would’ve helped to establish a better connection with the audience that was greatly needed. Even though this film was very different, it was not enough to impress me and not something worth rushing to theatres for.",
      "total_reactions": 0,
      "user": "ReysonPoint"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2015
      },
      "score": 3,
      "text": "I had a friend recommend this to me, and honestly I don't see what the whole hype about this movie was. I'll give the story credit for being original (and some of the morbid deaths). The story takes place on Blaire's computer. Being the tech-geek that I am, I spotted a LOT of errors (iMessage looked fake, the URLs in Blaire's browser had errors, etc). There were moments when I had butterflies in my stomach, but the entire movie was just death, arguments, drama and crying. The thing that hit me the most was the fact that the ending was anticlimactic - we saw a Blaire-scare, so what? There are so many errors with the plot. The incapability for them to leave their freaking bedrooms astounds me. Another one is HOW THE HECK DOES A FREAKING SPIRIT KNOW HOW TO USE A DAMN COMPUTER? I could go on about these flaws, but I'd reach the character limit after the fourth error. In my opinion, it kinda sucked.",
      "total_reactions": 0,
      "user": "TheFallen1GOTH"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "Unfriended is good but I have a problem with the charters just being in one spot in the movie I tented to forget a lot of the movie anyway if you curious about this movie go a head it pretty good.",
      "total_reactions": 0,
      "user": "luketeddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 8,
        "year": 2015
      },
      "score": 6,
      "text": "Unfriended me surpreendeu, o roteiro é consideravelmente um pouco mais fraco do que esperava, porem ainda sim há boas cenas onde se é impossível não criar uma expectativa da próxima ação a ser feita, as mortes não são tão impressionantes em si (mas causam certo impacto). Não é o filme da década, mas vale a pena",
      "total_reactions": 0,
      "user": "LucasTReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "'Unfriended' opens the doors to all fans of the genre to a new horror world. Throughout the years in the film world, Filmmakers, fans and even more producers have sought in one or another way to leverage the latest trend to ensure a resounding success. For example of this, Levan Gabriadze presents a project we've not ever seen, told in real time on the teenager's screen. For salvation of fans, this project revolutionizes so saturated name \"Found Footage \". The link recording works quite well , a bit reflective, a bit thoughtless appropriate for a bright and intelligent work as it is 'Unfriended'.",
      "total_reactions": 0,
      "user": "PipeC"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2015
      },
      "score": 10,
      "text": "Amazing thriller with fresh ideas and horror atmosphere. In the league with Grave Encounters and VHS series,  dont trust negative ratings, give it a try. It is one of thosem gorgeous movies with low ratings.",
      "total_reactions": 0,
      "user": "BiboranTV"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2015
      },
      "score": 2,
      "text": "A found footage film takes its style in order to create a sense of realism, hence providing scares since things appear as if they're actually happening. When, like Unfriended, a sense of realism isn't achieved in the slightest, the film fails miserably and all that's to see are the clichés and poor writing beneath the found footage veil.",
      "total_reactions": 0,
      "user": "jameslucasutley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2016
      },
      "score": 10,
      "text": "Another criminally underrated horror movie. I don't understand why more people liked Krampus than Unfriended. Unfriended isn't scary, but it's still captivating, and it's a good morality lesson for older teenagers.",
      "total_reactions": 0,
      "user": "asmanraj"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2015
      },
      "score": 1,
      "text": "Literally not worth watching unless it's your first or second horror movie ever. The only thing worth noting about the movie is the way it is recorded; all through a screen. But really, as original as that may be, it just ends up making the whole experience worse. When a character dies, you don't get scared, you don't feel pity; it's just \"oh, haha, that guy died, what was his name again?\". Yes, they are that forgettable. This whole movie is incredibly forgettable. I came here expecting an average score of 35, because let's be real here, it doesn't deserve any more than that.",
      "total_reactions": 0,
      "user": "GarbodorSenpai"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2015
      },
      "score": 1,
      "text": "For those of you that haven't heard of this movie there's a very good reason for that. In a way it's refreshing to see an original movie but in saying that, there are some ideas that are just too ridiculous/stupid etc. to even be considered. How this movie got funding I'll never understand. It's an hilariously terrible, so bad and not even close to scary, epic fail of a movie. Simply laugh out loud funny.",
      "total_reactions": 0,
      "user": "Rebecca31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "This movie was pretty scary and has a lot of tension and suspension. It's a very creative idea, and is a really good film. I'm really excited about the sequel, and this is well worth your time and money",
      "total_reactions": 0,
      "user": "calebowensmall"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2016
      },
      "score": 1,
      "text": "Firstly, Unfriended is one of the worst films I have ever experienced. It's worse than the Paranormal Activity Franchise. The actors in unfriended are terrible, it feels as if they are just reading their words off a script that is in front of them. People are saying that the video call format for the film is creative. No. It isn't creative, it is because the film is low budget. Also, half the film is a mouse moving around the screen and clicking on random crap. If I wanted to spend half an hour watching a mouse move around a screen I would give my grandma a computer and watch her try to work it for half the film. The story plot is OK until you realise that the thing killing all the friends is actually the ghost of Laura. She committed suicide because of a video of her passed out on the floor with poo on her leg. Another thing I want to complain about is the unoriginality of the film. 'Lets play a game', I wonder what film we have heard that quote in... People that are saying that it's tense and scary properly get scared of their own shadow. Overall, the film is a waste of time and I don't recommend it to anyone under the age of 10.",
      "total_reactions": 0,
      "user": "UnfriendedIsBad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2016
      },
      "score": 1,
      "text": "I gave it a 1 for effort but this movie is just awful honestly. It wouldn't be bad but you're literally watching 5 people talk on skype and type messages on facebook for however long this movie is. On top of that the story line is completely predictable at every turn. Skip this movie if you value your time.",
      "total_reactions": 0,
      "user": "jsometie94"
    }
  ]
}