{
  "mc_avg_user_score": 8.8,
  "mc_metascore": 88,
  "mc_mixed_rating_frequency": 59,
  "mc_movie_name": "Up",
  "mc_negative_rating_frequency": 27,
  "mc_positive_rating_frequency": 1015,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "Charming, emotional, hilarious, just some of the words that can be used to describe Disney/Pixar's Up. The opening of the film is the saddest thing I've ever seen in anything, and that's coming from a family film. Pixar continue to produce the best.",
      "total_reactions": 5,
      "user": "Happymonk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "hilariously uplifting adventure",
      "total_reactions": 2,
      "user": "dante_finn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "This is definitely one of Pixar's best animated features.",
      "total_reactions": 1,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "A brilliant, unique movie. One of the best children's movie I watched.",
      "total_reactions": 1,
      "user": "MichaelD"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "Though it is not the best Pixar film (for me, Ratatouille takes that spot), it is still a great movie. I love the fact that this this movie is very diverse, it has comedy moments, dramatic moments, action moments and a lot more. The flow of the story is brilliant, from start to finish, making the plot of the movie clear and understandable. And I appreciate that they make this more of an animation movie (which we all know that these movies are mostly for kids), where adults can relate. Yet again, Pixar has again produced an amazing movie and I am looking forward for more Pixar movies in the future...",
      "total_reactions": 1,
      "user": "aaronpaul121"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "Another great Pixar movie that has characters that you can connect with.  Especially Ed Asner's character, you really feel the love he had for his wife and the pain he goes through when she dies.  Also the other characters including Doug the dog and Kevin the snipe make for the fun adventure.",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "Up es una replica a seguir de como hacer y aprovechar una pelicula teniendo en cuenta los sentimientos y valores que hay que dar en este tipo de peliculas, una excelente muestra del amor en todo sentido y una pelicula mas que adorar de entre otras de Pixar",
      "total_reactions": 1,
      "user": "Jmsbpp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "Touching, hilarious, and really funny, not to mention that the opening part is so sad and heart-warming. This is a film that you need to see. It tells a great love story, has memorable characters, and is nothing but a great adventure.",
      "total_reactions": 1,
      "user": "Delaforce828"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "Up is a film that touches your heart emotionally with its great animation, touching story and loveable characters. A must watch for anyone, even the people who don't like animation need to experience this movie.",
      "total_reactions": 1,
      "user": "Parappafan1996"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Pixar always makes the best movies that touch us, such as Toy Story, Cars, Finding Nemo, and The Incredibles. This movie made me cry and laugh. Every great movie gives you both. Another outstanding story made by Pixar, about always going for your dreams, the limits are endless for adventure.",
      "total_reactions": 1,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "Up truly embodies the spirit of Pixar, or rather the spirit of adventure. What life throws at us is not always expected, and only through the charming characters of Carl and Russell do we truly see what it means to to go on an adventure. There's something ethereal and magical about Up, and even if animation isn't someone's cup of tea, this movie should be.",
      "total_reactions": 1,
      "user": "hanneguacamole"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "An absolute joy to watch. Up, although harrowing and touching, is also action packed and adventurous. One of, if not the best Pixar film to date. If you haven't seen this, you're definitely missing out.",
      "total_reactions": 1,
      "user": "BoogeeFilmGuy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "It's a true adventure made by Pixar. I love Dug so much from the movie and it'll be as exciting as you wanted it to be and it'll be an adventure in progress.",
      "total_reactions": 1,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "Animation giant Pixar walks into 2009 with their new animation \"Up\". The movie is so organized and amazing, all I could suggest to you is to just shut up and watch the movie.",
      "total_reactions": 16,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2011
      },
      "score": 6,
      "text": "Up isn't a very funny movie, don't get me wrong it has it's funny moments, but I don't believe they were trying to go for the funniest movie out there, they try to get emotion in there, and for the most part they succeeded, it's nice to see a movie for kids that tries to teach them something, but it could have been more interesting, it can get pretty boring at certain points, but this is a movie I can recommend, just don't expect a comedy that will keep you laughing through the entire time.",
      "total_reactions": 4,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Pixar at it's finest, showing that an animated film doesn't have to rely only on humour but also can be quite emotional. Within the first 10 minutes of the movie you automatically feel for the main character and become emotionally involved in the film, that alone got me really impressed, Great animation backed up with great characters ( as any dog owner would agree ) , very funny movie that also pulls at your heart strings. A Must see.. A classic.",
      "total_reactions": 2,
      "user": "sumsar"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "Up was PIXAR's masterpiece. I mean this movie was absolutely perfect. The characters were hilarious and you could relate to them very well. Doug the dog was the best comic relief ever in an animated film. The plot was extremely original it's not funny. That doesn't mean the movie's not humorous though. It's freaking hilarious and it's also possibly the best movie I've ever seen. The overall movie is 11/10 and it is just - GORGEOUS!",
      "total_reactions": 5,
      "user": "Pixarlover"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Tells one of the greatest love stories in cinematic history in a brisk eight minutes. That, as is the film itself, is a wonderful, awe aspiring work of genius.",
      "total_reactions": 3,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "After the first 20 minutes or so, the film just falls apart. Enjoy the beautiful beginning because its really the only noteworthy part of this very overrated spectacle. I don't understand why animated films don't need to follow the same common guidelines to making good entertainment other films, but apparently they do. Definitely not Pixar's best.",
      "total_reactions": 7,
      "user": "nboley08"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2012
      },
      "score": 0,
      "text": "This could arguably be Pixars greatest work, the first five minutes is without a doubt the greatest opening in cinema, getting all emotional scenes from evry film in history and putting them into one beautifully told and stunning scenes. If the film had lived up to this it would un deniably be in the top 10 greatest films in history, but it turns into adventure that is so admirable. Pixar again creates gorgeous visuals and a setting that is truly stunning, its charming and funny throughout. Performances are top notch and laughs are real laugh out loud ones, its every thing you could hope for in a film in one. The storytelling is stunning, creating morals, excitement and is very emotional at places. The film does not try to be this forced emotion present in most films, but is just there and is some of the most emotional scenes in film history. Undeniably good, the film needs to be watched to be understoof how the snese of adventure, memories, emotion and simply letting go create one of the greatest films ever. But what did you expect from Pixar?",
      "total_reactions": 10,
      "user": "charliew1820"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "I've always enjoyed Edward Asner's voice work since Freakazoid (a cartoon not many of you may know), and he does an excellent job here. A sweet tale and a fun adventure on a flying house make this another Pixar classic.",
      "total_reactions": 1,
      "user": "gm101"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2011
      },
      "score": 6,
      "text": "This animated movie from Disney and Pixar isn't their best work, far from it. It has it's funny moments, but overall it's just not that funny. The intro of the movie, basically the life of Carl Fredericksen from childhood to the age of seventy eight , is very compelling and the best part of the movie. If Up was just those ten minutes I would give it a perfect score. That part is truely magnificent. The rest of the movie is frankly a letdown, good for a few laughs but nothing more. (6.0)",
      "total_reactions": 1,
      "user": "DannyD225"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "After the emotional opening half hour Up descends (Ha!) into slightly clichéd territory but remains entertaining for the duration of its running time. I personally wouldn't rate it as highly as the very best animated movies but this is another solid effort from the always reliable Pixar.",
      "total_reactions": 1,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "As an adult, I didn't particularly enjoy this movie. It wasn't bad, but I wouldn't watch it again. I agree with some previous users in saying that the beginning of the movie is the best, and from there it just sort of goes downhill.",
      "total_reactions": 1,
      "user": "xlogan123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "I know for many this movie is their favorite Pixar movie. But not me. In fact I got to say it is my least favorite Pixar film. Sure it has great visuals and some colorful characters. But I just found most of it a bit dull. The intro, however is absolutely fantastic and sets such a dark tone that I was really surprised to see in an animated movie. Then it goes all light hearted and colorful. I would think that this movie is more for a younger audience that want that kind of thing, but after such a deep intro I had honestly expected that the rest of the movie to be the same, but its not. The whole movie feels like you're waiting for something to happen and it just never reaches a climactic point of note or worthy to the tone set in the beginning. Overall: It isn't a bad movie, but I found it a bit too light hearted to take it seriously. But again, this is just me and I understand why others really like it.",
      "total_reactions": 1,
      "user": "Rox22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "This is my favorite film from Pixar, besides Monsters Inc.  The story about finding an adventure to embark on and enjoy the ride is the over riding theme of this film.  The quirky characters are not to be forgotten and emotional depth the film takes you as experience the joys and pitfalls of life.",
      "total_reactions": 0,
      "user": "Julara"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "UP is about an old man named Carl who sets out on an adventure, to fulfil his childhood sweetheartâ",
      "total_reactions": 0,
      "user": "NatDurman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2010
      },
      "score": 10,
      "text": "This was the best Pixar movie I've ever seen.  I loved it, even thought it was sad it had a great story.  The animation was very real, Blu-Ray is the way to go with this movie as well.",
      "total_reactions": 0,
      "user": "Jawcl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "In terms of emotional immersion, characterization, humor, and just good old-fashioned entertainment, Pixar puts all other summer fare to shame.",
      "total_reactions": 0,
      "user": "ryancarroll88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "Up is a great family film,it is uplifting,funny,and and at event some parts dramatic.In my opinion it is one of the best movie to come out last year. The story is sweet and the visuals are great. These CGI graphics are outstanding,and look better than most high budget action movies. The acting is good,and each voice fits the charachters perfectly. The background score is great,and fits perfectly to whats happening. This is one of Pixar's  best and is a must see.",
      "total_reactions": 0,
      "user": "jeremyd99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "The beginning montage is one of the most beautiful things I have ever seen. The movie has enough for both adults and children to enjoy. All in all a fantastic story that reminds us all the seize the day!",
      "total_reactions": 0,
      "user": "Melissa6381"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "from the guys who brought you Monsters INC comes another memorable movie for kids and adults also known as Up. whats my opinion of it? its not my favorite, but its great. every Pixar movie kicks a**. Great characters, Great writing, Great music, and most of all: Great animation. Rating: 89%",
      "total_reactions": 0,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2016
      },
      "score": 5,
      "text": "The opening of this movie is amazing, and one of the strongest things Pixar has ever done.",
      "total_reactions": 0,
      "user": "TitaniumDragon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "After losing his wife, Mr. Frederickson finally finds adventure as he strings a plethora of balloons to the top of his house and tries to fly himself to South America, where his wife had always wanted to go since she was young but never got the chance. But when a 9-year old obnoxious fellow swings on for the ride, Mr. Federickson has to learn to deal with him after a conflict arises once landing in South America. Up is definitely a film for the entire family to feel excited about. The intial first 10 minutes are very heartwarming, but loses that warmth a little once the adventure begins, soon feeling like a shorter, much toned down adventure once it ends. Without a doubt Pixar delivers quality animation once again, but the feeling is different once the end credits, the same I saw in Cars and Monster's Inc. But definitely another masterpiece for 2009.",
      "total_reactions": 0,
      "user": "Film_Fanatic_15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "By all standards, this is Pixar's most beautiful, most enjoyable, deepest and funniest movie ever. I've had a smile throughout the whole movie, and all I can say is: terrific. It was such a refreshing feature and the story line was unique at it's best and worst. I didn't know what to expect when I went to see the movie. I thought it would be just another bubblegum animation, but boy, was I wrong. This is the most pleasant surprise I've ever experienced in my whole life. The characters are so sympathetic and the dogs are extremely funny. Pixar did it again.",
      "total_reactions": 0,
      "user": "TheGorilla"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "Pixar continues to amaze me with the quality of their films. They have mastered the art of film-making and could change the way you think about the world with a colour or a sound. With \"Up\" they take you on an journey of subtle but dark emotion and quirky humor, exploring circumstances not unlike to those we experience in our lives. The script breathes life and genuine emotion into each character and perfectly selected tracks are only a few of the things that makes 'Up\" so brilliant. It is a perfect family film and will make you cry and laugh till the end.",
      "total_reactions": 0,
      "user": "Creativita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "I love every part .it is my favorite movie. it is funny in every shape and form. it is so cool. something bad happens ,but it turns out ok .there are thousands of movies , but RENT this .",
      "total_reactions": 0,
      "user": "corpep"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "Up is a decent yet patchy addition to the Pixar cannon. The elements that deal with grief work excellently, yet the action is a little too abstract in comparison. Love those talking dogs, though. Hilarious!",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "Even after the love of your life has passed away you can still spend some happy time with your sweet grandchildren and your loyal pets. \"Up\" is a beautifully sad movie about having a dream and living an adventure. While the villain is extremely unlikable, the protagonists are very lovable. The film might not have needed the final action sequence in the end, but \"Up\" is definitely worth watching.",
      "total_reactions": 0,
      "user": "juliankleiss"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "By the first it looks like a drama... it's really touching, the years going by... life, death... love... the idea of eternity, what remains, what doesn't... gotta be clear: I bursted into tears!!!! But... I've got really dissapointed passing thru this ''sad starting'' because it get's so... funny but for kids... the whole rest is intended for children... so it's good, really good Oscar Winning original score (you deserve it Mike Giacchino)... and after all, was the best on animated movies from 2009. Good job after all!",
      "total_reactions": 0,
      "user": "Malasawas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "The opening seen in this is one of the few times a character death in a movie has actually saddened me. One of the most emotionally magnificent films ever crafted. The animation is incredibly vibrant, the score is rich and beautiful, and the voice acting is incredibly convincing. After hearing the story about the little girl who died after seeing this film, I only watch this film with more respect . A fantastic work of art. No wonder it was only the second animated film nominated for the Best Picture Oscar, this is amazing.",
      "total_reactions": 0,
      "user": "AtTheMovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "How many movies have an old man as a lead character? Very few, and its this original approach to film making that makes Pixar so good. The characters, story, animation and design of this film are brilliantly crafted. Up is just sort of being a masterpiece, it's a great animated American movie.",
      "total_reactions": 0,
      "user": "davenbettridge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "This film, I found it very well made. It has a serious story line but great depth of character and some very funny seance. its slower pace sets it of from other animations with its dark beginning showing it to be film encompassing older generations.",
      "total_reactions": 0,
      "user": "daafdaaf"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "\"Up\" One Line Review!",
      "total_reactions": 0,
      "user": "LevelsAndGear"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 9,
      "text": "I'm two years late to the party, but glad I arrived there anyways. I rarely get moved by a movie, but this one had me on the brink of crying more than once. The characters are likeable, the surroundings beautiful, and the story emotional. If you haven't seen it already I highly advice you to do so.",
      "total_reactions": 0,
      "user": "Navelpluis1337"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "This one is real, incredibly powerful, full of eye-popping visuals and a complicated protagonist that is introduced in an almost perfect way with a truly flawless montage to explain his life",
      "total_reactions": 0,
      "user": "JawsPapi87"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "Delivering some real laughs and interesting moments at the first minutes, \"Up\" sounds quite promising. But as soon as the plot starts to develop, you realize that \"Up\" is a good movie but is far away from being a Pixar masterpiece.",
      "total_reactions": 0,
      "user": "Potter17"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2011
      },
      "score": 9,
      "text": "Uplifting,emotional and comedic. Mixed in perfect proportion.A treat to enjoy and ponder over.The film manages to together universal themes and in the process lead the viewer through an amazing journey complete with fantastic vistas,nail-biting tensionand if there's no one else nearby some choice words toobased on character foibles.",
      "total_reactions": 0,
      "user": "xena"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2013
      },
      "score": 10,
      "text": "reviewers had warned me and exited me before i saw this movie, and i immediately saw it twice, and a third time with director's commentary. pixar's up is so unbelievably good that i am now turning it into a moviegoers duty to once see this movie as a sort of holy pilgrimage. why is it so epic? because it's got everything. action, beautiful set pieces and animation, and, on top of it all, and at the very core, because it's a deeply philosophical movie and a great teacher, and it parallels it's joy so much with it's sadness that it creates a memorable and heave experience. what i like most about the philosophical element is that all the characters are built around a theme, and they all mean something and have something to say, which makes every one stick to my memory. every person in their lifetime has to see up before dying.",
      "total_reactions": 0,
      "user": "bram29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "Up is a great animated film that is among the best from Pixar. It has the most heart warming story that Pixar has ever had and the characters are great.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "cross your heart.a promise keep all lifetime,a lifetime for a dream,that's awesome.adventure is out there,just follow you heart,work for your dream,what the **** least 150 characters long.",
      "total_reactions": 0,
      "user": "maskinmask"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "Pixar may have created some of their finest work yet in the form of Up, it really packs an emotional punch that is difficult to find these days with real actors involved, but they manage to tell a love story and have a father/son or grandfather/grandson dynamic in this film that also show wonderful visuals that outline just how far the company has come since its Toy Story days.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "An excellent movie through and through, with silly scenes and a pretty good story. Animations are outstanding. The characters are great. The story seems shaky at times, and it doesn't really keep you interested at times. But, I definitely recommend this movie to anyone at any age.",
      "total_reactions": 0,
      "user": "Jboy2468"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Up is timeless, emotional, heartfelt; everything in Up is in the right place its humor, heart and characters everything is just timeless and wonderful. I give this film 97%.",
      "total_reactions": 0,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "Very good and humorous film about an old old man sat in his house on his favourite chair next to his wifes who unfortunately passed away a couple of years back, until he meets a scout boy named Russell, who is wanting his last badge called the \"wilderness explorer\" badge. Russell and his new old best friend goes flying over the rooftops of thousands of houses to get to the place where the old man has promised his old wife to go, South America, to a waterfall where they could build a house they have planned since the early ages of life, can he get there with a helping hand of Russell and some friends? Personally I LOVED this film and I am surprised there is some negative reviews!! :) great movie!",
      "total_reactions": 0,
      "user": "Smileylivvie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "Up is as charming and funny as any adult movie, and it keeps the morality and gentle humanity of a Pixar classic. This is a cinematic masterpiece to behold for all ages, as its flaws are few and far between.",
      "total_reactions": 0,
      "user": "Zegilgamesh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2012
      },
      "score": 10,
      "text": "to be honest i thought this movie was going to suck the characters are very memorable and the storyline is amazing and 5 minutes in the movie has almost and or balling your eyes out pixar make the best cgi movie and most luckly will always make the best cgi movies this movie is touching moving funny and inspiring you serious let out every emotion possible during this movie and thats the kind of movie that deserves a 10",
      "total_reactions": 0,
      "user": "7dogguy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "Pixar rarely disappoints. Another brilliant movie. A very colourful, intriguing and moving movie that will keep you anticipated the whole time. A variety of emotions were felt in this roller coaster ride especially the flashbacks which hits you hard. Definitely worth the nomination of Best Picture. Highly recommended.",
      "total_reactions": 0,
      "user": "Boozerx7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "The most powerful animated film ever made. Truly amazing. I am NOT ashamed to admit that, for most of the movie, I had tears streaming down my face (either due to laughter or sorrow). This is an example of what ALL movies should aspire to achieve: Truth, beauty, and downright awesomeness. :D In Christ, Jesrin.",
      "total_reactions": 0,
      "user": "Jesrin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "Possibly the most entertaining and heartwarming animated movie I have ever seen. Disney once again creates a touching story that will please children and adults alike.",
      "total_reactions": 0,
      "user": "dudu_95"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "Up had a great beginning, an unimpressive middle, and a pleasant ending. It is far from the best material Pixar has produced. You get the feeling it could had been so much more imaginative considering the premise was wonderful.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2012
      },
      "score": 8,
      "text": "Disney-Pixar have almost consistently produced films to a superb standard in recent years and Up does not just meet this standard but raise it further. As with its predecessors, the animation is great and the story is amusing and rich in sentiment but what makes Up stand out above the rest is the combination of unusual characters, odd story and superb Oscar winning score. With the exception of The Incredibles, Pixar have traditionally stayed away from humans as central characters. However, in Up the main characters are Mr. Fredricksen, a lonely, grumpy old man and Russell, a plump young explorer scout. An unlikely pair who are unintentionally thrown together as Mr. Fredricksen transports his house to South America using helium filled balloons to escape moving from his home. There they meet a group of talking dogs, an endangered bird and Mr. Fredricksen's childhood hero as the adventure and fun continues.",
      "total_reactions": 0,
      "user": "A_Northerner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "Up was so much better then I thought. Why give it a 6 A 5 or 2 out of 10? This film was amazing so just watch it. Up 9.5/10",
      "total_reactions": 0,
      "user": "watithink123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "I have come to expect a lot from Pixar.  They have consistently churned out wonderful movies, and I had heard Up was no exception.  Unfortunately, I don't think that Up is nearly up to par with Pixar's best.  The movie starts out fantastic, but it quickly falls apart.  By the time we reach the second half, the movie has devolved into a mess.  I think my main problem with Up is that it is the only Pixar movie where I cannot nag the feeling that everything is so implausible.  How utterly unrealistic it was bothered me the whole movie, and this is saying something coming from someone who wasn't bothered by rats cooking.  None of the characters in Up are particularly memorable.  It just didn't connect with me in the way that other Pixar movies have.",
      "total_reactions": 0,
      "user": "CDQ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "It's sweet, emotional, and hilarious adventure from Pixar. Adults would probably enjoy this film more than kids, but nevertheless, this is a great family & kids film.",
      "total_reactions": 0,
      "user": "Official"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "just face it disney pixar is THE best at animation nothing can beat them when it comes to animation Wall E: 10/10",
      "total_reactions": 0,
      "user": "King_Ossy99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "Quite simply Pixar's best film to date. The emotional journey coupled with the eye-popping visuals makes for a film that deals with themes of tragedy, grief and loss encapsulated in such a sweet package - you won't be able to resist. This bravura film leaps beyond the apparent restrictions of an animated film with mature themes whilst still maintaining the innocent sentiments at heart.",
      "total_reactions": 0,
      "user": "anshiman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "This could arguably be Pixars greatest work, the first five minutes is without a doubt the greatest opening in cinema, getting all emotional scenes from every film in history and putting them into one beautifully told and stunning scenes. If the film had lived up to this it would undeniably be in the top 10 greatest films in history, but it turns into adventure that is so admirable. Pixar again creates gorgeous visuals and a setting that is truly stunning, it",
      "total_reactions": 0,
      "user": "charlieW24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2016
      },
      "score": 4,
      "text": "Did I watch a different movie from everyone else? The one I saw was a boring, unimaginative 90-minute film that left me completely numbed from boredom. The only thing preventing from hating this one is the incredible voice performance from Ed Asner and the fantastic animation, as always, from Pixar. However, the rest really left much to be desired. I hated the beginning and did not find it sad in the least. It was cute sure, but I hate montages. This one is no different. It is a major storytelling cop-out and, as a result, it never resonated with me when the end result was revealed. Even more, that wound up being the best part of the story, which is truly astonishing. After creating this real, believable world, it delves into the absurd, stupid, and incredibly dumb (talking dogs?). The film felt so manufactured and manicured, it seemed to me that Pixar had found a formula they thought worked and could plug any story into. Tragically, it did not work with Up as it felt entirely fake and, as such, that prevented me from feeling any sort of emotion. I thought it would be this sad, funny, and entirely charming, experience, but instead I was left feeling incredibly annoyed as I waited for yet another lame attempt at a joke and some juvenile talk on the emotional impact of losing your spouse. Just let the damn house float away you moron. Plus, I have to ask; wouldn't Russell's mother wonder where the heck her son went? How can this old man, who is shown to be unable to do much of anything, be so agile towards the end? Just the magic of being around an annoying child? Anyways, Up is massively overrated. Though technically brilliant and Asner is a complete delight, so it is not all for naught, but I wonder if I watched a different film. The one I had had the worst storytelling of any Pixar film I have seen, felt completely contrived, and lack any sort of emotion. Instead, it was a dumb adventure romp that felt fake. Yes, I know Toy Story is about talking toys, but it feels real. Here, it felt like a bad parody of other Pixar films",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "'Up' is funny, heartrending and lovingly made - very good pictures! But the story with the talking dogs is a bit silly and probably just there to fill time. Also, there are many goofs but that's okay. All in all, one of the best disney movies of all time - a good time for childs and grown-ups!",
      "total_reactions": 0,
      "user": "axelkoch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Everyone talks about how sad this movie is, or at least about how sad the beginning is. Personally, I don't think that \"sad\" is the best word. It was more like...brilliant. Smooth story telling dense with emotion, irresistible humor, lovable and distinct characters, the perfect dose of peril and of course spot on animation. With this moving adventure of love, companionship and discovering the real treasures in life, Pixar has managed to, once again, touch us to the core with the simplest of gestures and in the process add another sparkling gem to their vault.",
      "total_reactions": 0,
      "user": "YoursTruly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "This movie is the only animated movie that made me cry. it´s story  is so heartwarming it´s charchaters are grow on you. this movie you must watch  or if you donýou will miss one of the most satfiying movies of all time",
      "total_reactions": 0,
      "user": "domec"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2016
      },
      "score": 9,
      "text": "'Up' to this day still remains one of my absolute favourite animated movies. And why is that? Because it combines so many astounding elements into a brilliantly made film. It's heartbreaking, it's charming, it's entertaining and it's fantastically crafted. The characters are memorable, the story is deeply intriguing and the soundtrack is just beautiful. 'Up' is a very special film, one that won't leave a person for a while.",
      "total_reactions": 0,
      "user": "HazzaGalla"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "I love the message behind this movie, even though it had such sad moments it is beautiful to understand that it is ok to dream and even though things do not happen the way we first think they would, doesn't mean they wouldn't happen at all.",
      "total_reactions": 0,
      "user": "sayomgwtf"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "Brilliant first act where emotions ride high. Beautiful, heartwarming and special. However, from the middle of the film to the end it does not feel that special and suffers a clear decline in originality and quality. Still very good nonetheless. Visually stunning and colourful. Great concept that suffers towards the end of the film. A 7.5 out of 10.",
      "total_reactions": 0,
      "user": "sanyrub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2013
      },
      "score": 10,
      "text": "I was really excited for this because it would be the first I can root for a human protagonist (I wasn't a big fan of The Incredibles yet). Pixar upped the ante with this one as it takes the characters from a bustling city to the labyrinthine wilderness. It has the most touching opening of all the movies I've seen and things just get better as the movie progresses.",
      "total_reactions": 0,
      "user": "Weaselboyst"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "A Thirst for Adventure",
      "total_reactions": 0,
      "user": "LucasGoble"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "Apart from Toy Story, this is truly Pixar's finest work to date. Not many studios can make an audience feel this much emotion for a character within the first 15 minutes of a film, but Pixar pulled it off. The rest of the film is brilliant to; it makes you laugh, it makes you cry and it keeps you immensely entertained throughout. One of my favorite films of all time.",
      "total_reactions": 0,
      "user": "Blooker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "A hilarious and emotional masterpiece by Pixar. Arguably one of their best films to date. The movie is full of memorable characters, witty dialogue, and excellent animation. A must see.",
      "total_reactions": 0,
      "user": "shprea"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "I had a lots of fun! No matter if you like animations or no, i think you are going to enjoy this great Disney Pixar animation! Nice overall story and characters with some minor weaknesses! 7/10 Recommended",
      "total_reactions": 0,
      "user": "SEROJ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "Hilarious and beautifully written story of a man and a boy navigating through the world of Paradise Falls.",
      "total_reactions": 0,
      "user": "sil3nt_nick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "This is a Pixar movie that really took me by surprise. It really made me like more than I thought I would. The story is marvelous, the characters are very interesting and the plot is unbelievable. What really surprised me in this movie is how much this movie really has heart. I mean, all Pixar movies have heart, but this one has a lot of it. Basically because the story is about how Carl has to deal with losing his wife. It really impacted my heart-strings in a way that no Pixar movie had done before. Plus, it has its really funny moments as well. I was afraid that this movie would have that quirky childish-like humor, but honestly it didn't. It worked really well for both kids and adults in a much different way. Even the music was made perfectly to the tone of the movie. This movie is definitely in the top 3 best Pixar movies ever made. Not only that, but it's also in my top 5 movies ever made. Overall, it's a powerful Pixar movie.",
      "total_reactions": 0,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2014
      },
      "score": 4,
      "text": "I think this is Pixar's worst film. I love the first twenty minutes, but they belong to another movie. The rest of the movie reminds me of Jim and the Giant Peach (a decent film, nothing spectacular) because the plot is just silly and random. The differences between Jim and Up are that the animation in Up is far less interesting, and the characters are boring and forgettable, or annoying. Forty minutes into the movie and I was looking at my watch, so boring.",
      "total_reactions": 0,
      "user": "Max15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "The best 3d animation i have see! The script is very sad, but show us how the life can be simple. On that movie you remember how important is promise.",
      "total_reactions": 0,
      "user": "voiders"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "The best Pixar film by far. The emotional breakthrough I had at the end the kindness and chivalry from the main character I left the theatre thinking everyone in the world should be like that",
      "total_reactions": 0,
      "user": "Lansdenrs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "I like this movie very much.It has all the thing to make a movie good.I like background music at the starting very much.UP! has me feel Up.IF you are tired of watching drama watch this movie you will not get tired",
      "total_reactions": 0,
      "user": "Pranay6"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "\"Up\" is charming, heartwarming, and a clever movie that proves that there are always good films out there, even animated. \"Up\" deals with the strong relationships that we all deal through in life  when someone dies, and even though we've dealt with movies like this before, \"Up\" has human-like emotions, that it exceeds several of other love stories produced. Up's characters are wonderful  Carl Fredrickson is an old man who is cranky after his wife's death, but yes, he is likable as his story is so tragic. Russel is the annoying kid, but he deals with the fact that his parent's don't pay attention to him, and... it is emotional. \"Up\"'s plotline in impeccably told, and deals with the beauty of our world  love. After watching \"Up\", it makes you realize our world and our people, and how we are all connected to others by love  and this is beautiful to realize in times like these.",
      "total_reactions": 0,
      "user": "jeff_reviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "Before watching this movie, I had little expectations for something little more than a cliché child's film, I discovered something more. A beautifully animated and written classic. It could possibly have the most emotional 4 minutes of a movie I have ever seen as well as heart gripping soundtrack. The comedy was heartwarming as well as the connection between Carl and Russel. Story telling at it's finest.",
      "total_reactions": 0,
      "user": "berkpwn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "The beginning is poignant and sad at the same time. The rest follows a heartfelt tale of a man's journey, not just to Paradise Falls. The trio of the old man, the scout, and the dog is not only funny, but like actual family. Pixar has so many greats on its agenda I doubt anyone can replicate it.",
      "total_reactions": 0,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2014
      },
      "score": 5,
      "text": "While I have nothing against Up's animation or story, the film itself is just average. The montage of Carl's life with his wife is touching and maybe even tear-jerking, but the rest of the film is not one of Pixar's best.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2016
      },
      "score": 10,
      "text": "\"Okay, this is it! Everyone said that WALL-E was one of the greatest films of all time, no way can Pixar follow up with something amazing!\"",
      "total_reactions": 0,
      "user": "FreedomFighters"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "in my opinion this is the best actual film that walt disney pixar made,that is a lot of good characters in this film and almost all of them have their touch.",
      "total_reactions": 0,
      "user": "joao1198pedro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "Sorry I don't get all the praise about this movie.",
      "total_reactions": 0,
      "user": "Klotz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2013
      },
      "score": 8,
      "text": "Up goes high.",
      "total_reactions": 0,
      "user": "RayzorMoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2014
      },
      "score": 9,
      "text": "A stellar creation by Pixar. \"Up\" is a film I believe is for everyone. That somehow reaches into everyone's souls and pulls out the heart in them. Not just the heart, but the feeling of enjoyment that this film does intend to do. I enjoyed the film from start to finish, not just once, but several times over.",
      "total_reactions": 0,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "people say old people  are  just mean when you  up it tells you old people have a big heart also pixar has a way to creative  better films . i always love the old guy in this movie",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2014
      },
      "score": 8,
      "text": "Funny,touching,and incredibly good graphics this is by far one of my favourite pixar movie of all time.The characters are really funny,if i had to recommend a movie from pixar this is the one i would name.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "There will be always somebody who doesn't like this film but what that person can't deny, is that \"Up\" is beautifully animated, incredibly well written, amazingly voiced (for every country), undeniably laugh-a-minute gags and another Pixar hit.",
      "total_reactions": 0,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "Para mi, la mejor película de animación hasta el momento, ya se que para muchos Toy Story es mejor, pero esta posee un gran guión, combina la risa con las lágrimas a la perfección, es simplemente una obra maestra.",
      "total_reactions": 0,
      "user": "elsylorena"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "After one of the greatest opening sequences I've seen in any animated film, Up turns monotonous. Now to be honest, Up had a to to live up to, given Pixar's previous installment (Wall-E) is one of the greatest animated films ever made. Up, in comparison, is just mediocre pish-posh. It's so random that I might have learn't a lesson in chaos. Had they concentrated on the relationship between Carl and his late wife more, the film would have been far more interesting. After a while the boredom wears off and it just gets annoying. Even for a children's film, dog's flying planes is just silly. It's the overload of plot devices that really brings down the film. Had Up been even the least bit innovative, it would've been a far better film. Aside from its first 10 minutes, UP is nothing more than just another animated film which had the potential to be a lot lot more.",
      "total_reactions": 0,
      "user": "AkashVijay"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2014
      },
      "score": 6,
      "text": "Prior to watching this: Love all the previous Pixar films and was hoping this will be great too.  The reviews said so.",
      "total_reactions": 0,
      "user": "43in2014"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2015
      },
      "score": 10,
      "text": "Up is another original triumph for Pixar. This movie is up there with Toy Story and Monsters Inc. as one of the best Pixar movies I've seen. The animation is like no other film and the casting for the voices is spot on and there really aren't any A-List stars providing voices for this movie which is impressive as well. This film seems kind of ridiculous at times but it is fun and very thoughtful. The characters are essentially perfect and very well developed so I really cared for these fictional characters. Up is also one of the funniest children's films that I have ever watched.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "this is not one of Pixar's bests. I found it too dark, too sad, and yet it's heartwarming...? At no point i felt heartwarmed... Although it did have a few parts that made me chuckle. The whole time sitting there watching this, I wanted to kick Russell in the face! Visually it looks okay. 4/10.",
      "total_reactions": 0,
      "user": "TrevorDevendorf"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "Um filme perfeito. Com certeza um dos melhores da Pixar,se não o melhor. Mostra um velhinho que não quer desgrudar de sua casa por nada,e ainda vive o filme inteiro com o desejo de morar no Paraíso das Cachoeiras. O filme mostra superação e desbravamento. Palmas.",
      "total_reactions": 0,
      "user": "f3l1p3"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "Up is a comedy adventure about 78-year-old balloon salesman Carl Fredricksen, who finally fulfills his lifelong dream of a great adventure when he ties thousands of balloons to his house and flies away to the wilds of South America. But he discovers all too late that his biggest nightmare has stowed away on the trip: an overly optimistic 9-year-old Wilderness Explorer named Russell.",
      "total_reactions": 0,
      "user": "SythusRATINGS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Another's Pixar's favourite. Good animation, as always, very original, incredibly emotional, very funny, and simply amazing. Pixar will never stop surprising me.",
      "total_reactions": 0,
      "user": "Dokalu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2015
      },
      "score": 10,
      "text": "A beautiful movie with an unexpectedly depressing start - the whole concept of growing old and losing someone is something that kids movies don't tackle. Whether you're an adult/kid that has faced loss or not, the journey of these 2 characters will make you cry and have your heart warmed at the same time.",
      "total_reactions": 0,
      "user": "nanancay"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "A beloved tear-shedding masterpiece, Disney's ever faithful Pixar makes its finest film yet since the Lion King, in a story about promises and a spirit for adventure.",
      "total_reactions": 0,
      "user": "VinceRocks123"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "2nd best Pixar film ever. the charters are great the animation is great the story is decent but still really good. and if you know this movie the 1st 15 so minutes of this film are amazing.",
      "total_reactions": 0,
      "user": "teddyluke"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "\"Up\" is a wonderful film, with characters who are as believable as any characters can be who spend much of their time floating above the rain forests of Venezuela. They have tempers, problems and obsessions. They are cute and goofy, but they aren't cute in the treacly way of little cartoon animals. They're cute in the human way of the animation master Hayao Miyazaki. Two of the three central characters are cranky old men, which is a wonder in this youth-obsessed era. \"Up\" doesn't think all heroes must be young or sweet, although the third important character is a nervy kid.",
      "total_reactions": 0,
      "user": "MovieManiac83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2016
      },
      "score": 10,
      "text": "Pixar makes it either 9½ out of 10 or 10 for 10 with “Up,” a captivating odd-couple adventure that becomes funnier and more exciting as it flies along. Tale of an unlikely journey to uncharted geographic and emotional territory by an old codger and a young explorer could easily have been cloying, but instead proves disarming in its deep reserves of narrative imagination and surprise, as well as its poignant thematic balance of dreams deferred and dreams fulfilled. Lack of overtly fantastical elements might endow “Up” with a somewhat lower initial must-see factor than some summer releases. But like all of Pixar’s features, this one will enjoy a rewardingly long ride in all venues and formats. Pete Docter’s picture has the privilege of being the first animated film to open the Cannes Film Festival, on May 13.",
      "total_reactions": 0,
      "user": "moviemaniacs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "Up was okay not great and certainly not the best Pixar movie EVER! It was extremely overrated and the film started to drag from time to time. It had a predictable ending, and the kid is extremely annoying, who just makes dumb choices a lot of the time. Still a great film for the whole family to watch because it does have some heart, just be cautious that this isn't as good as recent titles like Inside Out, Toy Story, or Finding Nemo. Pixar is a great studio and all, so I will say I enjoyed this film just not as much as other Pixar films.",
      "total_reactions": 0,
      "user": "MadMaxFuryRoad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "Consistent , at first I was not interested , but at the end of the day, I ventured to see it , and it was a wonderful adventure , I sack humor, but also some tears. Touching is much like that touch me like all .",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2015
      },
      "score": 9,
      "text": "I imagine that people must have been skeptical when they saw the trailer for this. An old man who flies off in a house attached to balloons with a kid who got on by accident and meets a talking dog and a weird bird? Must have been a hard idea to pitch. But people-this is Pixar. The movie is a touching and tear inducing masterpiece with a beginning that will break your heart no matter how tough you claim to be. There are a few bothersome things (like how can Muntz be still alive now if he was like, 40 when Carl was 8? ). But if you get past that, you'll love it. It might be a bit deep for small kids, but like most Pixar films, adults will be entertained a lot more than they might expect.",
      "total_reactions": 0,
      "user": "DanBurrito"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "One of the best Pixar movies. I can't believe the imagination of the storywriter! A flying house with thousands of balloons?!? I'd never think something like that. Fabulous.",
      "total_reactions": 0,
      "user": "diegonelli"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "Up Is Amzing Film Animation Is Good Music Is Good Dug,Russell & Kevin Is Funny Action Is Epic Pete Doctor Great Job This Film Win Best Animated Feature On Academy Awards",
      "total_reactions": 0,
      "user": "jrdacosta2002"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2016
      },
      "score": 10,
      "text": "Finally Disney has done a masterpiece movie with full imagination, that is great. Carl and Russell's adventure is really fun, hilarious, dramatic and with a big dream that Mr. Fredickssen had since he met his wife. One of the best animated films of 21st century, it's a masterpiece, the audience will enjoy this so much",
      "total_reactions": 0,
      "user": "DavidTejada"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "Robots, insects, monsters and cars – if it’s got fur, scales or moving parts you can bet Pixar has drawn it.",
      "total_reactions": 0,
      "user": "MovieManiac1994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "WHAT I LIKED: A beautifully cafted emotional tale that's rare to see in the animation genre, 'Up' will make you cry and smile. This is because the chaacters are veru well developed so you're able to really connect",
      "total_reactions": 0,
      "user": "BarneyOnMT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "A grumpy old coot, a chubby kid and a house hoisted by helium balloons — if you're thinking that Up sounds like a shortcut to sugar shock, snap out of it. Pandering to ninnies is not on the agenda for this latest landmark in Pixar animation. With Pete Docter and Bob Peterson sharing the directing and writing, Up is a breathtaking ride into the realm of pure imagination. Up shames the pap that now passes for family entertainment (yes, Night at the Museum 2, I'm talking to you).",
      "total_reactions": 0,
      "user": "FilmMasterEd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2016
      },
      "score": 10,
      "text": "Halarious emotional and even dark by some standards. Up is not afraid to make us bawl our eyes if it is happy tears or sad tears up has a brilliant voice cast and an coming of ages story that will appeal to nearly everyone. We follow an old man named Carl fredrickson who has been grumpy ever sense his wife died. One day a boy named Russel appears at his door step and through a variety of circumstances that will bring them closer than ever together. This movie is a sheer delight and it's no wonder why it won best picture at the academy awards. The voice actor who voices dug is a pure delight and the rest of the cast is too. Up is not only the perfect family movie one of he most perfect movies ever made. It's fun funny sad and even a little dark but underneath it's sometimes heavy narrative its a really excellent kids movie that will go down in history as a classic",
      "total_reactions": 0,
      "user": "nahtan1244"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2016
      },
      "score": 10,
      "text": "Up gives a familiar message, with unforgettable character,ps, inventive story-telling, breathtaking plot and music, this film shows the bad way and the best way of human, with funny and powerfully-parts that entertain the audience of any kind.",
      "total_reactions": 0,
      "user": "Futuredirector"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2016
      },
      "score": 4,
      "text": "The beginning and ending was really god, with lots of humor in between. But, it was like a plane ride with a sturdy takeoff and landing, but loads of turbulence in between. The plot was weird and wonky in this movie. i was so excited for this movie when i got it, but the plot in between was bad. To every movie,  the plot is everything, so it kinda ruined the movie.",
      "total_reactions": 0,
      "user": "Sai_rox"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2016
      },
      "score": 9,
      "text": "Solidly crafted, gorgeously animated, and emotional, Up is a wonderful story that shows children and adults alike the power of friendship, love , and the pursuit of happiness.",
      "total_reactions": 0,
      "user": "Muskrat147"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2016
      },
      "score": 10,
      "text": "Pros: It's funny, heartwarming, heartbreaking, and just fun. The charterers are amazing the story that would most likely suck in any other movie is just amazing and heartwarming",
      "total_reactions": 0,
      "user": "reviewfrom19842"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2016
      },
      "score": 9,
      "text": "This is everything I want from a family movie: extreme sentimentality, beautiful visuals, a moment of wonder, a scattering of laughs, a little bit of excitement and a plot that keeps the kids attention for most of the time. Could do with editing down in the middle to stop me dropping off in the chair, but then I have seen it about 20 times. Up, up and away.",
      "total_reactions": 0,
      "user": "shiftworker"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2017
      },
      "score": 1,
      "text": "Disappointed by the movie. Was expecting much much more. The movie could have been good but there were so many problems with the plots and the overall direction of the movie. The overall execution was terrible and it was a boring mess with not even half way through the movie.",
      "total_reactions": 0,
      "user": "fadithebeast"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2017
      },
      "score": 0,
      "text": "This movie was an utter disappointment for me. The plots were not properly executed, there were many loopholes and the story was boring to be honest. The problem with these commercial films is that their whole purpose is to make money out of amateur movie goers rather than make something that should critically make sense.",
      "total_reactions": 0,
      "user": "ammeoo"
    }
  ]
}