{
  "mc_avg_user_score": 7.4,
  "mc_metascore": 83,
  "mc_mixed_rating_frequency": 66,
  "mc_movie_name": "Up in the Air",
  "mc_negative_rating_frequency": 59,
  "mc_positive_rating_frequency": 346,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "One of my favorite films ever, is amazing, incedible, emotive. And the better... the cast, Anna Kendrick, Vera Farmiga, George Clooney, are amazing. The story can be sad, but the film is fantastic. Up in the Air is a classic.",
      "total_reactions": 2,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "A great movie of a solitary life. Everything in this movie makes me sad and I find it beautiful. George Clooney is back again and he is amazing. The writing is sharp and witty with a fun story about what it's like in the modern society.",
      "total_reactions": 2,
      "user": "Summersausage"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "A really entertaining, good film that definitely make you wonder about the American lifestyle and how good and rewarding (or unrewarding) it actually is. With great direction, screenplay and some really good performances, \"Up in the Air\" manages to make one laugh as well as feel the desperation of Clooney's character. Definitely a film worth watching!",
      "total_reactions": 1,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "Jason Reitman's tale of corporate downsizing is bound to strike a chord with moviegoers in our modern recession and was released at the perfect time. However, unlike most topical films, which tend to slide into obscurity after their time in the limelight, I feel 'Up in the Air' will be remembered as a timeless classic which can really reach out to anyone. All three leads (George Clooney, Vera Farmiga and Anna Kendrick) are breathtaking in their character roles, each carrying a sense of enigma affixed with their own goals and expectations for love and life, and as always each is compromised along the way. The relationship between Clooney and Farmiga has incredible chemistry, and Kendrick's conjunction of professionalism and idealism was handled perfectly (I smell Oscars here....) Though most of the dialogue is infused with the quick wit you can always expect from Reitman films, this movie is really one of the most devastating and heavy films of the year. It perfectly embodies the journey of middle-age angst just as 'Juno' represented the indifference of smart-ass teenagers, but like 'Juno', it may appeal more to the age group it is depicting.",
      "total_reactions": 1,
      "user": "ryancarroll88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Sorry for the traslation, is mechanical.",
      "total_reactions": 1,
      "user": "RONGIU"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "Generally funny, and heartwarming. Up in the Air proves to be Jason Reitman's best since Juno. George Clooney is brilliant as the cut-throat businessman being grounded by his company, while his co-stars Farmiga and Kendrick are also outstanding. The story was definitely interesting and proves to be one of the best films of last year.",
      "total_reactions": 1,
      "user": "shlugalug"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Great movie. I was really pulling for Clooney to win the Oscar but I guess Jeff Bridges finally deserved one. I was pleasantly surprised by Anna Kendrick's performance. I had no idea that anyone from Twilight could actually act but she did a great job. In a way this was a very sad but real movie.",
      "total_reactions": 1,
      "user": "MPVahalik"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "One of the best new movies I've seen in a long time. It met all my expectations. With the charm and comedic sensibilities of Broadcast News, the brutal realism of Glengarry Glen Ross and the humanity of Planes, Trains and Automobiles, this movie is a must-see.",
      "total_reactions": 1,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2013
      },
      "score": 1,
      "text": "How is this movie so well liked? George Clooney and Vera Farmiga's characters are just completey unlikable and the story almost literally goes nowhere. The most interesting character was Zach Galifianakis' character who appears for less then a minute.",
      "total_reactions": 1,
      "user": "Vyras"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "What \"Up in the Air\" wants us to do is not to watch in boredom equipped with popcorn, but to understand the emotion and the characters the movie has to present to us.",
      "total_reactions": 8,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2010
      },
      "score": 4,
      "text": "If you want to see 'George Clooney' play 'George Clooney' then good for you, you'll love this! If you don't want to feel like an unsophisticated plebian while watching these 2 incredibly smug people seeing who has the best comeback I'd recommend a pass, watch Lost in Translation instead, it's much better. Also the feel of this film is like pretentious wannabee Oscar material. in fact pretentious basically sums this movie up. For Smug, high Class idiots really.",
      "total_reactions": 2,
      "user": "NF123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2010
      },
      "score": 4,
      "text": "Seriously? This movie was humorous and all, but the ending was really stupid, I mean, Ryan finally finds a woman, but then it turns out that she was married w/ children?! That's just sad. I was disappointed that I spent, like, 5 dollars on this on VOD on Buckeye, and it sucked! Don't see this movie if you haven't yet...",
      "total_reactions": 2,
      "user": "CoDFather"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2011
      },
      "score": 5,
      "text": "It was a well done movie, but I was bored in the middle of it, so I've left. I watched the other half few days later so. I don't know. It didn't keep my attention. I wouldn't say it was predictable. I thought that George and Vera's character will hook up and get married but it wasn't so. I also like Anna's character and that's all. All together, it was boring. Fans of George Clooney are gonna love it.",
      "total_reactions": 1,
      "user": "TheGorilla"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "This is one of my favorite movies.  George Clooney is an amazing actor, and should have gotten the Oscar.  In fact, this movie should have gotten the Oscar over the Hurt Locker.  It's such a beautiful look into what love and relationships are, without taking a side either way.",
      "total_reactions": 1,
      "user": "Werothegreat"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "The best part of Up in the Air isn't the excellent performances or even the pitch-perfect script, it's how real the movie is, and that comes from Reitman's careful direction.",
      "total_reactions": 1,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Up in the Air is a wonderful film that I've just seen two times already! George Clooney is one my favorite actors of all time and one of the coolest guys ever and he did really good on his performance. Vera Farmiga & Anna Kendrick did their job really supportive and very clever. The scenes are very good like they travel away to United States with great cinematography with each shot of the clouds,cities,and course the entire cast. The story is very interesting way that you see Clooney was traveling to each airport and tells the perfect story about his life that he do all day for working on the company that he fires to everyone in their jobs. I really love this movie of all time and one of the best 2009 films ever! And one of my favorite films in my decade of 2000's.",
      "total_reactions": 0,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "Up in the Air was one of the best movies of 2009. George Clooney gave a great performance and the movie was funny and heartwarming. It managed to do what most movies can't do. Feel real.",
      "total_reactions": 0,
      "user": "Comasi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "Being a minor with not much responsibility other than taking the next test or completing a major homework assignment, I have not really been affected by the downturn of the economy.  I can see how other people are affected by it, but I have not really felt what it is like to lose a job, losing a home, or having no money to my name.",
      "total_reactions": 0,
      "user": "RyanGee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "The best movie of 2009. The characters and events in the film are fairly different from those in the book by Walter Kirn, but I enjoyed both. The main and supporting actors performed really well. Anna Kendrick showed how great she can be. Jason Reitman keeps improving as a director besting Juno, which bested Thank You For Smoking. Great satire.",
      "total_reactions": 0,
      "user": "bone"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2010
      },
      "score": 10,
      "text": "A very entertaining and intriguing story of a man and his peculiar job. I'm not sure how realistic the whole plot was but nevertheless I think the film was able to captivate the audience for the majority of the time. Some parts of the film was pretty humorous but other parts seemed a bit boring and pointless. Still, it was a brilliant performance by Clooney and Kendrick, other actors/actress weren't too bad either. The film generally does well to depict the story of a corporate business expert and maybe a child prodigy, which is a pretty unique experience. This is not a very fast paced film but not too slow and boring either. It is very enjoyable if you have the time to sit back and relax. Probably not suited for people with a small attention span or lack of intelligence. I'd give it 8/10 just put 10 to boost the score as it doesn't reflect how good the film is atm. :P",
      "total_reactions": 0,
      "user": "ProphetOfTruth"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "Up in the Air is a fantastic piece of existential character study. Powered by a masterful performance by George Clooney, the movie hits all the right notes before coming to a subtle yet wrenching conclusion. Excelling in all departments from directing to soundtrack, Up in the Air is a must see.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2010
      },
      "score": 7,
      "text": "Overall I enjoyed this movie and appreciated its complex, all-is-not-black-or-white message. However, I had a few issues with it. For instance, WHO would buy into that \"What's in your backpack\" message? Companies want to create the illusion that they're warm and fuzzy families, and no one would tolerate someone who blatantly told them to fly solo. That sideline plot hit us over the head with a message that we already \"got\" just by observing Clooney. Also, the George Clooney character never seems lonely, sad, or depressed until he learns his lesson about the importance of having a co-pilot. The movie could have done more to make you think he KNEW was missing something in life, because he seemed quite satisfied. But as I said, it's an excellent movie, despite its flaws.",
      "total_reactions": 0,
      "user": "justathoughtabl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "It is a simple and spontaneous movie, but it turns out to be deep and inspirational one. The movie directed by Jason Reitman, the young Director and the son of Ivan Reitman. Ivan Reitman known-well as a Producer and acclaimed Director, through his fun and pop corn movies such as: GHOSTBUSTERS (1984), KINDERGARTEN COP (1990), and EVOLUTION (2001). Flip over with his father, Jason Reitman known-well in these recent years as thoughtful and serious but enjoyable dramas like: THANK YOU FOR SMOKING (2005) and JUNO (2007). The trio Casts in thiz movie fill the characters properly. George Clooney once again shows his talent on the one man show, Clooney is one of the Actors could delivers such character with his aura. Vera Farmiga appears a little bit sexy, charming, and loveable. It is a fantastic flirtatious appearance. Anna Kendricks emerges annoying but acquired sympathy in the end, just fit well on her character. The unique story is about Ryan Bingham (Clooney) who is a frequent flyer across the states. His job is to fire people, representing his boss that did not bold enough to do it himself. Maybe for many people, thiz is a life drama movie. But personally for me, thiz is a great romantic movie with the most of scenes contain with tremendous chemistry between Clooney and Farmiga. It has been a long time I did not have such a feeling since LOST IN TRANSLATION (2003). In the end, The movie was convincing us that we need a partner in life. It is ironically played by life-time bachelor Clooney (in the real life-at least until now). Yup, maybe that is true, Everybody needs a co-pilot.",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "Good movie. It was a great display of life as some one who's always travels for there company. I think this was a good role for George Clooney and he did a great job.",
      "total_reactions": 0,
      "user": "TBDOPEY22"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2011
      },
      "score": 9,
      "text": "Up in the air was witty and funny.  It's a story about a man who doesn't realize how lonely he really his and how he changes as a person throughout the movie.  Not to mention George Clooney was outstanding, he fit the role perfectly.",
      "total_reactions": 0,
      "user": "bottafff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "A mature comedy-drama for adults with a really neat twist at the end.  All the principle actors are really fine and the direction is right on, with a first rate screenplay and dialog.  One of my favorites and one of George Clooney's best.",
      "total_reactions": 0,
      "user": "s053714"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2011
      },
      "score": 9,
      "text": "Up in the Air is a movie that I found myself relating to on many levels and its impact I found personal, something that is missing from most movies. The characters are very real, the theme of how boring everyday life can be is interesting and the 3rd act of the film is awesome and memorable. The interviews and theme of people losing their jobs seems relevant on one hand but a little forced and disconnected to the main plot but its only a minor gripe. Up In The Air is great and a must see. Highly recommended.",
      "total_reactions": 0,
      "user": "davenbettridge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "I don't really like this kind of romantic films but this time I kinda liked it. Liked the acting performances but imo George Clooney's role was pathetic. I really appreciated the lack of happy-ending.",
      "total_reactions": 0,
      "user": "island"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "\"Up In The Air\" One Line Review! \"A-\"",
      "total_reactions": 0,
      "user": "LevelsAndGear"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "Good little film, not the funniest or most dramatic film ive ever seen but well acted, directed and shot with a good script and likeable characters who make you want to see more of them after the credits have rolled. Having said that, my wife hated it and fell asleep before the end!",
      "total_reactions": 0,
      "user": "paulyh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "Billed to me as a comedy, Up in the Air is much more than that.  It's an emotionally moving and laugh-inducing drama with stellar acting from George Clooney.  The premise is so sarcastically dry, as is Clooney's character, that by itself it invokes a few laughs.  Add to that some surprisingly dark themes towards the ending and it becomes complete in every possible way.",
      "total_reactions": 0,
      "user": "CRL"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2012
      },
      "score": 7,
      "text": "Although marketed and advertised as a comedy-drama film, this movie truthfully skimps on the laughs but redeems itself in the dramatic sense. However there are so many different themes in 'Up in the Air' one could be forgiven in thinking the flick (in itself) is a self-motivational handout. Sadly some are left unanswered. Despite that George Clooney is excellently cast in the lead which matches his public persona of being quite charming but the standout has to be Vera Farmiga; a desirable choice for Clooney's love interest.",
      "total_reactions": 0,
      "user": "eTurkey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "I really liked this movie. Solid acting by the cast, An interesting plot, and overall its just a solid film that I really enjoyed watching. Im suprised that the fans dont like it more but hey, I guess its not for everyone. But to me, Its definently worth the watch.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "A truly enjoyable movie from start to finish. makes you ponder abt your life and future. A compelling performance from the cast. Good storyline combined with powerful cast and amazing direction and cinematography of the movie. what more can i ask for?",
      "total_reactions": 0,
      "user": "Boozerx7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2014
      },
      "score": 9,
      "text": "Jason Reitman + George Clooney + Vera Farmiga + Anna Kendrick = cinematic perfection. Smart and bold. You know it's good when you begin to question your own life.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2013
      },
      "score": 3,
      "text": "Up in the Air is a film that is tiresome and worthless, with characters I didn't like one bit. What fascinates me the most is how this film can put someone to sleep faster than a lullaby. A pointless dull film.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "A very boring film. The acting is overpraised so much that it is ridiculous. The critics are so wrong. Everything about it, had nothing new to offer. This movie even makes me more sick of George than I already am.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "Up in the Air continued Jason Reitman's early hot streak before his more recent missteps and though I prefer Thank You for Smoking and Juno, Up in the Air is still a good film. With a great emotional center and theories on loneliness, happiness, marriage, and purpose in life, the film has a lot to say throughout. The writing is spectacular as is the direction and when the characters feel hurt, so does the audience. This is largely thanks to the great acting from George Clooney, Anna Kendrick, and Vera Farmiga. However, the true success of the film comes from how real it all feels. It never feels fake and it almost feels as though you are watching a documentary about these regular people. In addition, it was very timely with its release, as it focuses on a guy who fires people for a living and came out in 2009. On the topic of starting over, the film does a very good job and portrays these people with a lot of compassion and honesty. Overall, Up in the Air is a very good film that has a great emotional center that makes it really hit home for people of all ages and features Anna Kendrick's breakout performance, which really stole the show.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "I think the critics went slightly overboard when reviewing this film. It is a good film which is funny in places but at times it seems far too stuck up itself to realise when it is waning from the plot. Reitman continues to produce good films but this is not his best work as some would have you believe.",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "Just a terrific film! An honest picture of charming, but flawed, people. Perfectly acted by George Clooney, Vera Farmiga, and Anna Kendrick. Brilliant script, brilliant film!",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "The movie's subtle thematic plot, at first, confuses and leaves the audience with a hollow, unfulfilled catharsis at the end.........................................",
      "total_reactions": 0,
      "user": "dollarsign"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "I gave this a 9 before, but I'm going to lower my score now for a few reasons.  There are spots in this movie that are somewhat un-engaging and boring.  These scenes are at odds with the rest of the movie which is entertaining, lively, and sharply directed by Reitman.  The dialogue is realistic, the performances are believable, and there are even some unexpected turns.  From a filmmaking standpoint the movie is almost flawless.  It's just that the audience for this film is somewhat limited.  It's being called a comedy, but it's really a straightforward drama.  It's not really even a hybrid of the two like Reitman's own Juno or Silver Linings Playbook.  It might not be funny, but I'd still take this over the cliché crap that usually comes out of this genre.",
      "total_reactions": 0,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "I really really enjoyed this movie. It was bitter sweet in a wonderful way. The story flowed nicely and Clooney's character suited him extremely well. It doesn't end in the happiest ending but that is what makes it a good movie. I would definitely recommend this movie to anybody.",
      "total_reactions": 0,
      "user": "sammietee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "Slickly rendered and intelligently scripted, offering a deft mixture of comedy and pathos, \"Up in the Air\" is entertaining but also painstakingly grounded in reality, seamlessly entwining humor with an existentially bleak edge that this troubled era of downsizing and recession makes all the more meaningful and relevant.",
      "total_reactions": 0,
      "user": "BloodMeridian85"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "Run away if you see Clooney in a suit next time.",
      "total_reactions": 0,
      "user": "manuprathap"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "text": "Have just seen this - though I like GC I CANNOT understand how it got such rave reviews. This film is absolutely crap. Characters whilst well played are unsympathetic, the story goes nowhere - got to the end wondering what was the point of this film? There is none in fact .... I don't need happy endings but I would like an ending - did the writer run out of ideas? Sorry just rubbish",
      "total_reactions": 0,
      "user": "catsy11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "it's really a great movie except when Anna Kendrick cried when her boyfriend broke up with her via text it was obvious that she was trying to fake it.",
      "total_reactions": 0,
      "user": "pajamatime"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2015
      },
      "score": 1,
      "text": "i can't see how this movie could end or how i let it start........anna kendrick firing people is exactly what terrible people would want to see......no matter how much she looks good it just can't save the movie from being fired over the internet by me....the only redeemable thing is that she was called a fourth grader......im so glad anna kendrick died in the voices that I might actually go watch it.......being without a job is hard enough without having to see women get jobs with their looks (kendrick) or showing their butt (farmiga) ....i think if a film buff  watches this movie twice it's because boredom and loneliness ......",
      "total_reactions": 0,
      "user": "CameraBounceGod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "As I see George Clooney star in more and more typical white collar men in mid-life crises, I start to appreciate those films that manage to be enchanting without a big shot actor stealing the spotlight. With that said, Up In the Air did feel new. The planes may use recycled air, but when I saw Des Moines light up on the screen, I took a gasp of fresh air.",
      "total_reactions": 0,
      "user": "hanneguacamole"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2015
      },
      "score": 7,
      "text": "Up in the Air is definitely not a bad film, but it's not a good one. The first act is great, all the characters are likeable, the story is entertaining and fun, but then comes the second act, and it feels like the wedding is sidetracking the film from the point of the first half of the film  and after that the whole movie feels lost. And I honestly understand the message it was trying to convey and the whole point of the story, but it just felt shallow, like it was barely scratching the surface of it's full potential. And even if there is a good point or an intelligent story the film has to be at least entertaining in it's entirety. Up in the Air is definitely overrated, in almost every aspect, except acting maybe, it's flawed, but not in a imperfectly perfect way, more in a wounded unrepairable way.",
      "total_reactions": 0,
      "user": "MateusShields"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "Even though the film finally turns out to be yet another Hollywood fairy tale, at least it speaks the truth about our Great Recession.",
      "total_reactions": 0,
      "user": "avamiller21"
    }
  ]
}