{
  "mc_avg_user_score": 5.8,
  "mc_metascore": 30,
  "mc_mixed_rating_frequency": 21,
  "mc_movie_name": "Vampire Academy",
  "mc_negative_rating_frequency": 44,
  "mc_positive_rating_frequency": 63,
  "mc_pro_critic_reviews": [
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2014
      },
      "score": 70,
      "summary": "For smart, strong girls and the guys who like them, Vampire Academy will hit a vein."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2014
      },
      "score": 60,
      "summary": "The supernatural fight scenes are cheesy and cheap, but this movie is less about epic brawls and more about a headmistress in fabulous dresses, secret meetings with brooding boys in the library, sexualized fang pokes and making wisenheimer comments during prophetic visions."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2014
      },
      "score": 50,
      "summary": "What is surprising is that while the patchwork whole creaks terribly in places, the parts also show signs of life."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2014
      },
      "score": 50,
      "summary": "If you're not at the bull's-eye center of the target audience, a movie like this one can suck the life out of you."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2014
      },
      "score": 50,
      "summary": "Tedious as all this vampire exposition is (and there’s a LOT), the jokey tone here is much appreciated, with everyone “a few corpuscles shy of an artery” and the action as predictable as “a porcupine in a hot tub.”"
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2014
      },
      "score": 40,
      "summary": "It’s not a complete disaster, but even the appearance of Gabriel Byrne, as Lissa’s uncle Victor, fails to make much of a dent in the slapdash proceedings."
    },
    {
      "critic": "Keith Phipps",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2014
      },
      "score": 40,
      "summary": "Fans of the books might enjoy seeing their world brought to life, but most everyone else will likely leave feeling as if they’ve just completed a seminar on vampire lore, and they’re likely to fail any pop quiz that follows."
    },
    {
      "critic": "Randy Cordova",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2014
      },
      "score": 30,
      "summary": "The film is based on a popular series of young-adult books (big surprise), but one figures only die-hard fans will enjoy the result. The movie is slow-witted and moves at a glacial pace."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2014
      },
      "score": 30,
      "summary": "A film as soul-sucking as any of the fang-baring bores who populate it."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2014
      },
      "score": 25,
      "summary": "Despite such attractions as Gabriel Byrne as a vampire with a skin disease and a décor that combines Hogwarts with “Suspiria,” the only lesson learned here is that Hollywood needs fresh blood."
    },
    {
      "critic": "Kevin McFarland",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2014
      },
      "score": 25,
      "summary": "Vampire Academy is toothless in both substance and style."
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2014
      },
      "score": 25,
      "summary": "The only thing that distinguishes this teen-magnet wannabe from its predecessors is how lazily it appears to have been slapped together."
    },
    {
      "critic": "Dennis Harvey",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2014
      },
      "score": 20,
      "summary": "Mead’s six Vampire Academy books (there’s also an ongoing spinoff series, “Bloodlines”) are relatively brainy and complex within their young-adult subgenre, but their virtues have been reduced to a derivative hash here."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2014
      },
      "score": 0,
      "summary": "One idea, mixed with lame jokes, and stretched beyond coherence. Vampire Academy doesn't need a review. It needs a stake in the heart."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2014
      },
      "score": 9,
      "text": "Overall a very enjoyable experience.  The beginning of the movie is full of a lot of exposition, but once the backstory is laid out the movie becomes a witty and enjoyable ride to the end.  Zoey Deutch stands out in particular as Rose, blending her wit with action.",
      "total_reactions": 2,
      "user": "silferret"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 2,
        "year": 2014
      },
      "score": 5,
      "text": "The trailer (and director Mark Waters) would have you believe that this is a cruel high school comedy in the vein of \"Mean Girls,\" but it's the combo of \"Twilight' and Harry Potter with liberal helpings of teenage crushes and  bloodsucker battles. It revolves around 2 best friends (one a vampire and one her protector) who face all manner of challenges at the special school for their kind. All 3 of the funny lines are in the trailer. The rest is a mediocre blend of romance, magic and mystery. It never drags, but doesn't soar either. Young female fans of the book might enjoy it.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2014
      },
      "score": 4,
      "text": "Very disappointing and chalked full of missed opportunity's and untapped potential. In theory this movie did everything right \"sorta\" they got a great director, the source material is very good and they cast in my opinion a very strong cast well suited for the roles. I do love mark waters and on the surface this movie was perfect for him a story about girls in a high school with vampires its not his fault for making the movie the way he does best it just wasn't the right movie for him. The things that make the book series so successful are the relationships between the characters and we didn't see enough of that due to the god awful pacing and the inner struggle and resilience of rose along with her determination to protect Lissa and that just never really came across. Did it fallow the plot points of the book sort of but it glossed over what should have been the focus the emotion and turmoil instead of the snarky remarks and attempts at memorable one liners none of witch i remember. It is that turmoil and relationship of rose and Lissa that makes it different from twilight or harry potter not making a twilight joke.",
      "total_reactions": 1,
      "user": "TannerSoetaert"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Okay just be glad that we didn't not get another mediocre version of twilight, but no we get get a mediocrity version of  'Mean Girls: vampire style' the story about the \"academy\" feels like Harry Potter. Screenwriter  Daniel Waters and Director Mark Waters did not even the read the book by Richelle Mead (Author of \"Bloodlines\" series). Basically their making excuses to make a different story with the same characters but they a whole  lot of comparison from the Mean Girls characters. However i was entertained by the story also the mythology of  Vampire in Mead's world. The characters Lissa was an underdeveloped character played by actress  Lucy Fry. Speaking the cast their all terrible actors, some can act i guess? But i will read the series! Grade C+",
      "total_reactions": 1,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "text": "I never write reviews but I actually made an account just to say how disappointing this movie is. It felt like a very low budget movie, with the typical cringe worthy humor you always get in these teen chick flicks. I read the books when I was younger, waited eagerly for the next, I was completely hooked. I enjoyed them so much so finding out they had finally made a movie adaptation was really exciting, as I long awaited one at the time. It feels a lot more childish than the books, I would say to anyone read them before you watch the movie, or at least don't get a bad idea from this. The entire thing just felt very rushed, choppy, low budget and in all honesty... quite trashy. Highly disappointed.",
      "total_reactions": 1,
      "user": "Keziah"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2014
      },
      "score": 9,
      "text": "I really liked this movie. Very true to the books, including some of my favorite dialogue scenes. Where there some changes? Yes, but they only enhanced the over all movie. This one is so much better than its ads. Check out my full thoughts here: http://www.tickettoanywhere.net/2014/02/movie-thoughts-vampire-academy.html",
      "total_reactions": 4,
      "user": "Irisheyz77"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2014
      },
      "score": 3,
      "text": "Badly written script, poorly paced, mish-mash of non-connecting bits and pieces with no segues. It knows it's just another crappy high school film, but it tries to be smarter than it really is, with several references to 80s films that it's target audience isn't going to recognise, and those who do recognise them won't care.",
      "total_reactions": 3,
      "user": "evanrm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2014
      },
      "score": 9,
      "text": "I think that the movie had a lot of attitude and a good background story, although in the future I hope to see the movies in a much more serious light because the story truly is amazing. This movie was definitely hilarious though and I think that made it fun to watch.",
      "total_reactions": 3,
      "user": "avaterzy"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "good enough with the book's plot . i believe in the second film they'll do a lot better ,and can't wait to see another character like Andrian and Sydney",
      "total_reactions": 8,
      "user": "will0002"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "As someone who read and LOVED the books, it stayed very true to the book's plot, but with some details changed to make it more action-packed in a very good way. The only thing I disliked was that Lissa's and Christian's personalities were different. Lissa wasn't as timid and Christian wasn't as sardonic and angry. I imagine in the eyes of someone who didn't read the books or much about the movie prior to seeing it, the biggest issue you will have is the pace and information overload. The only thing I thing that would have made it better were (as a book reader) fixing Christian's and Lissa's personalities and the fast-pace. I think it would have been worth it for them to have gone from 1 hour 40 minutes to 2 hours by using that extra 20 minutes to slow it down for everyone so the jokes and information could settle in the audience.",
      "total_reactions": 14,
      "user": "AmyLeeCurtis"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "if you have not gone to see vampire academy yet, you do not know what your missing. this movie is amazing, and i encourage everyone to go support it! loved it!!!",
      "total_reactions": 8,
      "user": "kate1901"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "Amazing movie! Go see it if you haven't already. Very similar to the book. I'm really happy with how it turned out! I'm looking forward to the sequel!!! Loved Loved Loved it!",
      "total_reactions": 8,
      "user": "thea06"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "This is the best possible movie adaptation for Vampire Academy book. Mark Waters and Daniel Waters did a great job in turning the pages onto the screen. Not only will it satisfy the fans of the series but also the movie-goers.",
      "total_reactions": 4,
      "user": "Jothee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "Older, mature audiences probably won't enjoy it, stick to the 'oscar' films. But for the age brackets it is actually meant for, (young adult/ teen), it is perfect! I thought it was great and had a deep back story that made it worth a second one! Highly recommend.",
      "total_reactions": 2,
      "user": "moonsicle"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2014
      },
      "score": 0,
      "text": "this is the kind of movie you take your kids to see to punish them for something bad they did.",
      "total_reactions": 5,
      "user": "brimdunkleton"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "I thought that this movie was ABSOLUTELY AMAZING. Not only did they stay SO SO SO close to the book.. everything they added made is so much more! Go see this movie and I promise you will love it!",
      "total_reactions": 5,
      "user": "adenamelia"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2014
      },
      "score": 10,
      "text": "I haven't watched the movie yet, but the book's are great (10/10) and comparing VA with twilight and harry potter is ridiculous, because VA has a completely different storyline and i also saw trailers for VA and it doesn't seem that bad, ill give it a try. :)",
      "total_reactions": 6,
      "user": "Sandra007"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "Best movie, everyone should watch it right now. The plot is so different from the usual vampire stories there are nowadays, and there is no similarity between Twilight and VA, it's worth it watch it this weekend.",
      "total_reactions": 3,
      "user": "whoislally"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "The acting in this movie is great...for every character! The characters are just as I pictured them in the books. Dimitri is delicious, and Rose is just the right amount of cute, funny, sarcastic, and guardian. Only criticism is that they did a poor job of marketing the movie. The trailer sucks. The acting is so much better than in Twilight  or Harry Potter (both films had excellent acting, and some very amateur acting). You don't have to have read the books to understand what's going on (not true in HP or Twilight). Can't wait for the sequel(s).",
      "total_reactions": 3,
      "user": "slmUSA"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2014
      },
      "score": 0,
      "text": "Anothe more vampire movie... but any of them was thid bad.",
      "total_reactions": 8,
      "user": "feliperodx"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2014
      },
      "score": 2,
      "text": "Ok so I am a huge fan of the books but, this movie was a disaster! It's like they ripped the first book in the series in half, picked every boring part in that half to place in the movie then, decided to leave out an important character in the series (Adrian) and to top it all off let's throw some cheesy/crappy humor in there and end the movie when things are actually going to get interesting. A serious fail considering how great the books were and, considering the director.",
      "total_reactions": 10,
      "user": "dm1989"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "It was amazing! If you liked the book, then you really should see the movie! It was amazing. It's funny, full of action with a little bit of romance. You should give it a chance, you'll love it!",
      "total_reactions": 5,
      "user": "diiille"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2014
      },
      "score": 5,
      "text": "It all plays out with lots of carnage, a bit of hooking-up and a final plea to end the high school obsession with \"gossip, snobbiness and slut-shaming.\" I can imagine \"Vampire Academy\" being moderately enjoyable for moviegoers who have already read the book and would like to see the places and people they have envisioned, but the rest of us are better off matriculating elsewhere.",
      "total_reactions": 7,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2014
      },
      "score": 2,
      "text": "I would consider myself among the very narrow target audience of this movie. I dig sci-fi, monster mythology (vampires, werewolves, etc.), and I am a fan of the lead actress who was great in a smaller role in \"Ringer.\"  It's just that the material - the story - is so flat and devoid of any pulse whatsoever. It's really a shame.  The trailer makes it look fun in the way that Buffy was fun.  Nope.",
      "total_reactions": 1,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2014
      },
      "score": 4,
      "text": "Maybe fang fangs just drink the kool-aid watching another disappointing YA novel based movie. Last Year, every YA movie (except Catching Fire) were not very good but at least I could read a little bit more about these books. Beautiful Creatures, The Host, The Mortal Instruments: City of Bones and Ender's Game all failed to find an audience and reviews were numb. Vampire Academy should be the next one to suffer because I really love the book series rather than watching a Mean Girls-like chick flick about two teenage students trying to find hidden secrets and dangerous paths of the Academy. The real problem was that it just wanted their attention and then fans just skipped the movie and see The LEGO Movie instead. Vampire Academy is pretty much the same and it has a tedious script, poor acting, make absolutely no sense to what the film is about (just in case you've already spend some time shopping at the mall). Wait a minute, is this the first movie from the director who jumpstart Mean Girls into a recipe for success? Yes, but that doesn't mean you want to make another one of the \"Twilight\" rip-offs. Fans could really enjoy the movie as often as they like, but I think Vampire Academy is one of the most disappointing movies of 2014.",
      "total_reactions": 2,
      "user": "Kadeemluvmusic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2014
      },
      "score": 5,
      "text": "It's a typical \"Twilight\" style book to film movie. It's bad to the point where its laughable. \"Vampire Academy\" is a movie that knows what it is, but doesn't execute anything that tries even in the slightest to become a unique book to film adaptation. Overall, it's a typical \"Twilight\" movie, but without all the \"Twilight\" absurd creepiness. I give this a C!",
      "total_reactions": 2,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2014
      },
      "score": 2,
      "text": "Sucks!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Waste of time and money!",
      "total_reactions": 1,
      "user": "Ilovethemmovies"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 2,
        "year": 2014
      },
      "score": 1,
      "text": "Vampire Academy is another bad Vampire film based on a book",
      "total_reactions": 2,
      "user": "MKSauceLOL"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2014
      },
      "score": 4,
      "text": "It is an alright movie. Nothing to special about it and nothing really stands out about this movie. It is just another vampire movie that everyone will forget about in a few years.",
      "total_reactions": 1,
      "user": "MissDrae"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "As I have read the book my opinion is bias but I really enjoyed the movie. It's a shame that it flopped because it had potential but the key issue with the film is that I am not sure who they were trying to market this movie to. Honestly if I hadn't read the book I don't think I would have watched it. They have tried to recreate a Mean Girls style film which is fine because the books are about high school drama but I don't think they sold it to anyone with the trailers and this approach. They would have been better of attempting to go darker as that is the recent trends. Despite this the film is very enjoyable and if you are a fan of Mean Girls and/ or vampires this movie has you covered.",
      "total_reactions": 0,
      "user": "giulimiana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2014
      },
      "score": 4,
      "text": "Is it bad?  Sure?  Is it entertaining?  In a paint-by-the-numbers kind of way.  You should know what it is and who it's aimed at before you see it to avoid disappointment.  Average mental age target I would estimate is ten to fourteen.",
      "total_reactions": 0,
      "user": "psyberdelic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "Uma bosta. Amei de paixão.LALALALALDKLASLFKJJKSJRHKRJKHJKRHJKGRHJKJKRHJHA AMOOOOOOOORTOROTROTOROTROTOROHOFJOGOJGHOJOGHOJOGHJOGHOJOHGJOGOHJOGHOJGHOJOGHU ROSA E DIMITRO EU SHIPPO",
      "total_reactions": 0,
      "user": "Flora148"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "Despite what some people have been saying about vampire academy being a cheesy twisted version of \"Mean girls & Twilight\",I watched it and to my utter astonishment I loved the movie. I did enjoy every little turn out of the events even though I've read the books first. Normally I would always prefer the books to the movies but this one is exceptional I guess. I don't think it's just another cheesy vampire movie neither it is a twisted version of mean girls. It's totally different. Yeah maybe the trailer represented a twisted version of the movie but if you take a leap of faith and watch it, I'm pretty sure you'll like it. The characters were just perfect. I don't know why some people are **** about Zoey playing Rose and Danila playing Dimitri cause they were just incredible. You can see how hard they'd worked for their roles cause every little detail of the book matches. Sure it's not going to be everything like the books you have imagined to be but if you already know everything then what's the fun in that? And trust me when I say, you will not regret watching this movie even if you haven't read the books first cause it's just that incredible. And to some \"any kind of vampire movie haters\" Please don't compare it to Twilight cause it's nothing like that. Like a famous person once said, \"Don't judge the book by its cover\" I'm telling you not to judge the movie by its trailers. Watch it and then regret if you want to but don't do the other way around. The plots were perfect, there was humor, romance and action - All in one movie. I'm looking forward to watch the other sequels of this series so please stop **** and let them make other movie versions of the books. Don't spoil this for the people who have actually enjoyed the movie and are eager to watch the next part. Hell some of you have sat through the whole twilight series, so why can't you show a little bit support on \"Vampire academy\" which by the way is so much better than other typical vampire movies (no offense). And some of you people are complaining about the age thing, well you have the read the books right? So yeah the age gap is supposed to be noticeable. I don't think anyone could've done a better role than the actors and actresses of this movie themselves.",
      "total_reactions": 0,
      "user": "safura"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "This movie will only work for you if you're interested in vampires, and aren't looking for something serious(at all), it's more for a teenage audience as it presents the story of two teenage girls, and it doesn't go into a deep plot either, or explaining things in detail(like why are the \"bad vampires\" bad in the first place and what they have against the other vampires), It seems to have more in common with Harry Potter, since vampires in this movie use magic.",
      "total_reactions": 0,
      "user": "Unurautare"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2014
      },
      "score": 1,
      "text": "This movie sucks. It was terrible and boring as hell. Acting was lame, everything looks very rushed and you have to be careful not to fall into plot holes.",
      "total_reactions": 0,
      "user": "Venomq7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 7,
        "year": 2014
      },
      "score": 2,
      "text": "The only good thing about this moovie is the ending, its bad from beginning to ending. They just throw us characters without even introducing us and expect us to like them ''becaues of yes''.",
      "total_reactions": 0,
      "user": "SrEnder"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2014
      },
      "score": 3,
      "text": "I love the books. I was disappointed when I seen this movie. I wish they would stick to the book as much as possible, because after all, that's why your making the movie in the first place because so many people loved the books. I didn't like the characters that were picked either. Overall it's a thumbs down for me.",
      "total_reactions": 0,
      "user": "gregory109"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "Vampire Academy makes mistakes, but after all, what movie doesn't? Noticed by the critics or the audience? Vampire Academy is a good movie, unfortunately the new critics only like blockbuster movies full of special effects, but when people made ​​a small films like this, is not very well liked, but after all, VA is a film that deserves to be seen. Zoey Deutch makes a great role.",
      "total_reactions": 0,
      "user": "LucasFelipe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "Le meilleure des films meme il dépasse twilight à mes yeux malgrès le début de l'echec il m'érite une suite  !!! les réalisateur devrait trouver un moyen un film sans suite est totalement nul !!! . déçus de pas avoir de suite vraiment !",
      "total_reactions": 0,
      "user": "magalieP"
    }
  ]
}