{
  "mc_avg_user_score": 1.5,
  "mc_metascore": 17,
  "mc_mixed_rating_frequency": 6,
  "mc_movie_name": "Vice",
  "mc_negative_rating_frequency": 54,
  "mc_positive_rating_frequency": 6,
  "mc_pro_critic_reviews": [
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2015
      },
      "score": 50,
      "summary": "An intriguing sci-fi thriller, but in the end it doesn’t do enough with its ideas."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 50,
      "summary": "Bad doesn’t have to mean boring. Case in point: Vice, a bargain-bin high-concept sci-fi thriller full of Joel Schumacher-esque canted Steadicam moves, leaden expository dialogue, and cheap fluorescents-glued-to-the-wall sets."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 38,
      "summary": "A loud, dopey chase film filled with substandard shootouts."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2015
      },
      "score": 38,
      "summary": "Vice is a low-budget sci-fi thriller that borrows heavily from “Blade Runner” and “Westworld,” and serves as an answer to the question “How much movie can you get when you shoot your $10 million film in Mobile, Alabama? The answer is, quite a lot — with modernist buildings, striking control room sets and the city’s docks serving as a backdrop."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2015
      },
      "score": 33,
      "summary": "Everything about Vice feels like recycled goods. It's basically \"Westworld\" meets \"Blade Runner\" programmed by glitchy filmmaking replicators."
    },
    {
      "critic": "Chris Packham",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2015
      },
      "score": 30,
      "summary": "The film unspools with a momentum that mitigates its artless brutality, kinda, but it's a high-pressure firehose of stupid."
    },
    {
      "critic": "Brian Tallerico",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2015
      },
      "score": 25,
      "summary": "Some will dismiss it by saying it’s so ineffective as to never really aggravate critical faculties, but that doesn’t mean it’s not a complete waste of time and talent as well."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2015
      },
      "score": 20,
      "summary": "Conveying zero grit, atmosphere or texture (exterior shots are repetitively bathed in cobalt blue), and gathering little in the way of force or dramatic momentum, “Vice” barely engages with its potential ideas beyond the most blandly expository, bullet-ridden level."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2015
      },
      "score": 20,
      "summary": "Perhaps aware of how little its audience might pay attention to anything not running, fired off or blown up, the movie's characters explain themselves regularly. Willis, meanwhile, mutters his executive-suite-villain lines as if he's afraid of waking you."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 20,
      "summary": "Perversely low-budget and oddly devoid of imagination, Vice seems less like a proper film than a bargain-basement SyFy pilot, shot on the cheap and drafting off Willis and Jane’s star power. It’s about androids aching to be real, but it doesn’t have an ounce of genuine humanity in its tin heart."
    },
    {
      "critic": "Clayton Dillard",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2015
      },
      "score": 12,
      "summary": "Vice takes the basic premise from 1973's Westworld and morphs it into an incoherent slog."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "summary": "Evidencing more bullets than brains, Vice — a bit of ephemeral science-fiction twaddle directed by Brian A. Miller — has absolutely nothing to recommend it."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "summary": "Here’s hoping Bruce Willis bought something special with whatever cash he earned from this pointless, brutally ugly rehash of 1973’s “Westworld.”"
    },
    {
      "critic": "Oktay Ege Kozak",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "summary": "Dull and lifeless, Vice fails on the promise of even its lowest ambitions."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "Bruce Willis used to be an actor, whose movies used to do well and entertain. He was a class actor. But after A Good Day To Die Hard, my expectations lowered down to all time low. And then came The Prince, a boring, rubbish and badly acted thriller that he dropped last year. Now, the same director- Brian Miller brings us another anomaly of cars, explosions and cheesy acting in a low budget thriller. Willis just makes movies for pay checks now. Vice, okay, I totally lost the subject this movie is giving, because it's a remake of a classic thriller- Westworld, which was a million times better. But anyway, Story? There was a story? I got lost in the badly written script! There is Thomas Jane, at his ultimate worse, as a cop who wants shut down Bruce Willis's resort in which all crime is legal and you can do girls.. And stuff. Amber Childers doesn't know how to act because even if she did, the horrible plot, and writing will wither with her acting anyway. Bruce Willis is not even there, snippets of him are show for like 30 minutes. So really he is like an extra. It's just Jane and Childers throuought the movie. It's not even a Bruce Willis movie. A Goddamn bad one. There is a lot of stupendous action and violence throuought that could have lowered down to explain more. The climax is really nothing. Miller never explores his characters and the confusing climax falls. With a million dollar budget, Vice looks better than other low budget movies, but nothing more. It's like a project made by a group of teenagers and their handycam and their sick imagination of sex, crime and violence. Ignore Vice.",
      "total_reactions": 4,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2015
      },
      "score": 1,
      "text": "Very slow, anemic acting, from the moment this  thing started it wasn't interesting, the plot is just rubbish and the concept of the movie that people created AI people is just stupid.",
      "total_reactions": 4,
      "user": "ozzsoffy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "Это что-то невероятно плохое. Некий гость из времен бума видеокассет 90-х. И как только Брюса угораздило в этом сняться. Что-то писать еще об этом бессмысленно.",
      "total_reactions": 4,
      "user": "AndyDune"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2015
      },
      "score": 0,
      "text": "I'm starting to think Bruce Willis has reached that point in his career when he will just do anything for money. To me, that's quite sad to see a legend of the cinema down on their knees.",
      "total_reactions": 4,
      "user": "loudross"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "\"Westworld\" with better robots and costuming.",
      "total_reactions": 4,
      "user": "tvnewsguido"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 3,
      "text": "I was expecting more out of Vice. Script is bad and directoring was worse. I mean no one gun could hit the side of a barn from inside and I'm tired of seeing Bruce Willis playing the bad guy.",
      "total_reactions": 4,
      "user": "kf62w6"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2015
      },
      "score": 4,
      "text": "The movie starts out quite good and interesting (apart from that first scene with really bad acting, but I suppose it was meant that way), the idea at first is good - about a world where you can do everything you want without no consequences. But afterwards, the story and everything just starts it's downfall and ending at some parts doesn't even make sense. I mean real people get shot just because some want to help robots or so called artificials who can be rebooted. Doesn't really make sense. Bruce Willis is there, but he doesn't bring anything to his movie. I wouldn't treat this as a movie where he is a main cast, as he actually appears only doing the same things over and over again basically. Story has many loops etc. Plus what I hated the most was how bad was the gun shooting, I mean not hitting anyone all the time, I get it that it's Hollywood but this was too unreallistic. I do not think that this is a complete waste of time as you can watch it if you don't have anything else to do and want to watch some action type of movie which at first seems a bit sci-fi but it really isn't.I can't give it a lower rating because I didn't feel like it's a complete garbage and it was watchable.",
      "total_reactions": 2,
      "user": "Ralfbergs"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "I thought the actors were decent in there roles. A lot of shootouts but entertaining. Full of stunts, action, a few references to other films, but that happens a lot in today's Hollywood. The film is violent ,but that is the alternative life style that the people go there for. Overall I was not disappointed.",
      "total_reactions": 5,
      "user": "Waxon"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2015
      },
      "score": 9,
      "text": "Even with Willis - who looks like he was only needed for a day's filming - phoning it in, in every conceivable way, it still manages to be a hell of a lot of fun.",
      "total_reactions": 1,
      "user": "james417"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 10,
        "year": 2015
      },
      "score": 7,
      "text": "Great concept but very weak script, one time watch and not as bad as everyone says it is.",
      "total_reactions": 1,
      "user": "jigsmode31"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2015
      },
      "score": 7,
      "text": "Great concept but very weak script, one time watch and not as bad as everyone says it is.",
      "total_reactions": 1,
      "user": "jinannn31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2015
      },
      "score": 5,
      "text": "I'm glad there're others that share my opinion that this movie contains some merits.  Is that a recommendation?  Sadly, NO!  I do like the 'Westworld' / 'Grand Theft Auto' nod, and if we had not seen countless other sci-fi movies that expanded upon the original concepts which gave us \"modern sci-fi,\" this movie might be a bit more appreciated.  I think the seemingly low production budget helped, since rather than portraying a billion dollar facility complete with holograms, white rooms, and marble toilets, the company in this movie looked like they were really trying to make a buck.  The BEST theme in this movie is wether or or not I should care about the \"replicants\" and wether or not I should care about this movie!  I appreciate it when movies don't \"explain\" things and just let them play out, and this movie pulls that off in some aspects, but also is guilty of one of the worst \"explanation scenes\" ever (I guess if you have not watched about 100 years worth of sci-fi over a period of about 40 years, you might need an explanation or two, though...).  Ever since working on a script or two, I have been unable to view movies without asking myself and others; \"Could you do better?\"  This movie is an anomoly that somehow pulled me through to the end.  If you step back from the thousands of actions scenes you have seen, and realize that people CAN be really bad shots in real life, the portrayal has a sense of reality.  Still really like Willis, still like Jane, and Childers is an amazingly beautiful woman.  If you are a sci-fi connoisseur, or interested in getting a few dos and don'ts for making movies, watch it.  My rating is based on pretending I have never seen another movie in my life.",
      "total_reactions": 0,
      "user": "jopair"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2016
      },
      "score": 10,
      "text": "This is a very good watch ... the plot rolls on nicely and the small number of main characters are relatable enough for an action scifi. I had no problem watching it through to the end and feeling entertained through out.",
      "total_reactions": 0,
      "user": "awertyuiop12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2016
      },
      "score": 6,
      "text": "The premise, although not entirely original, was serviceable enough to be considered a fun sci-fi romp. Unfortunately, Bruce Willis and Thomas Jane were less than interested and the philosophical questions the film poses are squandered with a lackluster second half.",
      "total_reactions": 0,
      "user": "ourtimehascome"
    }
  ]
}