{
  "avg_user_score": 5.4,
  "metascore": 36,
  "mixed_rating_frequency": 34,
  "movie_name": "Victor Frankenstein",
  "negative_rating_frequency": 22,
  "positive_rating_frequency": 34,
  "pro_critic_reviews": [
    {
      "critic": "David Hughes",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2015
      },
      "score": 80,
      "summary": "Crackling with energy and fizzing with ideas, this fresh take on Frankenstein is a thrilling adaptation that reinvigorates a well-worn tale."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2015
      },
      "score": 67,
      "summary": "Daniel Radcliffe cleans up nicely as Igor, the man behind the madman who makes the monster in this, the 60th (thereabouts) film to adapt or riff on Mary Shelley’s prescient 1818 sci-fi/horror novel. Happily, director Paul McGuigan, working from a script by Max Landis, takes the story in some new directions by choosing to retell the tale from the perspective of the famed hunchback."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2015
      },
      "score": 63,
      "summary": "A kind of mad coming-of-age yarn embellished with lightning bolts and monsters made of cadaverous flesh."
    },
    {
      "critic": "Brad Wheeler",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2015
      },
      "score": 63,
      "summary": "McGuigan’s visually vivid Victor Frankenstein races to its lightning-storm finish, running over the solid (if not electrifying) acting of McAvoy and Radcliffe."
    },
    {
      "critic": "Jamie Graham",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2015
      },
      "score": 60,
      "summary": "Fun enough, but not the lightning-bolt-to-the-heart update we hoped for. For a far superior update of the Frankenstein myth, read Stephen King’s Revival."
    },
    {
      "critic": "Wendy Ide",
      "publication": "Screen International",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2015
      },
      "score": 60,
      "summary": "This Grand Guignol riot of rotting animal and Godless creations is great fun. However, of the cast, it is only McAvoy, walking the line between madman and genius, who fully manages to hold his own against the spectacle with which he shares the screen."
    },
    {
      "critic": "Kyle Anderson",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2015
      },
      "score": 58,
      "summary": "Only Radcliffe escapes unscathed, lending Igor a convincing psychology despite the ham-fistedness of the material. But he’s not enough of a reason to resurrect this story again."
    },
    {
      "critic": "Mike D'Angelo",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2015
      },
      "score": 50,
      "summary": "The first words spoken in Victor Frankenstein are “You know the story,” and anyone who simply mutters “Yep,” gets up, and heads back to the box office for a refund will be well ahead of the game."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2015
      },
      "score": 50,
      "summary": "Thin as a halfpenny, Victor Frankenstein has nothing to offer on science and the mysteries of creation, but it does reaffirm the grip that Shelley’s story retains on the imagination, no matter how far afield it’s taken."
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2015
      },
      "score": 50,
      "summary": "Still, those who adore the two stars will find some fun here. And if you don’t “know the story,” you won’t be nearly as bored as the rest of us."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2015
      },
      "score": 42,
      "summary": "The best and creepiest sequence involves a sort of beta test, during which a patchwork chimplike creature is brought to life and rampages about."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2015
      },
      "score": 40,
      "summary": "When all the parts are sewn together, the end result proves as crude and slapdash as the monster itself."
    },
    {
      "critic": "Andrew Barker",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2015
      },
      "score": 40,
      "summary": "This reimagining features some fun production design and a performance of undiluted bug-eyed flamboyance from James McAvoy as the titular pale student of unhallowed arts, but its reservoirs of energy and ingenuity run dry long before the finale, leaving the film to lumber to its half-hearted conclusion."
    },
    {
      "critic": "Oleg Ivanov",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2015
      },
      "score": 38,
      "summary": "Victor Frankenstein is the movie version of a carnival sideshow, all smoke and mirrors, presenting a litany of human freaks and animal monstrosities to distract from the superficiality of its psychological and intellectual concerns."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2015
      },
      "score": 38,
      "summary": "McAvoy’s performance is a deep, deep shade of gonzo and by far the most enjoyable aspect of Victor Frankenstein — you don’t often see over-acting this enthusiastic or this flecked with spittle."
    },
    {
      "critic": "Glenn Kenny",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2015
      },
      "score": 38,
      "summary": "Victor Frankenstein is, despite bravura performances from committed young leads Daniel Radcliffe and James McAvoy, all kinds of obnoxious and pointless."
    },
    {
      "critic": "Jen Chaney",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2015
      },
      "score": 37,
      "summary": "Even McAvoy’s reincarnation-obsessed Frankenstein can’t breathe vitality into this shallow adaptation, which careens from moments of horror to serious drama to attempts at comedy that don’t quite land."
    },
    {
      "critic": "Gary Goldstein",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2015
      },
      "score": 30,
      "summary": "For much of the movie's running time, I wished I were watching Mel Brooks' classic take on Shelley's yarn, \"Young Frankenstein.\" At least that one was intentionally funny."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2015
      },
      "score": 30,
      "summary": "Whether or not one should tamper in God’s domain remains a matter of opinion, but Victor Frankenstein provides evidence that mere mortals should not mess with what Ms. Shelley hath wrought."
    },
    {
      "critic": "Sheri Linden",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2015
      },
      "score": 30,
      "summary": "McAvoy and Radcliffe are actors with charm to burn, but it’s only in brief moments that their characterizations cut through the film’s pandemonium, while the jokes they’re called upon to deliver land with a thud."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2015
      },
      "score": 25,
      "summary": "The only thing about Victor Frankenstein worthy of praise is the set design. Visually, the movie is impressive but pretty pictures are better left to postcards."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2015
      },
      "score": 25,
      "summary": "Victor Frankenstein is misshapen as the bad doctor's creature itself, straining without wit or viscera to be a devilish horror romp."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2015
      },
      "score": 25,
      "summary": "Most of this is tedious instead of unintentionally amusing."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2015
      },
      "score": 25,
      "summary": "A bleak, tedious enterprise, shot in earth tones and Gothic gray and blue."
    },
    {
      "critic": "Nick Schager",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2015
      },
      "score": 25,
      "summary": "Deformed from the start, it confirms the very thing argued by its narrative – namely, the folly of unwarranted resurrections."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2015
      },
      "score": 20,
      "summary": "A catastrophic miscalculation of a movie, Victor Frankenstein is a perfect example of a Hollywood revision that, in trying to outsmart an original, reveals what worked about said original in the first place."
    },
    {
      "critic": "Allen Salkin",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 11,
        "year": 2015
      },
      "score": 20,
      "summary": "This un-terrifying film tries to find an interesting twist on the classic Frankenstein tale, but horrifically fails."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2015
      },
      "score": 0,
      "summary": "By going exactly where you think it’s going, Victor Frankenstein doesn’t so much invent a fresh origins story as it essentially repeats, with a few uninteresting new details, all the same stuff we’ve seen in the other 457 Frankenstein movies."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "I liked this movie very much. I was expecting way worse because of the poor ratings on meta critic. Yet I found the movie to be funny, well acted, engaging, and well produced. The graphics were incredible. I really liked the old English set. Daniel Radcliffe was great in the movie. I think he played the character really well. The storyline for the movie was interesting. Igor seemed to be torn between the woman he loved and the man who saved him from the circus. Great film.",
      "total_reactions": 1,
      "user": "hendrikchipman"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2015
      },
      "score": 10,
      "text": "Loved it! My wife and I just saw it today and were pleasantly surprised! I'm not sure what some of these reviewers are talking about. It's a very creative and really intelligent film. I loved all the twisted science and art direction they used. The story and characters were interesting and made you excited to see what would happen next. I won't give any details but if you appreciate movies that make you delve a little deeper than what's on the surface, you'll like this movie too. It's not your ordinary mindless adventure.",
      "total_reactions": 10,
      "user": "johnbman11"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2015
      },
      "score": 9,
      "text": "My wife and I thoroughly enjoyed this film. The casting was terrific, the acting superb and was complimented perfectly by its setting and wardrobe choices. Further appeal of this picture comes from the strength in its solid storyline that kept us interested from start to finish. It was refreshing to see a quality Hollywood film that was not simply a special effects production. Well done. We would see it again. ﻿",
      "total_reactions": 5,
      "user": "Mal_one"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "The difference in this reinterpretation is that it focuses on the relationship between crazed scientist Victor Frankenstein (James McAvoy) and his hunchback Igor (Daniel Radcliffe), who has been reinvented as his brilliant protégé. The interesting twists to the traditional story begin with Igor's origin and continue thru the entire narrative. Most of them provided a fresh perspective, although McAvoy's ranting does get tedious (Radcliffe creates a sweet character). The cinematography, art direction and costumes beautifully capture the period. An absorbing, vigorous and interesting new version.",
      "total_reactions": 4,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2015
      },
      "score": 5,
      "text": "This is a handsome, but empty production.  Or, put another way, it is an imposing shell energized by the lightning of fine acting and craftsmanship, but adrift without a soul.  The idea is obvious:  create a spry, postmodern, and loose adaptation of the often-often-adapted Mary Shelley novel to attract the audience which drove Guy Ritchie's two enjoyable Sherlock Holmes films to around one billion worldwide.  But Shelley's gloomily Romantic story of science gone awry (and the prior cinematic versions which gave us malformed laboratory assistant Igor and \"IT'S ALIVE!\") proves an uncomfortable candidate for too-cool-for-school revisionism.  The result is a curious case of hyperactive lethargy in which no charming diversion—not a wild-eyed camp performance by James McAvoy as the title character, not a love story for a straightened and beautified Igor (Daniel Radcliffe), not the extensive Victorian-era production design, not composer Craig Armstrong's thundering original score—distracts from the fact next to nothing of consequence is transpiring, and there is a waning sense of anticlimax when the film finds its way around to the main creature-feature attraction just in time to end.",
      "total_reactions": 10,
      "user": "DotTheEyes"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "This really is an entertaining adaptation. But it lacks a lot of substance and somewhat lacks integrity. Acting was very enthusiastic but seemed like they were trying their hardest in a story which is so overused and has been done a million times that they needed something extra for imagination. There was just nothing particularly new or surprising. Plus, the very end scene really got me pissed off from the film's overall moral, it felt like a betrayal in honesty.  That said, I wasn't angry with this movie, nor was I bored for the most part. It was solidly entertaining and you'll have a good time at the cinema with this one.",
      "total_reactions": 3,
      "user": "TrilobiteG"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2015
      },
      "score": 4,
      "text": "Victor Frankenstein is not one of the worst films of 2015 but it’s hardly good at the same time.  It’s a very forgettable film, it doesn’t really have much to offer, the actors are very decent but they are so bland in this film and it’s a real shame that it’s a blight on the careers of Director Paul McGuigan and Writer Mat Landis who are both very talented people, hopefully their next project together will be better.  There is very little praise to really give to the film, but at least it’s a decently shot film and it never feels awful, it just feels boring and dull and you know that everyone involved can do better.  It’s a mess pure and simple and it’s probably down to studio interference and constant re-editing, which once again destroyed what was clearly a promising film, and it’s a shame for James McAvoy and Daniel Ratcliffe who are actors that I really enjoy and have been given a film that is clearly not up to their talents.  I would skip this one altogether if I were you.",
      "total_reactions": 2,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "ok saw this recently was it the best movie i saw this year well no was it the worst agin no it was just an avrage movie meant for fun if u go see it looking to be disapointed then thats what u will receive but if u go in with some what hopes of a good movie then u will be suprized its fun good action great story and scares i say go see it",
      "total_reactions": 2,
      "user": "chrismovieguy"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2015
      },
      "score": 10,
      "text": "Not really sure what to make of this, I was a little confused to see Gollum Radcliff scuttling about at the start. Other wise i thought it was good, i dont have anything to compare it to as this move has rendered me permanently brain damaged.",
      "total_reactions": 3,
      "user": "Unladenswallow0"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2015
      },
      "score": 5,
      "text": "El guión muy malo, flojo, sin chiste, da risa. Por lo mismo las actuaciones son flojas y aunque Radcliff y McAvoy intentan darle sentido a este despropósito no pueden.  El diseño de arte bueno pero no destaca y la musica de siente invasiva en ciertos momentos. Muy mala.",
      "total_reactions": 1,
      "user": "KinkyKid"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2015
      },
      "score": 5,
      "text": "[Movie opens with Igor narrating]",
      "total_reactions": 2,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2016
      },
      "score": 2,
      "text": "It's alive! It's ALIVE! IT'S ALIVE!!! IT'S..... oh wait... it's dead. That's funny how there's no negative reviews before this review popped out of nowhere and now there is one.",
      "total_reactions": 2,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "An exciting reimagining of the classic horror story brought to life (pun intended) by the deliciously mad performances by Daniel Radcliffe and James McAvoy. Okay, so perhaps \"mad\" only applies to McAvoy. His eccentric performance as the bat-crap crazy Victor Frankenstein is outstanding. Radcliffe brings a more human and sweet side to the whole affair.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2016
      },
      "score": 7,
      "text": "While most of the movie can be seen as boring and cliché, the last half hour, the great CGI and the superb acting by the main characters keep the movie above the average mark.It might not be an excellent movie, but it sure as hell is not a bad one.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2016
      },
      "score": 5,
      "text": "Yet another version of the world famous Frankenstein novel Victor Frankenstein is a blend of several genres and it is really difficult to find a specific one that it fits under. This movie is intended to be reimagining of the classic tale but there is still not anything revolutionary going on. I enjoyed the first two acts of this film it may not have been the story that I was looking for but there was some fun to be had. In the third act though, everything falls apart in just a few scenes and it completely drags on and when the time comes you are not invested in the ending at all. James McAvoy was really the reason I watched this film in the first place and he is great here but there is some pretty obvious overacting in spots. Radcliffe is pretty solid as well as he often is.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2016
      },
      "score": 6,
      "text": "Not bad, just boring.",
      "total_reactions": 0,
      "user": "tvnewsguido"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2016
      },
      "score": 5,
      "text": "‘Victor Frankenstein’ kicks off with a narration by Daniel Radcliffe as “Igor” declaring to the audience that “you know this story”, implying that you’re in for something new, or perhaps lowering expectations, intentionally or not. What follows for the best part of 2 hours is a 21st century treatment of this 19th century story, originally set in the late 18th century.",
      "total_reactions": 0,
      "user": "FilmPhonic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2016
      },
      "score": 6,
      "text": "Great acting and interesting adaptation of Frankenstein etc. Can't really compare it or rate it comparing to other versions as this is the first Frankenstein movie I have seen to be honest. But as a standalone it seemed to be quite decent. Not impressive, but ok.",
      "total_reactions": 0,
      "user": "Ralfbergs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "We are in the era where big companies retake old classics to adapt again and Twentieth Century Fox Film   did a decent job with respect to Mary Wollstonecraft Shelley's Frankenstein. It is completely innocuous and unimportant to mention that Paul McGuigan makes the movie  aiming to do for \"Victor Frankenstein\" what Guy Ritchie did for \"Sherlock Holmes\", Victorian London but with a different theme:  \"Two men with the ability to generate life\".",
      "total_reactions": 0,
      "user": "PipeC"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2016
      },
      "score": 7,
      "text": "Victor Frankenstein is not without its flaws, but on the whole, it's an interesting, visually striking and thoroughly well-acted take on a classic tale. Daniel Radcliffe gives an impressive performance as Igor, James McAvoy does a good job as the title character and Andrew Scott makes for a good antagonist. As I mentioned, I did have a few gripes- not all of the plot elements were entirely plausible and the only major female character in the movie does pretty much nothing for the plot. That said, there is still plenty to enjoy in the movie- McAvoy and Radcliffe had great chemistry and the production design was amazing. Overall, Victor Frankenstein may anger purists, but it's a fun movie that gives an iconic tale an intruiging twist. 7/10.",
      "total_reactions": 0,
      "user": "DanBurrito"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2016
      },
      "score": 4,
      "text": "Scenes without that would not change anything in the film did not exist or is this unnecessary film is not worth watching it spend your money seeing another film that you will be happier.",
      "total_reactions": 0,
      "user": "Dante_Pool"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2016
      },
      "score": 6,
      "text": "If you are looking for an entertaining romp of a movie, this pretty well fits the bill.  The screenplay is rather clumsy, but the A list actors are of such a pedigree that most of that can be overlooked.  If you're in the mood for a monster film and have time to kill, give this your 1 1/2 hours, but don't expect it to resonate after.",
      "total_reactions": 0,
      "user": "Adrenalize2112"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2016
      },
      "score": 4,
      "text": "The two actors are not strong enough or good enough in these parts. Its a mish mash of a film, you only get to see the monster at the very end of the film. It tries to be many things but in the end it delivers nothing new.  bring back peter cushin and christopher lee any day and the old hammer films to this modern rubbish. At best its a rental on dvd.. But once youve seen this you wont want to see it again.  Another very avarage frankenstein  film in a long line of bad attempts in recent years.",
      "total_reactions": 0,
      "user": "Thejudge21"
    }
  ]
}