{
  "mc_avg_user_score": 4.0,
  "mc_metascore": 37,
  "mc_mixed_rating_frequency": 16,
  "mc_movie_name": "Walking with Dinosaurs",
  "mc_negative_rating_frequency": 27,
  "mc_positive_rating_frequency": 9,
  "mc_pro_critic_reviews": [
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2013
      },
      "score": 75,
      "summary": "Purists may still quail at the little bit of anthropomorphism going on, but it seems a small price to pay to broaden the audience for a family film that seeks to do more than just entertain."
    },
    {
      "critic": "Neil Genzlinger",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2013
      },
      "score": 70,
      "summary": "The movie looks great, the writing is peppered with moments of wit, and there’s even an educational component built in as dinosaur facts are displayed on the screen."
    },
    {
      "critic": "Laremy Legel",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2013
      },
      "score": 67,
      "summary": "Educational content, clever and photorealistic dinosaur CGI, and John Leguizamo voicing a prehistoric bird. What else would one need for a fun movie stew?"
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2013
      },
      "score": 63,
      "summary": "Strange hybrid of science lesson and Saturday-morning cartoon."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2013
      },
      "score": 63,
      "summary": "“Walking” takes care to ID each new dinosaur species introduced, including factoids about what they ate and any special skills they might have had. It’s downright educational. Just don’t tell your kids that."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2013
      },
      "score": 50,
      "summary": "The movie for anyone who has dreamed of watching young dinos in love."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2013
      },
      "score": 50,
      "summary": "Visually, “Walking With Dinosaurs” dazzles with its combination of Animal Logic-animated CG creatures...and beautiful practical backgrounds... Less dazzling is the constant stream of jokey banter, which thwarts the pic’s educational potential and caps its target age awfully low."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2013
      },
      "score": 50,
      "summary": "A hyper-realistic-looking, character-driven story of survival with talking dinosaurs that can't decide whether to inform or entertain. The film and its featured creatures do a little of both but modestly."
    },
    {
      "critic": "Michael Rechtshaffen",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2013
      },
      "score": 50,
      "summary": "Walking With Dinosaurs takes rewarding advantage of a much bigger budget and state-of-the-art technology to bring its impressive collection of Cretaceous creatures to vivid life. But while the walking part’s pretty impressive, the talking part — not so much."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2013
      },
      "score": 42,
      "summary": "Instructive mainly for screenwriters looking for tips on what not to do, Walking With Dinosaurs takes the education out of “educational entertainment.” The entertainment, too."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2013
      },
      "score": 40,
      "summary": "For a film that purports to love dinosaurs, this bigger, flashier Walking With Dinosaurs sure doesn’t trust them to be interesting enough to carry five minutes of a movie without the copious aid of slapstick and bathroom humor in a screenplay so rote it makes creatures that have been dead for 65 million years feel less fossilized than the jokes."
    },
    {
      "critic": "Peter Sobczynski",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2013
      },
      "score": 38,
      "summary": "A film that is not so much bad — although it is quite bad — as it is utterly inexplicable."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2013
      },
      "score": 38,
      "summary": "Poor John Leguizamo, who hopefully got well-paid to voice a stereotypical Latino bird providing a stream of nonsensical narration."
    },
    {
      "critic": "Geoff Pevere",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2013
      },
      "score": 38,
      "summary": "Unfortunately, the only thing that dies harder in the movies than natural selection is careworn cliché, and Barry Cook and Neil Nightingale’s movie about a plucky, lovestruck pachyrhinosaurus named Patchi subjects our long defunct earthly ancestors to a fate arguably worse than extinction: a life lived in a world of cheese."
    },
    {
      "critic": "Tom Russo",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2013
      },
      "score": 38,
      "summary": "However well-intentioned the movie may be, it spills over with flat cutesy humor, making a slog out of an experience that should be filled with wonder."
    },
    {
      "critic": "Stephanie Merry",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2013
      },
      "score": 37,
      "summary": "Like an elaborately decorated wedding cake, the kid-friendly Walking With Dinosaurs 3D may leave you wondering how something so stunning could end up being so bland."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2013
      },
      "score": 30,
      "summary": "The film aspires to educate as well as entertain, rattling off the names and relevant distinctions of various dinosaurs as they appear onscreen for the first time. But the overwhelming impression the film leaves is that dinosaur poop was enormous."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2013
      },
      "score": 25,
      "summary": "The strain to make the film both an educational tool and a child-minded entertainment is noticeable throughout."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2013
      },
      "score": 20,
      "summary": "It's unlikely that a dinosaur wrote the script — the Writers Guild of America makes no provision for Cambrian membership — but this animated feature is dimwitted all the same. The title should be \"Trudging With Dinosaurs\" (in 2.5-D, for all the grandeur the glasses confer), because the only semblance of a plot is provided by a long migration to winter grounds."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2013
      },
      "score": 20,
      "summary": "Yes, the film’s CG dinos look great tromping in the Alaskan wilderness, but children deserve better than such unchallenging fare."
    },
    {
      "critic": "Louis Black",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2013
      },
      "score": 20,
      "summary": "It was maddening and frustrating to watch so much ambition wasted on delivering such lame junk. Very young children, I suspect, will like it, but the closer viewers are to puberty, the less likely it is to hold their interest."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2014
      },
      "score": 0,
      "text": "If I could give this a negative 1, I would. I was a huge fan of the classic TV shoe on BBC, but this is just plain stupid. It's a waste of time, believe me. Whoever made this movie obviously never even heard of the show.",
      "total_reactions": 2,
      "user": "mrmonster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2013
      },
      "score": 5,
      "text": "For those who watched the excellent \"Walking With Dinosaurs\" series on the BBC many moons ago, don't expect anything approaching that level here. It's harmless and inoffensive, but TOO harmless and inoffensive.",
      "total_reactions": 1,
      "user": "SteveBackMeta"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "This is a great kids movie with plenty of humour & my son & I really enjoyed it. I liked that they paused every now & again to identify the different types of dinosaurs, making it educational as well.",
      "total_reactions": 2,
      "user": "lisadel24"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "I think this movie is amazing in my opinion. I love the selection of dinosaurs like the Pachyrhinosaurus and the Gorgosaurus. I actually like the voice actors of the characters and i think this is a very enjoyable movie for everyone who loves dinosaurs.",
      "total_reactions": 7,
      "user": "godzillabots"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2014
      },
      "score": 6,
      "text": "It's one part educational with impressive visuals, and one part goofy kids movie with irritating voice overs and dialog. For every time you learn about how a dinosaur acted or what their name meant, your going to have to deal with the lame jokes tossed out by the characters who just won't shut up. As far as the humor goes, only the youngest of audiences will get any laughs. Older audiences like myself will be left rolling their eyes. It makes for a great movie for the young dinosaur fanatic in your house, but that doesn't mean you'll enjoy watching it with them. While I appreciate that the film tries to each kids as much as it tries to make them laugh, the history lesson and childish humor don't mesh together in a way that will make this all that entertaining for their parents. Adults might get a slight kick out of seeing some cool dinosaurs looking great on screen, but this is one for the young dinosaur lovers. The younger the better, and there's not necessarily anything wrong with that. My total score for the film is a 6.4/10=Okay.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2013
      },
      "score": 3,
      "text": "This could have been a magnificent 3-D adventure, while it still has good 3-D there was one big issue from the very start. The moment this movie spoke its first bit of screenplay, I felt like I was going to rip my hair off! The screenplay is absolutely horrible! Plus, the characters are completely uninteresting in every turn, who came up with this crappy cast. But at times when the movie just went straight it's plain 3-D marvel, it felt good. But sadly, it doesn't last for long! Overall, this is a God-Awful piece of cinema! I feel that I should rate this movie lower, but I'm being pretty generous because of all the fantastic movies that have came out recently! I give this crap a D!",
      "total_reactions": 1,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2015
      },
      "score": 3,
      "text": "This could’ve been decent. The animation was nice and this film could’ve been a nice, relaxing experience even if the dinosaurs were CGI. I enjoy documentaries and this one could’ve been no different. Unfortunately, this was ruined by the dubbing. Now dubbing the film was bad enough in itself as it clearly feels tacked on and takes you out of it but to take a step further this is bad dubbing. Think of those Dragonball Z abridged videos except with none of the whit. The dubbing makes this film painful to watch as it is generic and cliché and gives us the most basic of stories. Had this film not been dubbed it could’ve been a nice little film but as is it is awful. I wouldn’t recommend watching it unless you have toddlers who couldn’t care less but if you want to watch it get the DVD as it has a feature that turns of the dialogue. Its amazing how far the dubbing goes in making this film torture to watch but it does and the opening and beginning of this film was pointless and stupid.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2013
      },
      "score": 3,
      "text": "I wish the trailers had been more specific. This is clearly geared towards kids and it was just so not what I was expecting or looking forward to. I wanted an epic quest of a dinosaur, not a stupid generic story and all the dumb voice actors and facts.",
      "total_reactions": 0,
      "user": "graw136"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2013
      },
      "score": 2,
      "text": "Spoiler: The plot is  WALKING. With DINOSAURS.",
      "total_reactions": 0,
      "user": "S7ARBVCK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2013
      },
      "score": 2,
      "text": "Ultimately, the problem with Walking with Dinosaurs is that it unfolds like a decent 3D documentary screened at a museum theater  which ultimately makes it a C-grade theatrical feature.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2013
      },
      "score": 3,
      "text": "This movie is just for kids mostly it stops for a second just to teach you about the specimen and the main plot is generic as it sounds older brother overshadows younger brother and younger brother redeems him self i know i've seen a movie with this plot before if someone reads this review thell me which movie has this plot. Another thing the begining of the movie is bad just some uncle taking his nephew and niece to dig up a fossil in Alaska and then  a bird talks to the nephew and it is trippy because there is no voice sync i did like the animation and atmosphere of the movie but this is the worst    way of the land before time but in CGI in 3-D i don't recomend whatching it if your a dinosaur fan or achiolagist watch it with your kid cause he'll like it",
      "total_reactions": 0,
      "user": "gambit21xd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2013
      },
      "score": 10,
      "text": "Walking with dinosaurs is focused towards younger viewers. It stops to identify the different types of dinosaurs in the film, and it is very light-hearted.",
      "total_reactions": 0,
      "user": "Ziggyjig"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2014
      },
      "score": 2,
      "text": "THIS MOVIE IS ONE OF THE WORST MOVIES I HAVE EVER SEEN. I left the theater early and I have never done that in a movie before. The trailers should have showed that it wasn't some documentary narrated by some british dude But an annoying kids movie. DON'T SEE THIS MOVIE.",
      "total_reactions": 0,
      "user": "xenomorph287"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "Walking with Dinosaurs is such a terrible movie!!! The dinosaurs in the movie were so cool, but then they just ruined the effect when the dinosaurs' mouths don't move when they talk! Either way, what they supposedly say when they portray the dinosaurs sounds incredibly idiotic for a dinosaur to say if they had anything TO say.",
      "total_reactions": 0,
      "user": "chw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2015
      },
      "score": 2,
      "text": "This movie could have been good, it could have been different. The visuals are incredible! I just wish it was a silent film with music and dinosaurs, much like the original series. Instead, what we get is a film full of poop jokes, annoying voice acting, and a script that is a rehash of cliches. If they release a silent version of this film, I'll like it, but as is, just don't even bother.",
      "total_reactions": 0,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2015
      },
      "score": 9,
      "text": "WTF are people complaining about.It is a good movie yes indeed it is you should be ashamed of giving this movie a thumbs down.shame on you shame on you.",
      "total_reactions": 0,
      "user": "Jollyjoe1000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2016
      },
      "score": 3,
      "text": "Walking with dinosaurs may be the funniest film of the year, but that doesn't mean that it's a good one, with its simple interpretation, simplistic plot and boring story-telling. This is probably, one of the worsts films of the year, or maybe of the worsts films ever.",
      "total_reactions": 0,
      "user": "Futuredirector"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2016
      },
      "score": 6,
      "text": "It's one part educational with impressive visuals, and one part goofy kids movie with irritating voice overs and dialog. For every time you learn about how a dinosaur acted or what their name meant, your going to have to deal with the lame jokes tossed out by the characters who just won't shut up. As far as the humor goes, only the youngest of audiences will get any laughs. Older audiences like myself will be left rolling their eyes. It makes for a great movie for the young dinosaur fanatic in your house, but that doesn't mean you'll enjoy watching it with them. While I appreciate that the film tries to each kids as much as it tries to make them laugh, the history lesson and childish humor don't mesh together in a way that will make this all that entertaining for their parents. Adults might get a slight kick out of seeing some cool dinosaurs looking great on screen, but this is one for the young dinosaur lovers. The younger the better, and there's not necessarily anything wrong with that. My total score for the film is a 6.4/10=Okay.",
      "total_reactions": 0,
      "user": "SimpsonFans"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2017
      },
      "score": 6,
      "text": "It's one part educational with impressive visuals, and one part goofy kids movie with irritating voice overs and dialog. For every time you learn about how a dinosaur acted or what their name meant, your going to have to deal with the lame jokes tossed out by the characters who just won't shut up. As far as the humor goes, only the youngest of audiences will get any laughs. Older audiences like myself will be left rolling their eyes. It makes for a great movie for the young dinosaur fanatic in your house, but that doesn't mean you'll enjoy watching it with them. While I appreciate that the film tries to each kids as much as it tries to make them laugh, the history lesson and childish humor don't mesh together in a way that will make this all that entertaining for their parents. Adults might get a slight kick out of seeing some cool dinosaurs looking great on screen, but this is one for the young dinosaur lovers. The younger the better, and there's not necessarily anything wrong with that. My total score for the film is a 6.4/10=Okay.",
      "total_reactions": 0,
      "user": "Tiber5"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2017
      },
      "score": 6,
      "text": "It's one part educational with impressive visuals, and one part goofy kids movie with irritating voice overs and dialog. For every time you learn about how a dinosaur acted or what their name meant, your going to have to deal with the lame jokes tossed out by the characters who just won't shut up. As far as the humor goes, only the youngest of audiences will get any laughs. Older audiences like myself will be left rolling their eyes. It makes for a great movie for the young dinosaur fanatic in your house, but that doesn't mean you'll enjoy watching it with them. While I appreciate that the film tries to each kids as much as it tries to make them laugh, the history lesson and childish humor don't mesh together in a way that will make this all that entertaining for their parents. Adults might get a slight kick out of seeing some cool dinosaurs looking great on screen, but this is one for the young dinosaur lovers. The younger the better, and there's not necessarily anything wrong with that. My total score for the film is a 6.4/10=Okay.",
      "total_reactions": 0,
      "user": "ThisIsSparta666"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2017
      },
      "score": 6,
      "text": "It's one part educational with impressive visuals, and one part goofy kids movie with irritating voice overs and dialog. For every time you learn about how a dinosaur acted or what their name meant, your going to have to deal with the lame jokes tossed out by the characters who just won't shut up. As far as the humor goes, only the youngest of audiences will get any laughs. Older audiences like myself will be left rolling their eyes. It makes for a great movie for the young dinosaur fanatic in your house, but that doesn't mean you'll enjoy watching it with them. While I appreciate that the film tries to each kids as much as it tries to make them laugh, the history lesson and childish humor don't mesh together in a way that will make this all that entertaining for their parents. Adults might get a slight kick out of seeing some cool dinosaurs looking great on screen, but this is one for the young dinosaur lovers. The younger the better, and there's not necessarily anything wrong with that. My total score for the film is a 6.4/10=Okay.",
      "total_reactions": 0,
      "user": "PAMA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2017
      },
      "score": 6,
      "text": "It's one part educational with impressive visuals, and one part goofy kids movie with irritating voice overs and dialog. For every time you learn about how a dinosaur acted or what their name meant, your going to have to deal with the lame jokes tossed out by the characters who just won't shut up. As far as the humor goes, only the youngest of audiences will get any laughs. Older audiences like myself will be left rolling their eyes. It makes for a great movie for the young dinosaur fanatic in your house, but that doesn't mean you'll enjoy watching it with them. While I appreciate that the film tries to each kids as much as it tries to make them laugh, the history lesson and childish humor don't mesh together in a way that will make this all that entertaining for their parents. Adults might get a slight kick out of seeing some cool dinosaurs looking great on screen, but this is one for the young dinosaur lovers. The younger the better, and there's not necessarily anything wrong with that. My total score for the film is a 6.4/10=Okay.",
      "total_reactions": 0,
      "user": "Pama300"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2017
      },
      "score": 6,
      "text": "It's one part educational with impressive visuals, and one part goofy kids movie with irritating voice overs and dialog. For every time you learn about how a dinosaur acted or what their name meant, your going to have to deal with the lame jokes tossed out by the characters who just won't shut up. As far as the humor goes, only the youngest of audiences will get any laughs. Older audiences like myself will be left rolling their eyes. It makes for a great movie for the young dinosaur fanatic in your house, but that doesn't mean you'll enjoy watching it with them. While I appreciate that the film tries to each kids as much as it tries to make them laugh, the history lesson and childish humor don't mesh together in a way that will make this all that entertaining for their parents. Adults might get a slight kick out of seeing some cool dinosaurs looking great on screen, but this is one for the young dinosaur lovers. The younger the better, and there's not necessarily anything wrong with that. My total score for the film is a 6.4/10=Okay.",
      "total_reactions": 0,
      "user": "Creepers200"
    }
  ]
}