{
  "avg_user_score": 4.8,
  "metascore": 25,
  "mixed_rating_frequency": 22,
  "movie_name": "Walk of Shame",
  "negative_rating_frequency": 19,
  "positive_rating_frequency": 18,
  "pro_critic_reviews": [
    {
      "critic": "Jordan Hoffman",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2014
      },
      "score": 75,
      "summary": "Far-fetched, absurd and hopelessly schticky, but if you can get past its boring initial set-up, it’s actually quite funny."
    },
    {
      "critic": "Anita Gates",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2014
      },
      "score": 40,
      "summary": "The cast does a fine collective job, and Mr. Brill’s script flirts with clever charm here and there. But the whole film is a missed opportunity because the situations repeatedly defy credibility, and the humor never says anything remotely fresh about human nature or the world we live in."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2014
      },
      "score": 40,
      "summary": "If anyone walks away unblemished from Walk of Shame, it's Banks, who throws herself into every bit of physical comedy and humiliation the movie sends her way. If the movie had gone for broke as often as its lead actress, the results wouldn't feel so disposable."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2014
      },
      "score": 40,
      "summary": "Banks succeeds in mining a few laughs from the otherwise strained, contrived proceedings."
    },
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2014
      },
      "score": 33,
      "summary": "The film is curiously schizophrenic. Brill’s screenplay mixes traditional rom-com generics with sporadically funny R-rated vulgarity and ludicrously dumb gags."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2014
      },
      "score": 33,
      "summary": "The premise should provide plenty of opportunities to skewer the way women are perceived based on appearance, with Shame as the operative word, but writer/director Steven Brill (Little Nicky) uses it mostly as a magnet for broad ethnic humor."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2014
      },
      "score": 30,
      "summary": "Even without the queasy racial stereotypes, Walk of Shame feels perfunctorily assembled, its obstacles straining even screwball logic."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2014
      },
      "score": 30,
      "summary": "Brill’s point that there should be no such thing as a “walk of shame” is a good one, but he lacks the conviction to see it through honestly—or humorously."
    },
    {
      "critic": "Christy Lemire",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2014
      },
      "score": 25,
      "summary": "Elizabeth Banks’ character — a perky and wholesome local news anchor — is mistaken for: • A stripper • A hooker • A junkie • A crack whore • A drug dealer • A thief • A masseuse who gives happy endings • A witch. This repetitive misogynistic streak is in the service of painfully wacky gags, the vast majority of which land with a thud."
    },
    {
      "critic": "Joe McGovern",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2014
      },
      "score": 25,
      "summary": "A lumpy and laughless farce from writer-director Steven Brill (Drillbit Taylor, Little Nicky), a man who never told a joke he couldn't ruin."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 5,
        "year": 2014
      },
      "score": 20,
      "summary": "If Meghan's misadventures were funny, or creatively told, or even just mildly entertaining, perhaps Brill (\"Little Nicky\") could get away with such lazy filmmaking. Instead he wastes all of his resources, including two top-flight comic actors, shamelessly."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2014
      },
      "score": 20,
      "summary": "Even when it's at its best, Walk of Shame is rarely more than merely amusing. On the other hand, when it's at its worst, it's nothing short of insulting, thanks to its willingness to engage in the kind of gross stereotyping that treads uncomfortably close to racist territory."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "summary": "Watching the redoubtable Elizabeth Banks try to breathe life into the stillborn farce Walk of Shame is like watching a team of paramedics perform CPR on the corpse of Ulysses S. Grant."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "I am not quite surprised that critics are bashing this movie, Walk of Shame is not a perfect comedy but it is for sure an entertaining, funny and heart warming at times! Elizabeth Banks did a really good job. Steven Brill directing a movie is what makes you want to avoid it and not give it a chance and this is what I believe the critics are doing. Besides, Walk of Shame is recommended, it is a fun movie featuring a bunch of talented people despite some outdated ideas, it is still a blast in my opinion.",
      "total_reactions": 5,
      "user": "MovieReviews"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2014
      },
      "score": 3,
      "text": "Besides Elizabeth Banks this film has little going for it.  Bank's is able to keep your attention on the film while the lack of comedy makes you not care about anything else.  D",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 7,
        "year": 2014
      },
      "score": 4,
      "text": "Walk of Shame is a disgrace - blissfully offensive, incredibly crass, and incredibly sexist, and has claimed the prestigious title of Elizabeth Banks worst film to date.",
      "total_reactions": 1,
      "user": "sammurphy66"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "This movie was much better than I thought it would be. Elizabeth Banks is hilarious but I was concerned with whether or not she could carry a comedy by herself. Well in this film she didn't have to because the supporting cast around her was absolutely amazing and the hilarity of each moment in the film's plot progression was just great. James Marsden, Gillian Jacobs, and Sarah Wright were all fantastic and then factor in the comedic genius of Bill Burr and Alphonso McAuley and the cast was just fantastic from top to bottom. Is this raunchy comedy going to be for everyone? No, it's not. It's more of a guy's style comedy film with a female lead, which is probably why it didn't kill it in the box office or why the closed minded critics didn't understand it. That being said, if you have enjoyed previous Elizabeth Banks films, you'll certainly get some quality laughs here.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2014
      },
      "score": 6,
      "text": "Unrealistically outrageous journey through Los Angeles featuring the lovely Elizabeth Banks. Walk of Shame is not a deep or moving piece of film; what it is, is an entertaining, light late-nighter.",
      "total_reactions": 0,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2015
      },
      "score": 6,
      "text": "I'm very surprised. Not only is Walk of Shame not a complete fail, it's actually not so bad. The story itself is pretty farfetched (as it sets out to be), but Banks makes you root for her character by adding just enough charm and sweetness to the role. Yes, there are stereotypes and clichés running amok here, but this kind of movie doesn't work without familiar characters.",
      "total_reactions": 0,
      "user": "MovieGuys"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "Wow ..........FUNNY !  wow Elizabeth Banks was funny in Pitch Perfect , her comedy sucks also her directing in movie 43. in the walk of shame she improves her comedy it's really funny  a classic maybe i agree with the critics , this is not  an \" A+ \" movie. it was short and enough laughter ? .... some moments. Grade B",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2015
      },
      "score": 4,
      "text": "2/5★ The Walk Of Shame is on a mission to prove that yes, women can be just as freely promiscuous and foul mouthed as men, no judgment allowed. There are a few funny moments, and Elizabeth Banks has the comedy chops to pull it off, but as a whole, Walk Of Shame does nothing to further feminism, but instead is a shrieky, logic defying mess.",
      "total_reactions": 0,
      "user": "reellm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2015
      },
      "score": 2,
      "text": "An offensively unfunny exercise in misogyny and boredom. Elizabeth Banks is an excellent comedic actress and deserves a hell of a lot better than this.",
      "total_reactions": 0,
      "user": "SolInvicta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 11,
        "year": 2015
      },
      "score": 9,
      "text": "It may be the second best \"woman takes wild, wacky trip across Los Angeles\" comedy to come out in the last decade, but it is still a pretty good, pretty funny movie.",
      "total_reactions": 0,
      "user": "tonimiller417"
    }
  ]
}