{
  "mc_avg_user_score": 6.5,
  "mc_metascore": 53,
  "mc_mixed_rating_frequency": 45,
  "mc_movie_name": "Wanderlust",
  "mc_negative_rating_frequency": 21,
  "mc_positive_rating_frequency": 66,
  "mc_pro_critic_reviews": [
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2012
      },
      "score": 91,
      "summary": "I don't know what tools of the trade Paul Rudd and director David Wain share to dream up the kind of inspired nutso stuff Rudd has done in smart-funny-raunchy winners like \"Wet Hot American Summer\" and \"Role Models.\" But whatever it is, the two are in a groove - and backed up by some blissed-out creative co-conspirators."
    },
    {
      "critic": "Ian Buckwalter",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 75,
      "summary": "Wain's brand of humor thrives on stepping over the line - and then sprinting a few hundred yards past it."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2012
      },
      "score": 75,
      "summary": "So this is a good comedy, as bad as it can be and still be good, but good."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2012
      },
      "score": 75,
      "summary": "David Wain's riotous, raunchy, and more than a little raggedy showcase for Rudd's improv genius and Aniston's airy groundedness. He is gut-busting funny, she gently ticklish - ideal comic rapport."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2012
      },
      "score": 70,
      "summary": "Being taken under Apatow's wing may have been a big career break for writer-director David Wain, but this lacks the sharp personality of some of his earlier movies."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 70,
      "summary": "It's not fresh terrain for satire, yet most of the jokes play riotously well."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2012
      },
      "score": 70,
      "summary": "Though Wanderlust finally laughs off the real discomforting conclusion that it's edging toward, it's gut-busting funny when mocking their hopeless options."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2012
      },
      "score": 70,
      "summary": "Stars Paul Rudd and Jennifer Aniston find themselves at home here, playing against a stock-raising performance by Justin Theroux as the charismatic libertine who prompts their adventure."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2012
      },
      "score": 67,
      "summary": "Alternately mortified and charmed by the unhinged lifestyle, the film goofily celebrates the idea of a societal escape before drowning its idealism in a puddle of half-formed jokes."
    },
    {
      "critic": "Alison Willmore",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2012
      },
      "score": 65,
      "summary": "Wanderlust is an agreeable comedy that peters out halfway through."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 63,
      "summary": "A raunchy, often hilarious satire from the Judd Apatow stable that lacks any real bite."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2012
      },
      "score": 63,
      "summary": "Some of the players are endearingly goofy in this good-natured comedy, particularly Rudd and Theroux. But Wanderlust trundles along unevenly, never reaching the cleverly raucous state it seeks."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2012
      },
      "score": 63,
      "summary": "When the script sags, Wain and producer Judd Apatow rely on a top team of actors to keep you laughing."
    },
    {
      "critic": "Jesse Cataldo",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2012
      },
      "score": 63,
      "summary": "Wagging a limp dick at a host of up-to-the-minute issues, Wanderlust, manages to feel current, and relatively funny, without ever becoming particularly pointed, resulting in a floppy but satisfactory middlebrow comedy."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 60,
      "summary": "Wanderlust is about two or three script passes away from being a consistently funny, dramatically coherent romantic comedy."
    },
    {
      "critic": "James Rocchi",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2012
      },
      "score": 60,
      "summary": "While \"Role Models\" mined riches even in the well-plowed comedic soil of cretins befriending kids, Wanderlust's equally musty city-vs-country culture clash plot finds only flecks of hilarity in mostly bland-to-bold mediocrity."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2012
      },
      "score": 60,
      "summary": "If anything, the manic energy and aggressive sarcasm of Wain's \"Role Models\" (2008), which also starred Rudd, has become much more refined in Wanderlust, (well, as refined as something this raw can be)."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2012
      },
      "score": 60,
      "summary": "It's not a top-shelf Apatow production, and by the end, it's obvious Wanderlust was a lot more fun to make than it is to watch."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2012
      },
      "score": 60,
      "summary": "None of the hilarity is enough to keep Wanderlust from feeling like a late-night comedy-show sketch stretched to feature length. But why look a giggle-prone gift horse in the mouth?"
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2012
      },
      "score": 58,
      "summary": "The effortlessly charming Rudd - who is never funnier here than when trying to psych himself up for a tryst with commune-dweller Malin Akerman with a series of increasingly preposterous voices - and an attractive, game supporting cast nearly sell the warmed-over material."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "Wanderlust is flawed, too, but for its exploration of financial ruin and alternative lifestyles, it shows once again that Aniston, at the very least, knows which way the wind is blowing."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "Wanderlust, a comedy that looks way better than it actually is set amidst the dreck of late winter releases."
    },
    {
      "critic": "Manohla Dargis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "For every few jokes that hit in this story about a recession-battered New York couple finding themselves on a Georgia commune, one sputters and dies."
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "Between this film and last summer's \"Horrible Bosses,\" Aniston's coyness - starring in explicit movies without having to be explicit herself - seems to be becoming her stock in trade. It's not a particularly commendable one, and Wanderlust does little to disprove that she's still a star more suited to TV rather than the big screen."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "Okay, Wanderlust has its moments. It's sporadically funny - funny enough to deliver a good laugh or two. The problem is, it doesn't do more than that, and the comedy is inconsistent."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "This movie has no teeth. It does not want to say anything, other than the unprintable word for penis, over and over."
    },
    {
      "critic": "Brian Lowry",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2012
      },
      "score": 50,
      "summary": "Despite some amusing moments, everyone simply works too hard at providing rambunctious zaniness, until one grows painfully aware the inevitable outtakes reel will be superior to the movie."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 42,
      "summary": "This movie is \"Finian's Rainbow\" for dunderheads. Rudd has a few amusing moments talking to himself in a mirror (he's trying to convince himself he's a stud) but he would have been better off talking himself out of this film."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 42,
      "summary": "If not for a few choice performance moments and a couple of peppy montages, Wanderlust would be cinematic compost, recycled and thoroughly smelly."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2012
      },
      "score": 40,
      "summary": "Despite the calculated advance press about the movie's nudity, polygamy, dirty talk, etc., David Wain's comedy is depressingly banal. And all that breathless hype now feels like nothing more than manipulation."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2012
      },
      "score": 38,
      "summary": "There's no real reason to see this movie. It's exhausting and pointless and not amusing enough to make up for its failings. You can do better. The filmmakers could have done better. Honestly, you're better off staying home and making hummus."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2012
      },
      "score": 25,
      "summary": "Film encyclopedias may beg to differ, the Cahiers du Cinéma might correct me, but, as far as your humble correspondent knows, Wanderlust is the first mainstream movie ever to star a Floppy Prosthetic Penis."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2012
      },
      "score": 0,
      "summary": "So you think you've seen silly? And smarmy? And inept? Wait till you see Wanderlust, though that's just a figure of speech; I'm not suggesting that you actually lay eyes on this naked grab for box office bucks."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "A funny and charming movie.",
      "total_reactions": 6,
      "user": "ReviewCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2012
      },
      "score": 3,
      "text": "Neither funny or charming enough to impress, even with a great cast. I give this movie 34%.",
      "total_reactions": 3,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "If you're a fan of The State or any of David Wain's other films (\"Wet Hot American Summer\", \"The Ten\", \"Role Models\"), you'll love this one. Justin Theroux fills the spot of Chris Meloni quite nicely.  Rudd is amazing, as usual. It was great seeing Ian Michael Black, Wain, and Michael Showalter in their brief appearances.  Hopefully this film will further broaden Wain's appeal (esp after Role Models) so he can make an even edgier and funnier film like The Ten in the near future.  Experimental humor needs a strong comeback. And this is just troupe to do it.",
      "total_reactions": 1,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 2,
        "year": 2012
      },
      "score": 7,
      "text": "Jennifer Aniston and Paul Rudd play a New York couple that ends up living in a Georgia commune loaded with mildly wacky characters. Needless to say, there's plenty of humor at the expense of new age/hippie notions and the duo's comedy chops provide plenty of laughs. There were moments when I wished I could have rewound a few seconds to catch some of the more subtle or quick lines. Overall, the film's not outstanding or ground-breaking, but it's an amusing diversion, especially if you enjoy Aniston or Rudd.",
      "total_reactions": 1,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "Just what I expected from a David Wain movie. A simple story where reality is just that out of the norm, a lot of funny bits through out the movie and just an enjoyable experience all together. If you liked his previous movies you should be good with this one.",
      "total_reactions": 1,
      "user": "davor"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "Writer director David Wain (WET HOT AMERICAN SUMMER, ROLE MODELS) once again teams up with Paul Rudd to deliver a hilariously offbeat comedy in WANDERLUST. Rudd stars as George, an overworked Manhattan business type who has just moved into an incredibly expensive apartment with his wife, Linda (Jennifer Aniston). Unfortunately, tragedy strikes just as they're finally beginning to settle in - Linda fails to sell her documentary to the executives at HBO, and George finds himself unemployed when the feds swoop in and shut down the company he works for. Unable to afford their big-city lifestyle, they pack up their belongings and head south to live with George's brother, Rick (Ken Marino). Along the way, they find themselves at Elysium, an \"intentional community\" of free spirits where Bluetooth headsets and business meetings are replaced by hallucinogenic drugs and impromptu acoustic jam sessions. George and Linda are captivated by their colorful new acquaintances, and after a bizarre series of circumstances, the Manhattan couple begins settling into a lifestyle they never imagined. Most of the humor is derived from George and Linda's interaction with the residents of Elysium, including Wayne (Joe Lo Truglio), a budding novelist (and nudist); Seth (Justin Theroux), the alpha male who has been detached from modern society for entirely too long; Eva (Malin Akerman), the flirty young blonde that wants to teach George all about free love; and Carvin (Alan Alda), the aging, irritable patriarch of the group. There's also a scene-stealing performance from Michaela Watkins as a bored Atlanta housewife that features some of the film's most quotable dialogue. While WANDERLUST is paced well and contains plenty of hilarious moments, there are a few scenes that could've used some tightening up, particularly a lengthy monologue during which George practices his seduction techniques in the mirror. Paul Rudd is an incredibly talented comedic actor, but not talented enough to keep this scene, and the one that follows, from being anything but painfully awkward and embarrassing. This complaint is minor, however, when you consider how consistently funny WANDERLUST manages to be. Wain has knocked it out of the park with this one, delivering a quirky, original film that is unlike any comedy you've seen before, and contains more laughs than I've had in a long time. --www.nerdrep.com",
      "total_reactions": 1,
      "user": "brent_hankins"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "Wow I wasn't expecting much and loved this movie. Wall to wall laughs, Rudd was hysterical, Aniston surprised me - she fit right in with this amazing cast.  And the story moved me...it's a real wish-fulfillment fantasy that we all have about throwing it all away and trying out a new life.  But most of all it was one after another of funny scenes with the two stars mixing it up with Alan Alda, Malin Akerman (who's also so sexy), Justin Theroux, Joe Lo Truglio, etc, etc. Going to see it again this weekend.",
      "total_reactions": 1,
      "user": "CharlesWitter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "Definitely worth seeing just for the sheer fact of poking fun at the hippie, rainbow coliation lifestyle. \"money buys nothing\" great line which sums up the philosophy of these free love, non working hippies and a good opposite depiction of extreme other lifestyle where money is everything. The most i've laughed out loud in a movie in awhile and mostly from the supporting cast not Rudd or Anitson. More movies could be made disussing the topic of dumb hippie philosophy as well as the equally obsessed gold diggers who will stop at nothing to aquire cash no matter who they hurt along the way.",
      "total_reactions": 1,
      "user": "SeanMcGunnigle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 3,
      "text": "This movie is both predictable and unfunny. Although I had one or two laughs while watching it, I watched the majority of this movie with a raised eyebrow. It misses the mark on almost every occasion. Also worth noting: The trailer already spoils the best jokes, and due to trailer editing, the jokes are even better when seen in the trailer.",
      "total_reactions": 1,
      "user": "Archalol"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "This movie was hilarious.  I am a bit perplexed about some of the lower scores from the users on this one.  Someone probably just made love to their wife in the other room.",
      "total_reactions": 5,
      "user": "pete409"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2012
      },
      "score": 6,
      "text": "While Wanderlust has a fun premise, uptight New Yorkers adjusting to a hippie commune lifestyle, it doesn't know what to do with itself at the halfway point, and the story falls back on cliches; evil land developers want to build a casino on the property, and one of the commune members betrays the commune, heralding the arrival of the third act.    In better films, it's less bothersome, but here, it becomes clear that the premise has worn thin, and it's time for the movie to wind itself down.  Furthermore, George and Linda are little more than caricatures, and the story is little more than a clothesline on which to hang sketch comedy.    The good news:  the sketch comedy of Wanderlust, the film's raison d' etre, is quite good.  It has an oddball, goofy sense of humor, and most of the gags hit their mark.  I don't laugh easily.  I laughed a lot in Wanderlust.  As a story, it is flawed, very flawed, but Wanderlust is still funny, and that's what you're there to do in a movie like this.  Laugh.",
      "total_reactions": 4,
      "user": "DanielOnFilm"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2012
      },
      "score": 0,
      "text": "Unbearable. The insipid and lackluster plot is almost as bad as the complete lack of a single character worth giving a **** about. I don't understand how this crap-on-a-reel made it out of production. Not remotely funny.",
      "total_reactions": 2,
      "user": "austenite"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2012
      },
      "score": 2,
      "text": "This was a horrible movie. Both my husband and I are fans of Rudd and Aniston, however this movie was a disappointment. We contemplated leaving and asking for our money back but gave the movie the benefit of the doubt. Not worth seeing at all.",
      "total_reactions": 2,
      "user": "Moviegrl"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 1,
      "text": "Stabbing my eyes with rusty nails would be more fun then sitting through this.  Love Paul Rudd but, hated Anniston.  Avoid this movie if you can.  If you must go bring a pillow for a nap",
      "total_reactions": 3,
      "user": "Meri19"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "I walked out of this stinking wretch of a movie. Really like Paul Rudd too. How doe something like this even make it into theaters? I've had it with going to comedies unless they have the buzz of Bridesmaids because I've been burned too many times",
      "total_reactions": 3,
      "user": "dahlineric"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 2,
      "text": "The stupidity and gross-out humor outweighs the wit and social commentary so heavily, that it becomes one of those movies that seems incredibly fun to film, but a bore to watch. Too bad, I really like both Jennifer Aniston and Paul Rudd, and I also had high expectations for Justin Theroux, who out-shined both the leads.",
      "total_reactions": 4,
      "user": "DanSir"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "Although there are moments of strong hilarity, \"Wanderlust,\" just doesn't have anything carrying its weight; it feels muddled together, unbalanced, disjointed, and inevitably wavers hesitantly. The film's only sense of support is from Rudd, who continues to posses a naturally occuring, acquiescent benevolence about him that is very much commendable. Contrarily, though, the film is pretentiously vulgar, laden with flopping, full-frontal nudity, and slovenly ribald humor. The result, presented satirically, is a 98 minute uncensored, extended-cut SNL skit that thinks its funnier than it actually is; what it \"is,\" being complete hokum.",
      "total_reactions": 2,
      "user": "FDT44"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2012
      },
      "score": 6,
      "text": "This movie has lots of duds and the hits aren't satisfying enough to make up for it.  Also, it feels soooo long.  I was checking my watch for what felt like the last 2 hours of the movie. Love the cast and David Wain, and am looking forward to what comes next.  Hopefully Wanderlust makes enough to give everyone a shot at making another great movie together (something the caliber of \"Role Models\")",
      "total_reactions": 1,
      "user": "ZenRobot"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2012
      },
      "score": 2,
      "text": "Did you see the previews? Yes? Then you saw the funny parts.  I didn't know who I was supposed to care about during the movie.  And then about, 3/4 of the way through, they seemed to remember that movies generally have an antagonist and wrote that in.  Not one of the characters had any depth, and most of them were so unbelievable (even for a comedy like this) that I could never lose myself in the moments.",
      "total_reactions": 1,
      "user": "thelivingendx"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "Bad humor, bad acting, bad plot. I imagine the laughing that people heard was from the audience laughing at how bad the jokes were. You know that laugh you laugh because something is just so unbelievably dumb.",
      "total_reactions": 1,
      "user": "micha"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2012
      },
      "score": 4,
      "text": "Seated at a table in the wee hours of some Las Vegas casino coffee shop, David Howard bemoans the fact that his wife has just lost their \"nest egg\", comparing the situation to a Twilight Zone episode, a hypothetical one where Linda gambles away their life savings on 22, the number she bets compulsively on at the roulette wheel. Now their life is really like Easy Rider, Winnebago notwithstanding, because the yuppies are flat broke. The once-consummate power couple, who dropped out of society to find themselves, can't find any hippies, let alone, a commune, in Lost in America, but instead, resides at a trailer park inhabited by aging pensioners. Linda informs David that while combing Safford Court, she discovered a \"sweet little creek\" at road's end, and if it was 1967(and not 1986), that creek would have been teeming with skinny-dipping \"flower children\", and as for the \"garden three doors down\", nothing stronger than carrots, nothing with medicinal or recreational purposes, probably rules that patch, as David overhears an elderly gent outside their trailer home worrying about the sight in his right eye. In vain, Linda tries to play the part of the free spirit, but the husband, better than his wife, realizes that their time to be bohemians has passed. Ironically, the only Easy Rider fan that they encounter is an antithetical one; a motorcycle cop. Loosely folowing the template laid down by the Albert Brooks film, George and Linda, in Wanderlust, go underground, but their foray into oblivion isn't premeditated as was the Howards. Like The Twlight Zone, the NYC couple's excursion into uncharted territory occurs through the luck of sheer happenstance, when the weary travelers, en route to Atlanta where George's obnoxious brother lives(due to the double whammy of HBO passing on Linda's penguin snuff film and the feds raiding the office that employed her husband), stop at a bed and breakfast which turns out to be a hippie commune. Movie references abound at Elysium, in particular, \"Together\", the 2000 Swedish film about a likeminded collective, with the main difference being the time appropriateness of such a utopia, just barely though, since the film takes place in Stockholm circa 1975, a transitional period for most idealists, stateside, that is, but David, to his great consternation, missed out on the counterculture, whining to his boss, \"I used to make fun of my friends in college who went out to find themselves,\" choosing instead the business route. Eight years later, eight lost years, in David's estimation, would place his hiring at the company he's just been fired from, around the mid-seventies. Easy Rider(1969), the film that inspires David's male menopausal-inspired journey, perhaps, made its trans-Atlantic debut late, hitting the Swedish moviehouse circuit at a time when the rebel film about resisting authority had already gestated in the minds of many young Americans, who were by that time, embracing free enterprise, not free love. Unlike the Howards, George and Linda can't afford a $450,000 house; they can't even afford to make the payments on a recently purchased micro-loft, which is commentary in itself, through the juxtaposition of the booming eighties with our current recessionary times. Wanderlust is a luxury for the Howards; for George and Linda, wanderlust is a matter of survival. As if mirroring their accidental lives, the car overturns, putting the stranded couple in contact with Kathy, the desk clerk, who knows how to say, \"Good evening,\" in Swedish, and makes a dated Beatles joke in relation to George's name(\"...where're John, Paul and Ringo?\"), thereby creating an estrangement effect, in which not only time gets manipulated, but moreover, place, since this direct reference to the Lukas Moodyson film transforms the commune(alluded to as an \"intentional community\" beforehand) into an intentional Sweden. Despite the lack of a theoretical framework that explicitly spells out the political rhetoric of this nonconformist society, it's not hard to image a celebration breaking out when Ronald Reagan died, similar to the one in Together, when Goran, Tillsammans founder, learns about Francisco Franco's passing over the radio, setting off pandemonium in the tiny household after he relays the good news. After all, Reagan once was quoted as saying that \"fascism was really the basis for the new deal\" in 1976. While George plays \"Two Princes\" at an impromptu front porch hootenanny, the moviegoer can interpret The Spin Doctors as a code for the rhythm guitarist's conservatism. Seth, representing socialism, outduels George, putting capitalism in its place. But Seth's virtuosoship lays bare his fraudulence. He doesn't share the spotlight; he hogs it, in which the guitar solo acts as a power metaphor. Seth is phallocentric, as most hippies are, whereas Goran seems more middle-class than a late-sixties refugee. He demands monogamy out of Lena.",
      "total_reactions": 0,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2012
      },
      "score": 5,
      "text": "you have to give a movie like this credit. you can tell that it really does want to be funny and everyone in the movie is committed, but unfortunately it fails. the first 30 minutes are quite funny but after that starts it starts to go downhill. the jokes become stall and drawn out. and at some points have you feel uncomfortable (but not \"the office\" kind), especially the mirror scene and the Malin-Rudd scene. and Justin Theroux seems more like he is doing an impersonation rather than a well thought out character. there are however a few good things in this movie, Ken Marino (the brother) Joe Lo Truglio (the nudist) do a great job. but in the end the movie is just another formulaic com-com, that has nothing that makes it stand out from the rest and rather disappointing considering how well Rudd and Aniston were in \"The Object of My Affection\".",
      "total_reactions": 0,
      "user": "pinattar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "It's not quite \"Wet, Hot, American Summer\" and it's not quite \"Bridesmaids,\" but it is hella funny.  Best prosthetic penis since Dirk Diggler.   Not as quotable as some of the recent big-hit comedies, but just as funny.   My entire commune loved it.",
      "total_reactions": 0,
      "user": "BUTCHYPIE"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "A very funny movie, but one that is kind of lacking. Paul Rudd and Jennifer Anniston don't make a believable couple at all, which hinders part of what they were going for. But even though it's not perfect it still kept me laughing throughout, and that's what's really important when watching a comedy. Recommended.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "Wanderlust was a funny and an enjoyable ride of a film. Paul Rudd and Jennifer Aniston, although they seem to be a strange couple in general, both had good performances in this movie. It got a bit ridiculous at times like when Paul Rudd went on for over 5 minutes about what he was gonna do with his d**k. All-in-all it was an enjoyable film. It had its flaws but it made up for them in fun and laugh out loud comedy. I'll give Wanderlust a 6/10.",
      "total_reactions": 0,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "David Wain's Wanderlust has a lot of flaws, but it also has a lot of laughs.",
      "total_reactions": 0,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "Wanderlust  neither a \"Ha-ha\" funny movie nor a bad comedy . It just an average comedy with good actors , good story but little amount of jokes . Paul Rudd's performance in this movie was really good and he was only the real funny man in the movie . Eventually he took he through the end . The base story of the move seemed good but They could make it a lot funnier . There were so funny moment in the movie that i laughed so hard but at the end it felt like many-thing was missing .",
      "total_reactions": 0,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2012
      },
      "score": 5,
      "text": "While occasionally funny, it sometimes isn't very believable. The script is organized until the final 25 minutes of the movie. At that point the script is completely out of hand.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 1,
      "text": "Wanderlust is hands down one of the worst movies I've ever seen in my entire life. I'm a huge Paul Rudd fan but not even he could save this crapfest. And honestly, how does Jennifer Aniston get movie roles? If there is a more overrated actress out there, I can't think of one.",
      "total_reactions": 0,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "One of the funniest movies I've seen in a while. Like Pete, I can't quite understand how some users scored it so poorly, but oh well. It was hilarious. Go to the theater, buy it, rent it, whatever...just watch it.",
      "total_reactions": 0,
      "user": "RSK"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2013
      },
      "score": 4,
      "text": "Wanderlust is a film with no meaning. It is a film that has 1 or 2 scenes of true satire and the rest is a bunch of hippies running around naked smoking pot. Too dumb to even laugh at sometimes.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "If Lisa Schwarzbaum says its good watch out because this movie is ****  The screenplay is so bad even Paul Rudd can't help turn this turd around.  Don't watch!!!",
      "total_reactions": 0,
      "user": "Jason101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2012
      },
      "score": 6,
      "text": "Judd Apatow(producer), Paul Rudd, Jennifer Aniston. They were the only reason why I watched that movie. It's charming, funny. But keep your expectation low.",
      "total_reactions": 0,
      "user": "dincturk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2012
      },
      "score": 4,
      "text": "Wanderlust has moments where it works and is actually very funny, but those moments come inconsistently and, for most of the film, the rest of the bits fall short. The gag reel near the end is by far the best part of the movie (aside from a scene involving a stampede of nudists in slow-motion) and I can't help wishing the preceding hour-and-a-half had been similar. All of the actors seem to be trying to sell zaniness for the sake of being zany rather than achieving genuine pathos and character development with a blend of raunch. Justin Theroux is surprisingly funny, but the rest of the characters and their bits don't feel funny enough to warrant their time in the movie. All-in-all, Wanderlust is just a casual comedy that has some good gags but on the whole is far from a comedy classic.",
      "total_reactions": 0,
      "user": "TheDRauch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2012
      },
      "score": 0,
      "text": "This movie was simply the worst possible scenario that could be envisioned for human existence. Absolutely the most immoral film I have ever seen. Sad to think that there are actually people who think things such as that are acceptable.",
      "total_reactions": 0,
      "user": "GregoryMorrison"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2012
      },
      "score": 9,
      "text": "I love raunchy comedies and this was no different than any other.  21 jump street had more raunchy and crude humor, but this had enough to make it funny.  What's not to laugh about Paul Rudd trying to take a crap in peace when the hippies sit there and wait for him to poo?  It's hilarious.",
      "total_reactions": 0,
      "user": "bpmike83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 11,
        "year": 2012
      },
      "score": 3,
      "text": "I was expecting good things from this movie with so many good people behind it and with Rudd and Aniston starring, but it left me wanting more. A lot more. Wanderlust had potential, but it didn't bother trying to collect.",
      "total_reactions": 0,
      "user": "cameronmorewood"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "A perfectly watchable, convenience-ridden romp with very strong comedic work from both Rudd and Aniston. It may not be David Wain's finest comedic triumph, but it delivers some solid laughs.",
      "total_reactions": 0,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2012
      },
      "score": 5,
      "text": "I personally liked this. I enjoy Jennifer Aniston and Paul Rudd and they carry the film nicely. The commune bits were cliched, but the supporting cast has a lot of fun in their roles, making those moments and the film as a whole a very entertaining experience. You'll see a lot of dick, but overall this is a good comedy that is funny throughout.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2013
      },
      "score": 1,
      "text": "Personally, I believe that Hollywood have run out of ideas with this movie. From what I gather it is a pointless excuse to show a bit of nudity. The claim of comedy is laughable within itself, since I didn't find it to be remotely funny. The only saving grace of this movie for me is Jennifer Aniston, being that I find her acting to be good, even if her choice of projects isn't.",
      "total_reactions": 0,
      "user": "Poe21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "This movie just didn't deliver enough. I saw this movie and thought that it would be a good movie especially with Paul Rudd but sadly it wasn't. After watching through this movie I found it very dull and boring though you'll get a few occasional laughs. Paul Rudd and Jennifer Anistons characters are together in a relationship though it feels like they know nothing about it each other. At all. The characters in this movie weren't interesting nor were they relate-able at all. The movie itself feels like it just wears out and wastes a lot of time. Actually the part I found the most interesting was the end with the gag reel. That was the strongest part of the movie and it is only a few minutes long. I just found the movie dissappointing and felt so bored throughout it waiting for it to end.",
      "total_reactions": 0,
      "user": "Seyyoshi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2013
      },
      "score": 6,
      "text": "A funny film, but not as funny as David Wain's previous film Role Models.  Paul Rudd continues to show a very funny on screen presence and he alone gives this film a mild recommendation.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 7,
        "year": 2013
      },
      "score": 7,
      "text": "There is a special place in my heart for Hollywood budget films that look and feel like indie films. Wanderlust fits perfectly into that genre, along with many of Paul Rudd's recent projects. This film is well written, has interesting characters, and hits upon problems that many people can identify with. Though you may not be a nudist, a hippie, or a person that believes in free love, Wanderlust has something to offer. Whether it be learning to be yourself or discovering what the meaning of life is Wanderlust will leave you with a warm feeling. If you're into indie films I highly recommend this film.",
      "total_reactions": 0,
      "user": "Luke_McLaughlin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 3,
        "year": 2016
      },
      "score": 5,
      "text": "I thought that Wanderlust had a pretty interesting premise for a comedy movie and Paul Rudd and Jennifer Aniston are both pretty interesting names when it comes to comedy. It just isn't nearly as funny as it should be. There are even some points in this movie feel like behind the scenes bloopers. The cast is full of several notable names in the supporting cast. I liked the look of Justin Theroux's character and he did have a few funny moments but he was not nearly as funny as he could have been. The conflict in this movie is a little too major for the resolution as well. It feels a but like the ending was a little convenient.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2015
      },
      "score": 2,
      "text": "It looks like what this movie was missing was the poster itself...they didn't seem to have too much fun and other than the puts my dick in scene and yelling out things that make you angry it wasn't very impressed...I did watch it twice but I don't like anything that reminds me of the show MASH sorry......-JRA",
      "total_reactions": 0,
      "user": "CameraBounceGod"
    }
  ]
}