{
  "mc_avg_user_score": 8.6,
  "mc_metascore": 71,
  "mc_mixed_rating_frequency": 25,
  "mc_movie_name": "Warrior",
  "mc_negative_rating_frequency": 11,
  "mc_positive_rating_frequency": 396,
  "mc_pro_critic_reviews": [
    {
      "critic": "Dan Jolin",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2011
      },
      "score": 100,
      "summary": "It hardly rewrites the rulebook, but Warrior is a powerful, moving and brilliant sports-pic-cum-family drama. Like \"The Fighter,\" but with kicking."
    },
    {
      "critic": "Alison Willmore",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2011
      },
      "score": 91,
      "summary": "For all its titular bravado, Warrior never lets the audience forget the economic and spiritual desperation driving its two main characters, who bleed for the screaming arena crowd in exchange for their shots at redemption, and offer a rare glimpse of soul in a type of film that usually isn't obliged to provide one."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2011
      },
      "score": 91,
      "summary": "Warrior is a surprising gut punch, a modern-day \"Rocky\" saga with two mixed martial arts pugs trying to beat, choke and kick the system."
    },
    {
      "critic": "Jen Yamato",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2011
      },
      "score": 90,
      "summary": "One of the most heart-wrenching and deeply felt films of the year."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2011
      },
      "score": 90,
      "summary": "It is appropriately blunt, powerful and relentless, a study of male bodies in sweaty motion and masculine emotions in teary turmoil."
    },
    {
      "critic": "Kirk Honeycutt",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2011
      },
      "score": 90,
      "summary": "It's a long movie that feels short: It grabs you in early scenes, intense though low-key before all hell breaks loose, then keeps you riveted to its mostly male characters."
    },
    {
      "critic": "Calvin Wilson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2011
      },
      "score": 88,
      "summary": "Starts out so promisingly that it's a huge disappointment when it ultimately becomes way too predictable - and unbelievable. It's as if \"Raging Bull\" suddenly morphed into \"Rocky.\""
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2011
      },
      "score": 88,
      "summary": "O'Connor gives the film a dark, moody look, which is the best choice for so many roiling emotions. This is not a traditional stand-up-and-cheer fight movie; the undercurrents are too strong and deep."
    },
    {
      "critic": "Andrea Gronvall",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2011
      },
      "score": 80,
      "summary": "This high-powered sports melodrama benefits from its strong male leads, a sinewy narrative, and the maverick attitude of MMA. But for all the contemporary references, it's essentially a spin on the story of Cain and Abel, which may be the reason it feels timeless."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2011
      },
      "score": 80,
      "summary": "It's a surprisingly moving film. While the fight scenes are unquestionably thrilling, the movie's best bits are not about winning and losing but about pain and, ultimately, forgiveness."
    },
    {
      "critic": "Nick Pinkerton",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2011
      },
      "score": 80,
      "summary": "Old line-gargler Nolte remains an effortlessly moving presence, while Hardy and Edgerton embody their archetypes and handle the physical demands."
    },
    {
      "critic": "Kate Erbland",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2011
      },
      "score": 80,
      "summary": "Though Warrior excels at the big stuff-fighting sequences and rousing crowds and victories that all but force audiences to stand up and cheer - the film is at its very best in the small moments, the little looks."
    },
    {
      "critic": "Joe Leydon",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2011
      },
      "score": 80,
      "summary": "An improbably effective and affecting mix of raw emotions and exciting smackdowns."
    },
    {
      "critic": "Stephen Cole",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "Warrior is a weirdly affecting hybrid, a 100-proof melodrama that's two-thirds Sylvester Stallone and one-third Eugene O'Neill. Think Rocky's \"Long Day's Journey into Night.\""
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "This is brutish, visceral stuff - a type of raw-meat violence that's undeniably cinematic but seems, to this worried parent, ill-fitted for PG-13."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "Warrior is a relentless, emotionally engaging family drama and underdog saga with touches of \"Rocky\" mixed with \"The Fighter.\""
    },
    {
      "critic": "Read full review",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "The catharsis Warrior offers in the end is hard won, and it will take a steely viewer not to find it gratifying, however over-the-top it may be."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "Warrior aspires to myth. It's Cain and Abel battling it out in the face of a decidedly ungodly father before humanity goes down for the count. Strong stuff."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "The two leads, Edgerton and Hardy, pull off their respective roles - rising above the cliches and the melodrama - with ferocity and focus."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "The film is a brutally effective, insanely rousing piece of drama, with enough new wrinkles and ferocious acting to sweep you into its clutches."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "This is a rare fight movie in which we don't want to see either fighter lose. That brings such complexity to the final showdown that hardly anything could top it - but something does, and Warrior earns it."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "It overcomes inescapable boxing and martial arts clichés and leaves you thoroughly sated, energized and wanting more."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "Warrior is a straight genre picture, a fight movie of the old school. But it's a mixed martial arts tale, and as such, it's the best MMA movie ever."
    },
    {
      "critic": "Nick Schager",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "O'Conner continues to exhibit a deft knack for melding interpersonal drama with\r\nathletic competition in ways that, despite his tales' clichés, earn their\r\nmelodramatic manipulations through genuine empathy for characters' plights."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2011
      },
      "score": 75,
      "summary": "Mostly, Warrior is a showcase for its up-and-coming stars. Edgerton, from last year's \"Animal Kingdom,\" and Hardy, who stole scenes as the identity forger in \"Inception.\""
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2011
      },
      "score": 67,
      "summary": "Warrior becomes increasingly shameless until, by the end, with the big fights fought, we are clearly meant to rise as one and applaud the indomitability of the human spirit. But the only indomitable thing about Warrior are its clichés."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2011
      },
      "score": 67,
      "summary": "Warrior resists many opportunities to seal an easy resolution, and for this you remain with it until the final punch."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2011
      },
      "score": 63,
      "summary": "This is bench-press melodrama, and it's as manipulative as anything Bette Davis or Jane Wyman ever starred in. You can't abide the shamelessness of any of it."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2011
      },
      "score": 63,
      "summary": "Every time you start resisting, somehow the film makes the sale, again."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2011
      },
      "score": 60,
      "summary": "Has moments of power that push through a fake-out script."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2011
      },
      "score": 60,
      "summary": "It shows promise but finally hits things so hard, both literally and metaphorically, that it's hard not to feel pummeled yourself by the time it's over."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2011
      },
      "score": 60,
      "summary": "Yet it still works like gangbusters - tears will be stifled by the end of the sibling vs. sibling finale - and most of the credit should go to Hardy, Nolte and Edgerton."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2011
      },
      "score": 50,
      "summary": "Warrior's three principle characterizations are compelling - Nolte in particular gives a tempered performance as the shambling, sad-eyed wreck of a dad - but not enough to mask the film's lesser elements."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2011
      },
      "score": 40,
      "summary": "O'Connor chucks away everything that was interesting or dark or subtle in Warrior and replaces it with a pseudo-individualist, sub-Freudian, Tea Party-friendly fantasy."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2011
      },
      "score": 38,
      "summary": "A cheap exploitation picture wrapped in miles and miles of stale would-be Oscar scenes."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "You have to see this movie! It's a really compelling movie and executes it's emotional scenes very well and at times in the movie, you cheer for both brothers. Eventually throughout the movie, you get an idea of who's going to win but it's still satisfying to watch and this is such a great movie with great fighting and great performances by Tom Hardy, Joel Edgerton, and Nick Nolte.",
      "total_reactions": 3,
      "user": "Comasi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "For a movie set in the world of MMA, it's remarkably dramatic and touching. Yes, it goes a little overboard with the extreme close-ups, and the scenes involving Nolte over the last half hour of the film could have been reworked, but Hardy & Edgerton are fantastic.  I'm amazed that the fighting looks as real as it does - the days of the \"Rocky\" pulled punches which look mega-fake are over.  No, you don't see everything, but you don't get lost in the closeness of the action.  Yes, the movie is a touch long, but it's absolutely worth seeing.  I'm a little mystified that it didn't do better than $5mil on opening weekend.",
      "total_reactions": 2,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "I wasnt sure at first when i saw the previews for this movie, how it was going to be. I saw te good reviews on here and from working at my local regal theater and seeing everyone come out of this movie pleased and raving about how good it was, i figured hey, why not. So i just saw it and wow! Was i blown away. I loved this movie, it started off a little slow but dont get me wrong, every scene played a big part in the overrall feel of the movie. Their was so much drama and heart packed into this film. You must go see this. You will love it. I wanted to cry, and i wanted to cheer, their were so many different emotions in thks one movie. Dont shy away from the long running time, it is so worth it, its one of those movies where you hate it because of the way you feel for the characters but then you love it at the same time. This is the best movie of september hands down, doesnt matter what else is coming out, Warrior is here now and it is damn good. On another note im really glad to see Tom Hardy fit for his role as Bane in Christopher Nolans final entry into his highly successful Batman trilogy. Anyways, Tom Hardy was excellemt, Joel Edgerton was excellent, and not familiar with the actor of the fathers name is but he did an academy award nodded performance. I will be upset if this movie doesn't get any Oscar nominations, it deserves ateast one. Go see this movie, you'll love it....and hate it, haha. Definitely 10/10 stars for sure.",
      "total_reactions": 2,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "LOVED THIS MOVIE!  I am a 49 year old woman whose sport tastes usually only include dancing and couples figure skating, but this movie was awesome!  First half is character/story development, with great performances by Nick Nolte and others; second half is pure gripping your theater seat armrests!  Haven't enjoyed a movie like this since the first Rocky!  Women, go see this with your men!  The story is awesome and heart wrenching (in addition to the fighting).  I only originally went because my boyfriend wanted to see it, and it ended up being the best movie I've seen in months!",
      "total_reactions": 1,
      "user": "Raygirl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "That a great movie, perfect, spectacular, which is to make you feel so many emotions in an instant. great game with the cameras, directed by and starring excellent, so good, exciting.",
      "total_reactions": 1,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "This is a superb movie on so many levels.  Great performance by Nick Nolte, and I usually don't go for him.  It is violent, at times, but it's the complex family relationships which are the real theme here, not the fighting.  I'm not a fan of fighting of any sort, but I really enjoyed this movie.  It has an ending which will make you glad you saw the film.  Great performances also by the two brothers in the film.",
      "total_reactions": 1,
      "user": "bethesdabob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "Gripping movie with a great caste. The film does a great job at building up the fights by slowly filling in the blanks of the the two brothers past. The fight scenes are also realistic and intense.",
      "total_reactions": 1,
      "user": "tstpeter"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "Brilliant movie. Brutal, visceral action and heart wrenching drama. Quite possibly my favorite movie of 2011, it had me on the verge of tears and I really was cheering for these characters. At no point did I find myself uninterested with this movie. The performances were great all around. It even has a Rocky-esque montage sequence! You owe it to yourself to see this movie.",
      "total_reactions": 1,
      "user": "jtb1137"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "Different, but still holds, Warrior is just another fighter movie but within the MMA. It is almost hard to watch in the last round, where one brother won't go down, well, without a fight. And of course, you can't have a sports movie, without a montage sequence. It goes by faster than you think, but surrounded with Beethoven's \"Ode to Joy\". This film had some great character development, but it was a little hard to catch why the two brothers are mad at each other in the first place. That should of been stressed more throughout the film.",
      "total_reactions": 1,
      "user": "TheWhiteStripes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "A  MUST SEE. Not your typical fight movie, but a highly compelling story of family strife, emotion and painful resolution. The characters are RAW, REAL, and ultimately HUMAN.",
      "total_reactions": 1,
      "user": "JENCASH"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "Best movie. Mens and boys who have brothers can truly understand the point of this movie. In the end of the movie even the hardest guys will cry some tears.",
      "total_reactions": 1,
      "user": "Rainer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "Being a huge MMA fan i was a little bit nervous to watch this film, i was extremely disapointed with the movie never back down and thought this movie would make MMA look like a joke again, but i have to say i was extremely impressed by this movie, it delivered on all levels, story, emotion, and a real take on MMA fighting, must see movie for MMA fans or just fans of good movies!",
      "total_reactions": 1,
      "user": "Protectereli"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "Great great movie. I didn't expect too much from this, but it delivered a wonderful emotional story I really felt, as well as incredibly realistic fight scenes. 10/10",
      "total_reactions": 1,
      "user": "Riptide"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 1,
        "year": 2012
      },
      "score": 8,
      "text": "You know going in that there is going to be an impossible scenario where the brothers meet in a winner take all fight. What you don't know is that this is a surprisingly touching movie. The acting is wonderful, including a standout performance from Tom Hardy. Nolte turns in his best performance in years, and the Conan O'brien look-a-like Edgerton turns in a strong performance as well. The film is a gripping example of the human condition as well as a touching story of redemption.",
      "total_reactions": 1,
      "user": "trujustin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "One word \"EPIC\". By far tom hardy's best performance, not too mention Nick Nolte, who is also amazing in the movie.  This movie keeps you at the edge of your seat, its shocking, emotionally charged, and entertaining.  I highly recommend anyone too watch this film, you will not be disappointed. Great acting, great directing, and a very intriguing story.  MUST WATCH!",
      "total_reactions": 1,
      "user": "drock1316"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "A story unlike any other that seamlessly blended a story of a broken family and action packed punches for the MMA crowd. See it with someone in your family that you have a broken relationship with if possible.",
      "total_reactions": 1,
      "user": "clarkd28"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2012
      },
      "score": 9,
      "text": "I can't think of a movie that strikes me as being better than \"Warrior\" this year. Truly a great movie from start to finish. I'll be honest; when I first picked up the film, I was thinking, \"Just another MMA movie with some no-name actors\". Boy was I wrong. Awesome movie, awesome fight scenes, terrific acting and a superb plot. It was a wee bit long, but I was able to hold my ADD back and finish watching this delight of a film. I score this movie a nine because my ADD got the best of me, but subtract ten or twenty minutes, this is a 10/10 film.",
      "total_reactions": 1,
      "user": "Cynical_Whiskey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2013
      },
      "score": 9,
      "text": "The tension between the father and brothers makes it a very emotional movie. I was expecting a more complete final resolve, but I guess it ended well.",
      "total_reactions": 1,
      "user": "pabloaimar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2013
      },
      "score": 10,
      "text": "My favorite film of 2011.  I am not a fan of ufc so when I saw this film was coming out I had no intention of seeing it, but after hearing how good it was I decided to see it.  Wow this movie blew me away.",
      "total_reactions": 1,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 4,
        "year": 2014
      },
      "score": 10,
      "text": "One of the best boxing movie ever. This movie made me scream and shout at moments. Lose yourself in this amazing action based family drama. An awesomely directed movie. And the action seems to be too real. Enjoy this movie. ;)",
      "total_reactions": 1,
      "user": "Ragu"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "I admit, I wasn't too thrilled about this movie going into this movie but I was willing to give it a chance. I felt the same way about The Fighter last year and ended up loving it. Let me tell you, I was so shocked how great this movie was. It has the genres usual clichÃ©s but the movie used them so well and to its advantage that it felt fresh. Sure it's predictable in the end, but sometimes, in this case, it's not about the destination(the ending), it's the journey to get to the destination. Even though this movie was 2 hours and 20 minutes it felt like 20 minutes, pretty fast journey I know, and that's a shame because I never wanted this movie to end. The characters are so great and well-developed that I felt for them throughout the movie, I cared about them, I felt their pain, and the amazing performances from the cast helped contribute to that. Especially Tom Hardy, Joel Edgerton, and Nick Nolte who give outstanding performances. I will be so shocked if not one of them are nominated. Everything else about this movie is just fantastic and hell I even cried twice during the last act of the movie. The action was gripping, the script was great, it was nicely shot especially during the fighting scenes, which I must warn you the camera does get a bit shaky but it's for a reason at least, and the score was just great it really added that extra dept to the scenes. I am not a big sports movie fan but I loved this movie, so even if you don't like sports movie I can guarantee that most of you will love.",
      "total_reactions": 7,
      "user": "Coco890"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "Best movie of the year hands down. Very unique in that it does not have a clear antagonist. You're rooting for all of them each with their own promises to fulfill. Tom Hardy's Tommy is just outstanding, the level of intensity showcased is unbelievably scary. Joel Edgerton's Brendan who is trying to make ends meet as a school teacher moonlights as a fighter in parking lots after hours to provide for his family and Nick Nolte's heart-breaking performance as the willing-to-do-anything-to-make-it-right-again estranged father of his two distant sons. And that barely scratched the surface of their story, the depth of the characters is amazingly rich. The first half of the movie builds the foundation for the brothers, their present lives, their rough childhood and their own motivations to get back in the cage, it's as exciting and entertaining as the fighting scenes itself. There's about 4-5 climaxes in Warrior it's outstanding. Unlike a lot of sports/boxing movies we've seen you feel the high-octane scenes. You're really immersed in the fighting sequences, you feel every punch, every kick, every takedown and every headlock because you care about the characters, you know the journey of how they got where they are and you know all too well their hopes and promises to the people they care for.",
      "total_reactions": 13,
      "user": "MRedzuan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "Good movie but I felt like I was watching Rocky 6.  Soap opera setup for the big match that could only happen in the movies - brother against brother for a 5 million dollar purse, winner take all.  All performances are good but Tom Hardy is the standout.  If it had any originality it would be a great movie but we've seen it all before.  Still, it held my attention and the characters were interesting.  As far as the fight scenes go, get ready for the moving queasy cam.  This director likes the horrible technique of moving the camera around so much you can't always see what's happening.  It's just a lazy technique Hollywood uses to fool the audience into thinking more is going on than your eyes can see.  Overall good but not great.",
      "total_reactions": 2,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2014
      },
      "score": 1,
      "text": "stupid movie and an insult to knowledgable mma fans. A walk-in that just mauls resident fighters at an mma gym? **** Ripping the doors off a tank and disappearing? What a load of **** A highschool teachers with one of the squishiest guards in mma history makes it to the finals and defeats the undefeated Russian machine? This is just blatant flag waving crap!",
      "total_reactions": 6,
      "user": "raporgi"
    },
    {
      "neg_reactions": 14,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2011
      },
      "score": 3,
      "text": "I love UFC so this movie had to score high for me. Raw, MMA, guy story...all the ingredients...But...it fails. No suspense. No story. No tension. No neckhold. Its a Sunday afternoon movie about two brothers and a Dad who had a falling out years ago....About nothing.",
      "total_reactions": 15,
      "user": "MorriBey"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2013
      },
      "score": 8,
      "text": "OK, so I",
      "total_reactions": 1,
      "user": "sundaygrundle"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "Boring, average sport movie. I don't really like the script. But Warrior delivers intense action, powerful acting, and also the great Tom Hardy. The final fight was awesome, I was thrill and almost cry at the same time. It looks like \"Sparta\" than a movie.",
      "total_reactions": 1,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2012
      },
      "score": 7,
      "text": "It definitely stretches plausibility while also trotting out more than a few cliches but Nick Nolte, Tom Hardy and Joel Edgerton make a lot of this work very well in spite of those flaws. The location shooting in Philly and Pittsburgh adds a a lot of needed grit, too. Hardy and Nolte absolutely make this memorable and worth watching.",
      "total_reactions": 0,
      "user": "JUIKER"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "I certainly wasn't blown away as others apparently were. It's often powerful, well-acted, and entertaining, but also a little melodramatic at points and very predictable. The whole winner-take-all element I found to be a little gimmicky, but it also made it dramatic I guess. Nick Nolte  as the father gives the film's best performance. Edgerton as one brother and Morrison who plays his wife are good too. Tom Hardy as the other brother is fine but a bit over the top. The fight scenes are well done, though they overdo the reaction shots of various people watching. I'm mixed, but on balance there's more good than bad, so a generally positive review.",
      "total_reactions": 0,
      "user": "Christopher_G2"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "Great movie. Performances of Tom Hardy, Joel Edgerton and Nick Nolte are all amazing. Plot is really good, considering other MMA based movies.",
      "total_reactions": 0,
      "user": "JamalKing"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2012
      },
      "score": 7,
      "text": "Beyond the fight scenes of unquestionable excitement, one finds a truly touching film about pain and, ultimately, forgiveness.  And with Tom Hardy being one of those actors that consume the screen they appear in surrounded by a fine supporting cast, it is a film worth watching.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "Wow.  Just wow.  This movie is the Rocky for our generation.  Watching a movie like this makes me think how low we set the bar for most movies we go see.  And then you watch a movie like this and go, wow, oh those other movies I watched recently kinda suck in comparison.  The fighting was great, but of course it's the diverse set of characters and what's driving them that really makes you fall in love with this movie.",
      "total_reactions": 0,
      "user": "directguy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "Warrior rises above it's subject matter in the realistic characterization of everyone involved and the Oscar worthy three leads. Tom Hardy, Joel Edgerton and especially Nick Nolte live and breathe their characters. By the end of the climax, (which lasts for a nail biting 40 minutes), you wont care about the factual inaccuracy of whether or not fights would have been stopped, or if fighters could fight so much in so little time because the relationship between the two brothers is so important. Worth seeing if only to enjoy the talents of the three leads and the fantastic fights and cinematography.",
      "total_reactions": 0,
      "user": "TastyJamProject"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "I felt this film gave a particularly special spotlight on the familial drama that drives the passions of the characters here. Everything just seems so deeply personal and you want to root for everyone. Nick Nolte gives possibly the best performance of his career and Tom Hardy is incredibly true with his portrayal of a punk MMA fighter/AWOL Iraq veteran. Edgerton plays the underdog we all love to love and he does a fine job as well. What a great addition to the underdog canon!",
      "total_reactions": 0,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2011
      },
      "score": 9,
      "text": "I decided to watch this movie on a whim. I never saw a trailer for it. I didn't hear anything about it. I just saw the ad for it and decided, \"meh, might as well.\" Best decision I have made recently as far as movies go. The emotional moments are gripping and you feel for the characters, even if their situations are as predictable as they can get (e.g. man fighting to get his family out of financial straits). The story is actually incredibly predictable, and I knew who was going to triumph at the end of it all. The action is fast-paced, and often brutal but enjoyably so. I actually felt my muscles tense up at specific points during the film, even after I had a firm grasp of how everything was going to turn out. I still had to tell myself to relax, because of the intensity of the fights as well as the intensity seem in emotions of the main characters. This movie makes me excited to see more of Hardy in the near future (Dark Knight Rises, anyone?). I have been recommending this film to anyone who is willing to listen to me. This really does give something for either gender as well, because it's not just about a bunch of men beating the sh*t out of each other.",
      "total_reactions": 0,
      "user": "ItsAllPractice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "The first half of the movie is slow but does build the characters up so the second half of the movie is more intense and moving. When the movie does actually get started with the fighting it will have you rooting for the central characters and has some intensely interesting fight scenes. Warrior is well acted and its cast gives very believable performances. The story does resort to using cheap tactics to make the audience feel for the characters, the poor family who cant make ends meet and the husband having to resort to fighting is something we have seen many times in movies like this but the film does make it all work and is entertaining and satisfying. Warrior is a solid watch and worth your time. Recommended.",
      "total_reactions": 0,
      "user": "davenbettridge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2012
      },
      "score": 6,
      "text": "Warrior has some great actors on display and boy do they put everything on the line here, but unfortunately the story and dialogue are some of the most cheesy, cliche stuff I've seen or heard in a long time.",
      "total_reactions": 0,
      "user": "j30"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "Beautiful brutal and brave. I loved this movie. Hardy stands shoulder to shoulder with Nolte in this tale if two heavy hitters. I am not a fan of violence for violence sake and found this really nicely positioned in the field!",
      "total_reactions": 0,
      "user": "Egypt1am"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "Even if you're not a UFC fan, you need to see Tom Hardy in this gripping MMA film before he gets even more roided up as Bane in the 3rd Dark Knight film. He will win an Oscar very soon.",
      "total_reactions": 0,
      "user": "RyanPratt"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "Great movie!  This movie got very intense at the end.  The acting was great and I bought into the characters.  Nick Nolte, Joel Edgerton and Tom Hardy all did a fantastic job with each of their roles.",
      "total_reactions": 0,
      "user": "MovieBuff1101"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "I am not a UFC / MMA fan really I've seen bits here and there but don't go out of my way to watch it. I'm throwing it out there... it's better than any rocky bilge. If you seen rocky film you know the score with what this film entails but it is gripping and engaging to the viewer, I would definitely recommend it. Not perfect and some parts are lacking in dialogue and predictable but the characters are well rounded and you feel for there situations. Overall a good 2hours spent without putting on plastic glasses.  8/10",
      "total_reactions": 0,
      "user": "lowlifegimp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "A wonderfully, well written story! (FYI : I'm not a fan of MMA nor even boxing though I'm a fan of Manny Pacquiao.) My first glance, I thought it's gonna be like The Fighter since this film is about fighting sports and there's a brother relationship. But here, the brothers are against to each other. The film doesn't really spend so much time dealing with their relationship. It mostly goes to the father of the main leads. Tom Hardy (Tommy Conlon) delivers a moving and emotional performance of a man who has suffered greatly from the ones he loves, and from the field of battle, an all to real reality for people of today. While the younger Tommy suffered the loss of his mother firsthand, his older brother Brendan (Joel Edgerton)has put together a life that a man dreams of, yet is still haunted daily by his past. Only to have it threatened to be destroyed by the bank. Nick Nolte the alcoholic father of the two, has suffered years of remorse and regret from the abuse of alcohol and the neglect of his wife and children is trying to forge a bond but is meeting a stone wall with both of his sons. The fighting, though it is very well acted and shot, is not about fighting. It is the physical representation of the struggle between the three men, the struggle to forget and forgive and to move on. The demons that possess all three of these men are of such great proportion, the only way they can be relinquished is for them to come together. Definitely a must see movie this year!",
      "total_reactions": 0,
      "user": "moviekretik"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "This is definitely one of the Best movies of the year. The actors in this movie played there roles brilliantly, Tom Hardy probably played his role the best. Tom Hardy played a serious, aggressive character \"Tommy\" who's in it to win it, and won't stop until he gets what he wants. Joel Edgerton plays as \"Brendan\" who is Tommy's brother in the movie, who is a school teacher trying to provide money and food for his family, then he decides he wants to fight in a parking lot because he can earn a lot of money. Nick Nolte another brilliant actor, played as the father of the two sons. Who is trying to get the family back together but is on drugs and struggles. The fighting in this movie is Excellent, especially with the addition of former Olympic Gold Medalist, Kurt Angle played his role as a dangerous Russian fighting who doesn't get the chance to talk in the movie, but lets his fighting do the talking for him. Overall, this movie is AMAZING. I would recommend it to anyone who enjoys Sports/ MMA/Fighting movies obviously, and anyone who enjoys very dramatic & Inspiring stories. So even if your not the \"biggest\" MMA Fan i guarantee you will still love this movie.",
      "total_reactions": 0,
      "user": "FilipinoBroskie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "\"A brother's love is... a brother's love\". A stupid sentence from \"Gone in 60 seconds\" comes in suprisingly well for this movie. It's a film that, based on it's premises, should be a complete cliche. And it is. But...but! It builds on it. What you expect to be a cliche, comes as a well served emotional moment.",
      "total_reactions": 0,
      "user": "B3ckett"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "The true power of this movie, is the simple subtle honesty.  It does not try to give great big background stories, or hugely emotional 'have it all out' redemption.  It let you see the pain each character feels, let you guess at some of the experiences these characters had gone through.  Words DONT solve everything, and they certainly dont always help.  Much of our lives and relationships are subconciously built around things Unspoken, and this movie recognises this and therefore makes its interactions more honest becuase of it.",
      "total_reactions": 0,
      "user": "joeline"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "This movie is about two brothers and their inner and outer conflicts with each other and with the world around them. What makes this film special though is where and how they resolve their conflicts: a fight in a MMA tournament.",
      "total_reactions": 0,
      "user": "Cyph0n"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2011
      },
      "score": 9,
      "text": "With great MMA fights and powerful storytelling, \"Warrior\" is definitely a triumph. I really don't know which brother I liked better: Tommy, an ex-Marine with regrets whose trying to make up and repair for it, or Brendan, whose family's welfare rides on his success or failure. You too will face this tough decision in this amazing film.",
      "total_reactions": 0,
      "user": "RenegadeNorman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "Certainly one of the best this year. Great acting. Great stunts. Great shots. Moving. Action packed. Inspirational. Award-worthy.",
      "total_reactions": 0,
      "user": "aozeta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2011
      },
      "score": 8,
      "text": "The first third of Warrior has some of the best blue collar acting, blue collar writing and American filmmaking in decades. Joel Edgerton, Tom Hardy and Nick Nolte give outstanding performances. The last third of the film, which is an MMA tournament is very good, but by that point, Warrior has poured on more plot that ten movies. We know a great deal about these characters. We care. But the plot is thick and heavy. I hope the film finds an audience on video.",
      "total_reactions": 0,
      "user": "SirEddieCook"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2011
      },
      "score": 7,
      "text": "There are parts in the film that are great, The acting is great and Nick Nolte gives a performance worthy of a golden globe/academy award nom. The mma sequences are good as well. However the film features so many plotlines that it confuses quite a few times in the film. It seems that whenever a plotline is answered, Another plotline pops up. It doesnt help that they are so dreadfully generic as well.",
      "total_reactions": 0,
      "user": "spadenx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "Warrior takes elements of the Fighter, Million Dollar Baby, and Rocky and tries to make an MMA film. While the fighting scenes are excellent and the acting is decent and becomes more than decent in the second half, this film still leaves us desiring the first great and classic film about the sport MMA. There is far too little focus on the relationship between the two brothers and many questions are left unanswered as to their falling out and whether the relationship between both brothers are reconciled with the father. Then the fact that the film seemed at times a commercial for Tapout with all of the not so subtle advertisements also downgrades the overall quality of the film. And finally, the final battle should never happened seeing that Tommy should be in military jail as admitted indirectly in the film in itself. Nonetheless, there were moments that were inspiring and the ending managed some emotional impactfulness. All in all, Warrior is  a good movie, but not a great movie.",
      "total_reactions": 0,
      "user": "Alexander_Fred"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "Warrior = Rocky times 2. With the above expectation, the film is great. It has a lot of cliche and there are times I would roll my eyes and think, \"can it be more predictable?\" However, 3 great actors (i.e. Joel Edgerton, Tom Hardy, and Nick Nolte) turn this cliche movie into something much better and a tad more believable. (By the way, I have seen Tom Hardy in \"Bronson\" and \"Tinker, Tailor, Soldier, Spy\"; I don't recognise his face. He's such a chameleon.) Overall, it works.",
      "total_reactions": 0,
      "user": "marioping"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2011
      },
      "score": 6,
      "text": "Outstanding! Lacking in the plot, but fantastic action sequences. The British actor from inception did a poor northern american accent. Over all very satisfied with this film.",
      "total_reactions": 0,
      "user": "monster00"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "Thanks to Nick Nolte",
      "total_reactions": 0,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2012
      },
      "score": 6,
      "text": "A terribly generic sports movie. There is nothing original about this (besides of course MMA being the sport of choice for this film) and that is pretty disapointing. However well done MMA sequences and good acting by the cast (Nick Nolte is amazing in this film) raise this film from a generic sports movie to a watchable and somewhat enjoyable sports film.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2012
      },
      "score": 8,
      "text": "Warrior tells one of the oldest stories in history: a family torn apart that has to reconcile with each other. However, when combining that with the fact that both brothers are mixed martial artists, director Gavin O'Connor presents something else entirely. Absolutely fantastic.",
      "total_reactions": 0,
      "user": "Critic2012"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "I very much liked The Fighter, but I liked this more. I see reviews mentioning its cliches --SO WHAT! They worked well (some great movies have a healthy dose of them), the ending was not completely predictable, and the actors were great.",
      "total_reactions": 0,
      "user": "rcj"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2012
      },
      "score": 8,
      "text": "One of the better heart warming films of the year so far. Nick Nolte and Tom Hardy played really good roles and the story was slightly unoriginal but all in all forget that the emotion and the fighting was really great and  considering the fact that Nick Nolte was nominated for a \"Best Supporting Actor\" Oscar proved that the acting in the film was really great.",
      "total_reactions": 0,
      "user": "a7xfan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2012
      },
      "score": 10,
      "text": "â",
      "total_reactions": 0,
      "user": "AwesomeReviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "One of my absolute favorite movies. A movie that really left me feeling bad ass afterwards. My definition of a good movie is when after watching it, if you're laying in your bed unable to fall asleep, you place yourself in the movie and re-enact it. That's the case with warrior. Watching Tom Hardy clothesline an overconfident made me want to jump out of my chair cheering. I loved the story, i thought the acting was fantastic and i recommend this to anyone over 15. It isn't a family movie, and it certainly isn't a movie for hardcore MMA fans looking for accurate fights. It's one of those movies where you hate it or love it. And i ABSOLUTELY LOVED it. This movie is in my personal Hall of Fame.",
      "total_reactions": 0,
      "user": "YannikF93"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2012
      },
      "score": 9,
      "text": "When I viewed it December 2011, I was hoping for a good performance from Nick Nolte because I'm a steadfast fan, but I was not sure if Tom Hardy and Joel Edgerton could make a good match with Nolte. They outdid themselves; they performed with the skills of veterans, not overreaching and maintaining their respective character's persona. Nolte was obviously perfect for the part; Hardy, of who I am now a fan, is far more versatile than you may think (I've seen several films in which he was supporting actor). Edgerton did hold his own, not weakening the top tier cast (I'm not yet a fan, so am slightly reserved in my praise). The supporting cast, talented and hot looking Jennifer Morrison in particular, did as fine a job with her role as Amy Adam did in 'Fighter', and the rest helped make this movie as good as it is.",
      "total_reactions": 0,
      "user": "HomeReviewer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "Heartbreakingly, FEROCIOUS performances from Tom Hardy and Nick Nolte as the extremely wounded son of and the sort of lovable alcoholic.  Joel Edgerton understated as the older son gives a quiet believable performance.  Fight sequences are exciting and cheer out loud worthy. I have seen this 3 times already and will watch it again.  Can't believe anybody gave this one anything less than a great review.",
      "total_reactions": 0,
      "user": "tracy498322"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2012
      },
      "score": 10,
      "text": "Brilliant movie! So sad but yet so touching, as well. Plus, the UFC fight sequences are so well choreographed that you feel like they're genuinely real. Terrific performances from the entire cast add to the punch of this film. My only complaint is that they had us rooting for both of the brothers, which made the film difficult to watch at some points.",
      "total_reactions": 0,
      "user": "MonsieurEames"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2014
      },
      "score": 8,
      "text": "Absolutely phenomenal film. Great performances, gripping story, and sure, while it may play into some sports movie cliches, it is so much more than that. The heart and pain exuded by the characters is felt by the audience as if it is our own. Great example of how good a sports film can be.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "This movie is highly rated because people have low expectations for this kind of movie.  The acting is good and some of the characters were interesting.   Two things that we don't usually get from this genre.",
      "total_reactions": 0,
      "user": "dysonlu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "Brilliant!!!",
      "total_reactions": 0,
      "user": "Tooms"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "Warrior is a surprisingly emotional film that boasts some great performances, very well staged fight scenes, and an ending that is sure to leave your heart strings tugged at.",
      "total_reactions": 0,
      "user": "Captain_Kirk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "This was a really well done movie. It has a really great story, makes you feel for the characters. This movie is for people who know real life.You can kind of hate this movie if your a guy trying to hold back from feeling to sad lol",
      "total_reactions": 0,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "\"Warrior\" strikingly illustrates that victory is possible in defeat, and it's not what happens during the final bout that defines Gavin O' Connor's picture, but what occurs afterwards. \"Warrior\" is a poignant, touching drama where familiarity with the sport isn't necessary, because ultimately it's not about what transpires in the cage. The movie presents dynamic, strained relationships and the bond of family, coupled with the challenging choices we must make throughout life.",
      "total_reactions": 0,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "Easily the one of the most satisfying films of 2011 as well as one of the best. Joel Edgerton, Tom Hardy, and Nick Nolte are terrific; all three give some of the best performances of 11. An emotional powerhouse that features some brilliant drama sequences that make the film one of the most touching and realistic I've seen in a while.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 5,
        "year": 2013
      },
      "score": 7,
      "text": "Warrior is a great movie  awesome fight scenes  fantastic action  Nick Nolte did a great performance and it was the first movie that i took Tom Hardy seriously as an actor  i mean he did a great performance in inception but he did a spectacular performance in warrior however i didn't feel that the movie had a story behind it  i mean somehow i was waiting for an explanation at the end but it never did  but i did enjoy the movie big time.",
      "total_reactions": 0,
      "user": "ExKing"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "Here you go, another good film of 2011. It seems like an ordinary action/fighting but one must not be deceived by the looks of this film, there's 'Extra' delight in it. warrior features a less-popular cast which includes Joel Edgerton, Tom Hardy, Nick Nolte and Jeniffer Morisson.",
      "total_reactions": 0,
      "user": "Azid_AlexDeSmal"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2013
      },
      "score": 10,
      "text": "This is a very good movie. action in this film are very tense, and deeply moving drama. emotion join the audience watched. the cast is also very good at playing this movie.",
      "total_reactions": 0,
      "user": "iflah"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "Fantastic movie, definitely a must watch. A very nice plot along with some awesome fight scenes. Unlike some other MMA/UFC movies, this was not only focused on brutal action scenes, with a very developed back story, making the viewer very emotionally invested in the film.",
      "total_reactions": 0,
      "user": "Parade"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "Great movie, like the MMA meets Rocky Balboa. The film does a great job with the story with a great cast making it a not so typical sports movie. It does a great job building up the fights by slowly linking the two brothers and their pasts together. Nick Nolte was astounding followed by the great performances of Tom Hardy and Joel Edgerton.",
      "total_reactions": 0,
      "user": "bfoore90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2014
      },
      "score": 9,
      "text": "Sports films are hard to make these days. They’ve fallen into the same trap as romantic comedies and horror movies, in that almost every variation of their plotlines has been done. The ragtag group of underdogs came together and won! Or they lost, but learned a valuable lesson in the process! It’s a problem that all films have to face, but it becomes magnified when it comes to sports films. So how do does a film combat this problem? Well, Warrior’s strategy is to steep its film in realism, get top notch performances from the actors, and above all, understand the sport that the film is about.",
      "total_reactions": 0,
      "user": "niszabo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "Astonishing performances by the lead actors and great story,the movie is unfortunately predictable but it is AMAZING!I am not a big UFC fan but this movie is awesome.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "very nice movie with strong storyline and good moral message.through the hard conversation between the boys and their father.it makes us wonder about what really happened with the family before.sadly,that the main set of this movie have the ended up with the fight between two brothers and as a competition,that have to be the winner of it. after all,it's a lot entertainment in that movie.",
      "total_reactions": 0,
      "user": "ArielRamadhana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Warrior could be the best sports film I have ever seen and what makes it even cooler is that it is not based on a true story like most of the sport films of today. This movie was amazing after the first hour and a half. I would have given it a ten if it ended then but the last forty minutes only supported my decision. One of the most emotional and original films I have ever seen. You really feel for all of the main cast in this film. I went into this film thinking I was going to be impressed by Tom Hardy but I feel that Joel Edgerton had the better performance. Nick Nolte was also amazing in this film, it was probably the best role I've seen him play. Warrior is not only one of the best sports films I've seen but one of the best films I've seen period.",
      "total_reactions": 0,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "Warrior arrives , a movie about mixed martial arts , but also the story of two brothers who diputan for real and reaching well beyond different complex situations , is the dramatic and sporty I wanted",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "for a movie like this, i can say the word \"complete\" and complete for it, is a rate between 8-9. drama & twists are good, actors acting good & even more! in fact every single piece of warrior is necessary for making it to \"warrior\"! recommended!",
      "total_reactions": 0,
      "user": "Mohammad_Ali_Y"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2016
      },
      "score": 9,
      "text": "Great film. Amazing script and an even more amazing cast. Especially Nolte.",
      "total_reactions": 0,
      "user": "avamiller21"
    }
  ]
}