{
  "mc_avg_user_score": 8.1,
  "mc_metascore": 56,
  "mc_mixed_rating_frequency": 142,
  "mc_movie_name": "Watchmen",
  "mc_negative_rating_frequency": 189,
  "mc_positive_rating_frequency": 1470,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 2,
      "pos_reactions": 31,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "A fantastic film. The story, the setting, the characters, everything works perfectly to create this dark alternate reality. Zach Snyder has done it again, creating another beautiful world for another great film.",
      "total_reactions": 33,
      "user": "XxKingLeonidas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "Watchmen is a halluzinogene, sharp and sterile adaption of the comics, which were regarded of being not filmable. But Zack Snyder's creation lives through the pain and insanity the fallen heroes are exposed to.",
      "total_reactions": 2,
      "user": "kSum"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2015
      },
      "score": 10,
      "text": "Amazing movie. Scott Snyder did an amazing  job to adapt Alan Moore's Masterpiece and brought us a better ending. In my opinion, it is by far the best hero movie.",
      "total_reactions": 2,
      "user": "mams2000"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "Alternative take on superhero movies with plenty of darkness in the characters and good use of the heroes interacting with moments in history. In fact some of their actions would cause you to question if they are even the good guys which added more of a human element to them. A good sci-fi movie which rises above the usual run of the mill plots.",
      "total_reactions": 7,
      "user": "rotku"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "I'm going to sum this up in two words: The best. By that, I mean this is the best superhero movie I have ever seen ( compared to the Spider man movies, which were very bad). Watchmen isn't just superhero movie, it is THE superhero movie.",
      "total_reactions": 4,
      "user": "TheCritic1"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2011
      },
      "score": 8,
      "text": "Zack Snyder's \"Watchmen\" has it all; the dark tone/environment, insanely deep characters, powerful action, and profround ideas. It's very obedient to the comic and serves its purpose as a translator of modern heroes and what they represent to the society.",
      "total_reactions": 17,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 11,
        "year": 2011
      },
      "score": 10,
      "text": "IMO its the best film based off a comic book/graphic novel of all time. I had no idea what the Watchmen was about until I bought it on DVD and I watched it with my siblings and we were all blown away by how good it was. We all enjoyed it from start to finish and I am sure a lot of others would too.",
      "total_reactions": 2,
      "user": "asylumspadez"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "Thought it was... ok. Definitely not a huge crowd pleaser like The Dark Knight. No real thrills or shocking payoffs. But this is coming from a guy who's read the book about 15 or 20 times, so maybe a newcomer to the story would beg to differ. But uh... just flat in a lot of areas where the book didn't translate well to the screen. What worked on the page was brought to the screen by Zach Snyder as best as anyone could've mustered, but it wasn't really brought to life in a meaningful, emotional way. The violence was fine for the few fight scenes where it was actually present, but that just made them stand out as peculiar, when 90% of the movie is about... talking. Sometimes talking with bad aged makeup.",
      "total_reactions": 2,
      "user": "Delta_Assault"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 1,
        "year": 2013
      },
      "score": 9,
      "text": "1985, the world is on the brink of nuclear war. After a superhero named the Comedian is killed, the rest of the superheroes that form the Watchmen must reunite to track down the killer and stop world war 3. A dark, gritty, ultra-violent superhero story full of blood, guts, slaughter and sex, Watchmen is the superhero film for adults only. A great action film with a brilliant cast, great director and epic cinematography. Only drawback to the film is the heavy use of 80's politics, which if you are not overly clear on can become too much to handle.",
      "total_reactions": 2,
      "user": "potatoes351"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "The plot was good, but the way it was developed left me disappointed. The characters were not well-defined. In fact, on many occasions they were either boring or indifferent to me. A lot of the film consisted of scenes that did not add to the central plot.",
      "total_reactions": 2,
      "user": "ypomoni"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "In the mid-’80s, writer Alan Moore began to imagine a world in which the superheroes and costumed crime-fighters he’d grown up reading helped shape the Cold War decades that had repeatedly brought humanity to the brink of extinction. It wasn’t a better world. Behind their masks and glowing eyes, the heroes Moore conceived and created with artist Dave Gibbons were hindered, and occasionally crippled, by the same conflicting impulses, childhood traumas, and redirected neuroses that drive everyone else. Moore and Gibbons’ graphic novel Watchmen helped redefine the types of stories superheroes could be used to tell, not just by freighting them with darkness—too many subsequent creators showed how easy that could be—but by weaving their capes and gadgets into a dense, deep narrative: a detective story played out against the apocalypse in a world so thoroughly realized that Charles Dickens would be jealous.",
      "total_reactions": 2,
      "user": "Cinemassacre94"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2012
      },
      "score": 6,
      "text": "This was a very disappointing book-to-film portrayal. Not only do they include the only stupid element from the book (Jon's ability to see into the future which I fully expected them to keep) but they also changed some things for the worst. For one, unlike in the book where there is some foreshadowing but the twist is still somewhat of a surprise, this movie gives away the identity of the villain pretty much from the beginning. Also, they give the characters superhuman abilities for some reason that, other than one minor glitch in the end of the book, never actually existed. Rorschach can't leap 10 feet into the air at will, Adrian Veidt isn't a superhero, etc. This not only made a dark and realistic world silly but it also made the closing sequence of the film incredibly retarded. And speaking of Veidt, this was by far the worst casting of all of the characters. In the book, Adrian Veidt appeared to be a \"larger than life\" person, not just in terms of his celebrity and persona but also in terms of his physical appearance. The dude was a big, strong, and intimidating person but Matthew Goode looks like a dorky little twerp. Malin Akerman also wasn't a great selection but she at least pulled of the role of Laurie Jupiter decent enough. The rest of the casting was fantastic and they nailed the style of the book spot on. The soundtrack was also really good. Honestly, other than the Adrian character in general, they really stayed very true to the book. It's just that this story is so reliant, not on action and effects but rather on the development of the characters and the world itself. And while they developed the world really nicely, I think they failed to develop Dr. Manhattan enough and his back story is really one of the key turns in the book. Overall I think they gave it a solid effort but it just doesn't have the same impact. I think people who read the book will at least find this movie intriguing and somewhat enjoyable but I think people who never read the book will find the movie mediocre at best.",
      "total_reactions": 3,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2011
      },
      "score": 4,
      "text": "It's crazy how this movie turned out average for me. The graphic novel is great, thought-provoking, and artistic. The movie adaptation, however,  feels like a wax replica of the novel. With the actors/actresses looking uninspired and dull.",
      "total_reactions": 9,
      "user": "j30"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 3,
        "year": 2011
      },
      "score": 0,
      "text": "There must be something like a manual for making movies. Plot, character development, pace, etc. Since apparently there isn't, abysmally awful flicks like this will continue to be made. What is the standard ? And what is the purpose of submitting this to a paying audience ?",
      "total_reactions": 13,
      "user": "Nazgulero"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2010
      },
      "score": 5,
      "text": "As camp as the George Clooney's Batman films (or even Roger Moore's Bond films) and not even close to the class of  \"The Dark Knight.\" It is a great production indeed, but it is never as good as its opening credit sequence.",
      "total_reactions": 7,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2010
      },
      "score": 1,
      "text": "This movie was awful. I wouldn't recommend it to anyone, but you don't have to take my word for it.",
      "total_reactions": 9,
      "user": "Ocelot"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2011
      },
      "score": 6,
      "text": "This movie wasn't a great movie, the plot is pretty boring but picks up when the action finally shows up, all the characters but Rorschach are unlikable and lame, this is incredibly overhyped, and get boring at times, but you may be willing to give this a chance just don't expect greatness.",
      "total_reactions": 2,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2011
      },
      "score": 0,
      "text": "Too much long. Too much violence. I like the mature and realistic approach, but in some moment it loses its goals. It has a great ending endeed but you`ll have to wait...",
      "total_reactions": 5,
      "user": "razburnknj"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "This movie is a mixed bag. Brilliantly directed in some parts. However boring and poorly acted in others. Overall worth seeing with fantastic visuals.",
      "total_reactions": 1,
      "user": "cabrita"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2013
      },
      "score": 8,
      "text": "Whats wrong with us you say? Whats wrong with you i ask! This movie is great! Sure, sex scenes where not neccesary but where not bloody offensive, neither was dr.manhattans penis. I image people that found this offensive has been raped or something, so that any \"sexual\" related stuff is an horror to hear/watch. Terrible acting? nope, even though im not a top-notch movie critic i can tell you that its not horrible, its fairly good in my opinion. The story is interesting enough.",
      "total_reactions": 1,
      "user": "W3XC"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "Abysmally paced, ridiculous crybaby dialogue-filled, on-the-nose sexually exploitative, nearly action-free, cantankerous, dark (not in a noir-ish way but in a literal \"it's difficult to tell what I'm looking at sometimes\" sort of way), leaden, flabby, incredibly overlong train wreck of a bullsh** movie. I've NEVER walked out of a theater before a film ended until Zack Snyder decided to make me look at Dr. Manhattan's penis for one agonizing moment after another for absolutely no reason.  The four of us, exasperated, worn out... utterly soul-crushed by what we had already been subjected to leading up to this moment, finally gave up and left... LONG AFTER EVERY OTHER PERSON IN THE THEATER HAD ALREADY DONE SO!  There's a line between just making a crappy movie and actually showing bald-faced contempt for your viewing audience.  I'd say Snyder is definitely toeing that line, if not stepping over it here.  All I know is that I'm still waiting for him to personally refund my $20. Jerk!",
      "total_reactions": 2,
      "user": "CooterPatooter"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2012
      },
      "score": 2,
      "text": "Watchmen is a different sort of film: a superhero with E.D: and a villain who wins with a \"the ends justifies the means\" message. Add to that the giant blue guy that runs around with his penis waging about for the last quarter of the film and this movie was made to push the envelope.",
      "total_reactions": 3,
      "user": "LynnHardy"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2013
      },
      "score": 2,
      "text": "This movie is trash, I don`t care what anybody says. I like one of the characters, but man I should punch myself in the face for finishing this movie. I see it has good ratings from allot of people, That just makes it clear, that I am not a zombie who just follows what other people like. I usually like \"Super Hero\" movies, Not this one!",
      "total_reactions": 4,
      "user": "oblique15"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2013
      },
      "score": 0,
      "text": "This movie makes me puke. Seriously. How in the world you can rate this positive  This \"heroes\" makes no sense. Plot is awful. Main heroes  HeHero and SheHero (didnt bother to remember names) are ugly as hell. And this blue guy without pants  every time I saw his huge blue penis my eyes were bleeding. I simply cant understand how you can rate this more than zero.",
      "total_reactions": 3,
      "user": "Violett"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2013
      },
      "score": 1,
      "text": "I did not purchase a twelve dollar movie ticket to see terrible plot holes, poor character development, cheesy  dialog lines, and a blue wang. Sure, it has mediocre fight scenes but overall, it is unbearable.This does not reflect the comics at all, whatsoever.",
      "total_reactions": 1,
      "user": "KnightfallLA"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 2,
        "year": 2016
      },
      "score": 2,
      "text": "This film didnt grab me like the novel did, bad acting, great visual but no hart, felt empty and some times the dialogue felt flat, snyder is a great director but telling a story is not his thing",
      "total_reactions": 5,
      "user": "913"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2014
      },
      "score": 7,
      "text": "Very faithful to the source material, and it works well.  I do prefer the cuts without \"The Black Freighter\"; The Ultimate Cut suffers from those awkward cheap-looking animated insertions and just doesn't flow too well.  A strong, serious, and adult superhero chronicle that sets itself apart from others in more ways than one.  Zack Snyder really did a respectful job in bringing the graphic novel to life.",
      "total_reactions": 0,
      "user": "LOmarG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 9,
        "year": 2010
      },
      "score": 8,
      "text": "If the last 40 minutes were like the first 2 hours this would have been one of the best films o last year and probobaly as good as the Dark Knight BUT the last 40 minutes were rushed and a terrible way to end a good film",
      "total_reactions": 0,
      "user": "mazky"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 6,
      "text": "There were a lot of things the movie did right, and plotwise, it stayed faithful to the original medium. However, there were enough missteps/inconsistencies and an unfulfilling style that it comes off as a purely enjoyable film, rather than a great, memorable one. Also, those watching the movie who haven't read the graphic novel will find little to cling on to, and might find the ending bemusing, but not anywhere near as impacting as what's presented in the book. The whole soundtrack also just needed an overhaul (If you're gonna feature \"Hallelujah\" in a movie, at least let it be Jeff Buckley's version!) Anyway, I need to get some sleep...",
      "total_reactions": 0,
      "user": "ryancarroll88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2010
      },
      "score": 7,
      "text": "A little ard to follow since i never read the graphic novel. But the action, awesome characters, and visuals helped me keep watching it. I did get somewhat bored towards the end, but that's honestly nit-pickery. I would like to read the graphic novel, if i ever get the chance. But good movie.",
      "total_reactions": 0,
      "user": "MetalMan95"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "Watchmen was a socially-relevant, very gritty graphic novel from the late 80s written by one of the most original comic book writers of the time (or any time), Alan Moore.",
      "total_reactions": 0,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "A few years after release, I think this film was unfairly maligned. It's not as good as the comic, but its still a well shot, thought provoking film. Some of the performances are great, most are good, and the sound track is phenomenal. I actually think the ending of the film made a lot more sense than the comic too, though I know many people didn't like it.",
      "total_reactions": 0,
      "user": "Thom"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "Watchmen is probably the most unique and thought provoking superhero movie ever made. It's also one of the best. The plotting, atmosphere and characterizations are all top class, as are the fantastic fight scenes. I might well know nothing about the graphic novel that the film was based on, but I can tell you this; Watchmen is awesome!",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "Watchmen could be the best superhero movie ever adapted successfully from comic books, even could be better than THE DARK KNIGHT (2008). The Director is Zack Snyder, the man behind the extraordinary 300 (2006). He also directed the simple but effective horror, DAWN OF THE DEAD in 2004. Snyder is a young Director that his track-record never flaw until now. The cinematography on thiz film is still stunning, every scene made with a great detail. The Watchmen original material comes from graphic comic written by Alan Moore. Every character in Watchmen is very unique. The most unique character maybe is Dr. Manhattan, who played by Billy Crudup. The other Casts are: Malin Akerman, Jackie Earle Haley, Patrick Wilson, Matthew Goode, Carla Gugino , and Jeffrey Dean Morgan. Watchmen told a story about a group of super heroes dealing with the society on alternate world in 1985. One side, they needed to maintain peace, and the other side, they had put in distance because of their oddity .The soundtracks support well to give a precise atmosphere during thiz film. The conflict along the plots was in order and proportional. Malin Akerman physical appearance as Silk Spectre II, in my opinion is the best presentation of superhero character. The posture and shape what superhero should looks like appears  perfectly. The climax on this movie was also very fair, where we could blurred by who is the bad guys or good guys. Thiz shows us the movie was far mature that seem to be.",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "Highly enjoyable movie, yes it is overlong (especially the directors cut) but it is visually astounding. Imagine 300 as a superhero movie (They do have the same director) I was very entertained while watching it",
      "total_reactions": 0,
      "user": "Schmit93"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "Being a huge fan of the graphic novel, the only thing I hold against this movie is one performance. But the incredible accuracy to the novel, the excellent action, and the superb overall cast, Watchmen is unforgettable! See it!",
      "total_reactions": 0,
      "user": "Moviebuffreview"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2011
      },
      "score": 9,
      "text": "Watchmen is a good film with a good story and acting at times. The film is a bet lengthy but it is a exceptional film when it comes to plot and diologue. Rorschack is my favorite character from Watchmen. I think Watchmen is Zack Snyder's best film.",
      "total_reactions": 0,
      "user": "Jcrank42210"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2011
      },
      "score": 10,
      "text": "Avoid the director's cuts and Watchmen is among the four or five best superhero movies made as of 2011.  Demote Spider-Man 2 and it might be the best of the bunch.  In fact, let's go a step farther.  Watchmen isn't just a classic superhero movie.  It's a classic film.",
      "total_reactions": 0,
      "user": "spacecaptain"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2012
      },
      "score": 8,
      "text": "The are landmarks in comic book publishing, and there are landmarks in superhero filmmaking. Watchmen is an example of both. Alan Moore's graphic novel changed comics forever, and proved to the world once and for all that they could be taken seriously as a medium. Perhaps the film version hasn't had the same impact, but it should be respected nonetheless. It's a real shame that Moore disowned the project after seeing sub-par film adaptations of From Hell and The League of Extraordinary Gentlemen, as Zack Snyder's Watchmen is a very good film. It's a pessimistic view of an alternate universe with real superheroes, a world of heightened Cold War paranoia and near-constant awareness of human mortality. The heroes of this universe are all deeply flawed, and make for fascinating characters - Jackie Earle Haley's psychotic masked vagrant Rorschach, Patrick Wilson's idealistic but impotent and out-of-shape caped crusader Nite Owl and Billy Crudup's increasingly removed nuclear man-god Dr. Manhattan being particular highlights. Snyder's films are always visually stunning, but Watchmen sets a new standard, as often it looks like Dave Gibbon's artwork has stepped straight off the page and onto the big screen, and Snyder's good sense for over-the-top violence and dynamic cinematography serves this living comic for grown-ups well. The film's standout scenes are the interconnected flashbacks that flesh out the characters, their relationships with each other, and what drives them, and Dr. Manhattan's origin story is particularly emotionally engaging. Watchmen also has one of the most memorable opening credits sequences on film, presented as a striking and really quite beautiful extended montage that establishes just how much has changed in a world that has had masked vigilantes operating in it since the late 1930s, all with Bob Dylan's \"The Times They Are a-Changin'\" playing over the top. Watchmen isn't perfect - it's rather long, yet somehow the final act still feels rushed and a little clumsily put together, and there's the odd plot-hole to be found in the theatrical release (thankfully resolved in the director's cut), but Zack Snyder's vision of Alan Moore's universe is still one of the more faithful, respectful and coherent book-to-film adaptations. Snyder retains all of the \"meat\" of Moore's book and brings it to life with expert visual execution. They said Watchmen could never be filmed. They were wrong.",
      "total_reactions": 0,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "This movie is something special. The acting through out the film is fantastic. Even the small roles were strong. The plot was great and flowed well. I have never read the graphic novel because I usually don't like graphic novels but after seeing this movie I am going to have to read it. I also loved the visuals and the fact that the movie really dove into what its like to be a superhero after nobody wants you anymore. A great film that takes a dark look at what the world could have been like.",
      "total_reactions": 0,
      "user": "moviegrabbag"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 9,
        "year": 2011
      },
      "score": 6,
      "text": "Unlike most movies which seem to be held back by film studios, Watchmen and its director Zack Snyder would have benifited by studios saying NO and holding back the excessive nonsense that weighs down this movie. Too much of Watchmen's violence is unnecessary and far too excessive. Violence can be very effective but too much will screw up its impact and this movie suffers as a result. I did enjoy some of the films back story and the characters Rorschach and Doctor Manhattan were interesting, but for everything this movie did right it did something wrong. Some of the actors are good some are miscast, the screen play is messy at times and there is also a ridiculously clumsy laughable sex scene. It's a pitty as Watchmen does have some depth and could have been much better.â",
      "total_reactions": 0,
      "user": "davenbettridge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "A stylish take on the graphic novel that manages to be both a faithful and plausible adaption. The mood was perfect for the story, and all the characters managed to be as deep as they were in the source material.",
      "total_reactions": 0,
      "user": "DustyPig"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2011
      },
      "score": 8,
      "text": "I hated, absolutely hated this graphic novel.  I remember a member of the youth group I was helping out with, told me to read it because it was the best comic he ever readâ",
      "total_reactions": 0,
      "user": "heybuddymovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2011
      },
      "score": 10,
      "text": "Movies are not meant to be judged based on other movies.  There's no rule book, because it's simply different every time.  In this instance, this movie should be based only by the novel to which it's based on.  For that, I give this movie a 10.  Having read the novel, this movie gave me the same emotional message as the novel did, in an astonishing way that surpassed my expectations.  This movie gets me every time, as I hope it did for the other readers of the novel(which I highly recommend you pick up after reading this if you've never read it).  Watchmen intrudes past most of our modern day movies, giving a dramatic look at what our species is capable of, both the good and the bad.",
      "total_reactions": 0,
      "user": "GloofiE"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "An amazing film The 2nd greatest super hero movie of all time the reason why it gets so much hate is because people see the trailer they think it is an action movie it's not its a drama with noir and action elements the editing was just fantastic the voice acting was great the story is deep complex and interesting this is one of the few comic book movie that actually improves on the original a true masterpiece",
      "total_reactions": 0,
      "user": "kevlar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "I'd like to say that I never read the graphic novels but I got to say that this movie was incredible now some complain that it was boring but i guess people hate movie's with a great story it did a great Job fleshing out each characters story except night owl which was the only character I didn't like his acting was terrible.  The comedian was an interesting character since he believed that we're all destined to kill each other but doubts or maybe even believes we can change which is why he was killed.to my surprise most reviewers said it was to gory but come on ppl its rated r for a reason besides this isn't Batman r Spiderman where those movies are gore free..also people said hey only one Guy had powers...that's not true it was it was two lil ozmandias was extremely quick,strong & could Dodge/catch bullets & roshack was awesome all in all this movie gave me what I wanted 9 out of ten would've been a ten but Mr.Manhattan was naked lol",
      "total_reactions": 0,
      "user": "ilovegames32"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2011
      },
      "score": 2,
      "text": "The only people who can actually appreciate this movie are those who have never read the comic and simply like the idea. The idea is brilliant, but was introduced in the comic. The film tears its source material apart and decides to construct anew from nothing but the idea, failing miserably in the process. Everything, from the adapted script to horrible acting and poor casting, fails.",
      "total_reactions": 0,
      "user": "Ekkoe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "I haven't read the graphic novel yet.",
      "total_reactions": 0,
      "user": "oxana"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2012
      },
      "score": 10,
      "text": "A film the critics got dead wrong, Watchmen is the best comic book/graphic novel based film I have ever see. I had no idea what it was about, I liked the trailer and clips of it so I decided to buy the DVD. I loved it. A must watch imo.",
      "total_reactions": 0,
      "user": "imthenoob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2012
      },
      "score": 9,
      "text": "Watchmen is one of the best superhero movies. Its dark gritty story is interesting, and while many fans of the book may be disappointed, I sure wasn't. Definitely worth watching.",
      "total_reactions": 0,
      "user": "Theguyoffire"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "This movie stands alone within the Superhero genre.  Taken as an interpretation of the graphic novel, which itself is among the greatest novels of our time, this movie is perfect.  The Ultimate Cut is the cut to watch, for it brings together all the plot points from the novel in one film.",
      "total_reactions": 0,
      "user": "OnAnarchy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2016
      },
      "score": 3,
      "text": "Some people are allergic to peanuts. Some to pollen. Allergies are endemic in our society. Zack Snyder is allergic to making movies that are not complete s**t. Gratuitously violent and bombastic, Watchmen is an interesting little neo-noir film that gets bogged down by Snyder's lesser sensibilities. His desire to go completely over-the-top kills the film with pointless sexuality, excessive violence, and random diversions into the absurd that makes you wonder how much acid Snyder indulged in whilst making the film. I have never read the comic this is based on, but this one is really odd. Why do they keep going to Mars? Why? Why must he keep showing us this blue guy's penis? The existential questions of life, which we may never get. If the film were not as violent as it is (the arm cutting scene being the most visceral offender), it would still be bad. Watchmen is simply aggressively dumb. Snyder was criticized for Batman v Superman where critics claimed it looked as though it was put together by some kid smashing his toys together. Watchmen suffers from the same problem. Instead of purposeful and impactful events, Snyder has the sensibility of a 12 year old boy who includes scenes and effects because they look cool instead of actually having any cinematic value. If this is truly a faithful adaptation of the comics, Watchmen must be one hell of a painful read.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "Easily the most underrated comic book films of all time, Watchmen is a visual entertaining film that really captures the dark, depressing tone of Alan Moore's sensational award winning graphic novel, full of amazing action, acting (the actor who plays Rocatch is amazing) and a will crafted plot that is alot more grounded compared to the unreal ending of the graphic novel.",
      "total_reactions": 0,
      "user": "ReubenIsAGod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2013
      },
      "score": 9,
      "text": "This is a veary good movie the actors are great and the movie it selfe is great.This is the best movie based on a comic book.I owned the original comic book and i watched the movietoo so i ca say the two of the are great and i will give the movie an 9 because its a good movie and it will be eaven better if you read the comic to know what is going on.",
      "total_reactions": 0,
      "user": "skyluxx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2012
      },
      "score": 9,
      "text": "Perfect interpretation of the comic book. Perfectly directed. The casting for this movie was perfect, If you didn't read the comic you still getl simular enjoyment form the movie. Yet the comic goes into to deatil more and I think they left a few critical moments out. Otherwise a very, very highly underrated movie.",
      "total_reactions": 0,
      "user": "GC802"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2013
      },
      "score": 6,
      "text": "I can see why fans of the novel enjoyed this..and I didnt entirely hate it, but it just didnt have that great stirring narrative feel that the graphic novel had.  Of course not having a gaint squid kill millions in N.Y with its telekinesis powers was a little of downer but the film actually pulls off some of the scenes from the book rather nicely.  The casting isnt all the terrible either, esp. Rorschach, Nite Owl, and even the Comedian.  I didnt mind all the violence either, it was violent book, but for some reason it had a shiny cartoony feel to it, much like he did with 300...kind of glossy blood violence.  It also just didnt appear as smart as the book did either, many of lines of dialogue that came right from the book, came across clunky and also Ozymandius is given villain status immediately..his character was the one I just felt they completely missed the ball park on...but hell he didnt pretty decent job with a challenging movie.",
      "total_reactions": 0,
      "user": "JamesCannon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "Firstly, I want to say that as a standalone film, Watchmen is more than adequate. However, as an adaptation of the best graphic novel of all time, it doesn't meet the standards set by it's paper-back sibling.",
      "total_reactions": 0,
      "user": "QwertyPJM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "Though it may be confusing and hard minded to some, Watchmen is execellently written adaption of one of the best graphic novels ever. Its visually impressive, it had lots of action, and it had great dramatic moments added along with it making this Snyder's best work by far.",
      "total_reactions": 0,
      "user": "TheWalrus2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "You can forgive it's misses because the things it gets right, notably a perfectly cast Jackie Earle Haley as Rorschach and a confident and rich visual style cover up the movies' understandable need to cram as much of the book possible into a 2 1/2 hour movie making it a stuffy but occasionally exhilarating experience.",
      "total_reactions": 0,
      "user": "Leif"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "Good storyline and some acting. One of the better comic book movies Ive seen probably because they got a decent writer and actors. All the 'sexuality' wasnt necessary  especially Dr. Manhattans penis. Also a bit too much blood and violence. Definitely not a comic book movie for kids.",
      "total_reactions": 0,
      "user": "RedShadowHat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2013
      },
      "score": 8,
      "text": "I've read and love Watchmen, and still love this movie. Not sure why it got hated on as much as it did. It could of been more true to the source material, but it was overall very graphic and entertaining.",
      "total_reactions": 0,
      "user": "SimpleMethod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "You know what I liked it. I have read the comic so I can't be accused of not understanding how much of a bad adaptation this is, I love both of them. The comic is much deeper and more cleverly constructed but the movie appeals to a wider audience and makes some of the characters more likeable. Why this is almost rotten and fans of the comic don't hate it I will never know. But it's one of my favorite movies of all time.",
      "total_reactions": 0,
      "user": "python2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "Yes, I've read Watchmen. And yes, I do believe it is one of the most interesting, involving, thought-provoking, mind-blowing books I've ever read of any genre. Anyone who's read my reviews of comic book-inspired movies knows I've never claimed to be a comic book fan. I usually steer clear of the medium, but Watchmen was a must-read (actually a must-read over and over). And being a Watchmen fan going into Warner Bros Pictures' and Zack Snyder's film adaptation of Alan Moore and Dave Gibbons' critically acclaimed work, I had high hopes for this feature film based on what's widely regarded as unfilmable source material. Did Snyder's cinematic vision live up to expectations? Absolutely. Snyder and writers David Hayter and Alex Tse had to lose portions of the graphic novel (which first appeared as a comic book series in the mid-1980s) in order to condense the story into a reasonable running time and comprehensible narrative. They also had the difficult task of making the film accessible to those who haven't read Watchmen without trampling on the dreams of Watchmen fans who've been waiting decades for a movie based on Moore and Gibbons' characters. Watchmen fans must realize going in that this is not a panel by panel adaptation in the vein of 300. That would have been an impossible endeavor given the richness and sheer depth of the graphic novel. As such, important portions of Watchmen have been left out. Failing to make the cut in the feature film are any mentions of Tales of the Black Freighter (an animated short is being released separately on DVD) and Hollis Mason's Under the Hood. And Watchmen the movie relegates the past members of the Minutemen to mere fleeting glimpses in the film's marvelously inventive opening credits (one of the best lead-ins to a film I can recall). The ending's also been drastically tweaked. But all that aside, most importantly, the message, the tone, and the six central characters have made the leap to the big screen nearly completely intact. Alan Moore used Watchmen as a way to deconstruct the superhero genre while at the same time reflecting on world issues. What sacrifices would we be willing to make in order to save the world from itself? Does the end justify the means, if it entails the loss of life in order to stop a nuclear war? Watchmen is set in an alternate 1980's reality in which presidential term limits are no longer enforced and the Doomsday Clock is closer than ever to striking midnight as the United States and Russia move toward nuclear war. In this twisted world, costumed vigilantes once worked side by side with law enforcement. Known as the Minutemen, these crime-fighters didn't have any special powers, just the desire to clean up the streets. As the original group aged and moved on, a new wave of costumed crime-fighters popped up. This new group (the Crimebusters) followed in the footsteps of the Minuteman, rounding up bank robbers and murderers, all without the backing of the power of a badge. But the tide eventually turned and costume-wearing vigilantes were forced into retirement with the passage of the Keene Act (the film glosses over this part of the story). After the passage of the Keene Act, Dr Manhattan and The Comedian, a ruthless, morally bankrupt, cold-blooded killer, are allowed to continue to work with/work for the government. Rorschach, another member of the team, continues to hunt down villains but does so unofficially, outside the confines of the law. Although Snyder and company serve up backstories by way of flashbacks, most of the action in the movie Watchmen takes place following the murder of The Comedian. Rorschach becomes driven to find the truth behind who killed The Comedian (someone he holds in high regard despite his despicable acts). In order to ferret out the killer and find out if whoever it is is targeting costumed vigilantes and for what purpose, Rorschach pulls his old crime-fighting compadres out of retirement. As Rorschach, Nite Owl II, and Silk Spectre II dig into this plot to kill all 'superheroes', they uncover a conspiracy the depths of which they never anticipated upon hearing the news of The Comedian's murder.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "A great film. A much more \"depressing\" film in a way, depicting the fall of a bunch of Superheroes from their hey-day, and strikes elements that could be of a very psychological nature as well.",
      "total_reactions": 0,
      "user": "HazaRDReborN"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2013
      },
      "score": 9,
      "text": "Amazing adaptation from the original Graphic Novel written by Allan Moore.",
      "total_reactions": 0,
      "user": "Pickle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2013
      },
      "score": 4,
      "text": "The graphic novel, Watchmen by Alan Moore is one of my favorite books and one of the best graphic novels ever written, if not the best. It is a groundbreaking piece of literature gold that deserves to be worshiped. Yes, I just recently read the book and I missed this in theaters. But I know now how all those poor soles walking into the theater one night with their personal Watchmen copy in hand just awaiting this monumental adaptation to flash before their eyes feel. It does not feel very good.",
      "total_reactions": 0,
      "user": "TylerDsCreation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2013
      },
      "score": 7,
      "text": "Watchmen is the story of vigilante's who stop crime, all the way from the days WW1 to the year of Nixon's election, and now have to deal with someone who is taking out the masked heroes one by one. This based off; more like an exact copy of, the graphic novel by the same name. This film did not do so well at the box office; it still made some money, just not a lot. So there was already a layer of uninterested when this came out. Eventually I got a hold of it on blu-ray; in fact it was my first blu-ray movie I got, and I was generally pleased with it. I really liked the visual style of it, the dark and grimy detail really sells it. It's just like the graphic novel pages were on the screen. Another thing I like to mention is Jackie Earl Haley as Rorscach. This is the best performance in the movie. The way he makes his character act like such a intimidating presents is amazing when thinking about how tall he is; not very. It's almost like Marv from sin city, he's a bad ass, but also a loser in a way. Although with theses great compliments I appear to be giving this film, there're some problems I'd like to address. While Rorshach is great, the other characters don't really leave much of an impression. The guy who played Mr. Manhattan I guess did okay; if he was suppose to sound completely uninterested was his goal, then he's one of the few exceptions. I mean, I just don't find the others that interesting, and the actors don't try to do anything to make them feel real at any point. The running time can be an issue as well, running at around two an a half hours long, it can be a bit dragging when the film is not entirely interesting or captivating throughout. Even if there's not a total appreciation for this film by most, I still like it, and I'm sure there's other who agree with me.",
      "total_reactions": 0,
      "user": "Skullgirlsfan13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2013
      },
      "score": 10,
      "text": "What makes Watchmen so great is that it's one of very few comic adaptions that's almost entirely true to it's source material. It's about 98% accurate. That's what makes this film as good as the cult classic graphic novel.",
      "total_reactions": 0,
      "user": "Jamison12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 8,
      "text": "Action,fun,sex was included in that masterpiece. I really liked this movie.",
      "total_reactions": 0,
      "user": "Kiva"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 4,
        "year": 2016
      },
      "score": 6,
      "text": "Watchmen is a decent super-hero film, but is nowhere near as good at the graphic-novel. A lot of exposition is removed, but that isn't what bothers me. The problem is that a lot of bloated action scenes were added, where none were present in the novel and this hurt the characters. By creating super-hero's, Snyder completely missed the point of the comic that these are regular humans with complicated lives.",
      "total_reactions": 0,
      "user": "Swishalicious29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2013
      },
      "score": 10,
      "text": "Without a doubt one of the most epic movies ever made and the most artistic superhero comic book adaptation to date. It requires a bit of patience, and possibly re-watching, but is easily one of the best films I've had the pleasure of seeing.",
      "total_reactions": 0,
      "user": "logicalprspctv"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "With more darker, thrilling, and violet then the novel, watchmen brings the intense mystery violet film that frightens the audiences under 12 or 13 with graphic violences,bad sex love scenes and others. I don't need to hurt Zack synder's feelings for this movie but he does directed others films that are good such as legend of the guardians, sucker punch, 300, and man of steel. So I would generally recommend that this is a good movie but has bad stuff in it based on the graphic novel. So there's one thing I am confused about this movie. One thing am confused is that the plot generally mixed up from character to character. Each from past it the present of the story. So I would this is that the movie maybe frighten people with intense violence and darker past of the story. So that's that things I would say about this movie.",
      "total_reactions": 0,
      "user": "mariotoadrabbit"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "Even though the film overextends its welcome and has a tenacity to assert its political themes as often as possible, its graphic violence, durable characters, and stunning depiction of an unscrupulous alternate Earth more than compensate.",
      "total_reactions": 0,
      "user": "SuperheroMovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "Though it overstays its welcome slightly, at more than 2 1/2 hours long, the film hits a bulls-eye with what it tries to achieve: a superhero movie with a dark and mature atmosphere.",
      "total_reactions": 0,
      "user": "KevinPHooks"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "Now i know most people when you ask them to write a list of their top five comic book movies they wont have Watchmen on their list. For me though i love this film and have it in my top three super-hero movies of all time. Watching the film in the theater was just a blast again being directed by Zack Snyder he gave it is feel and it just blows it put the water visually the film is an eye-gasm with action and sheer brutalness \"umm seeing a person get blown up and the body hanging form the ceiling YES PLEASE\" that was so crazy.",
      "total_reactions": 0,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "Who watches Watchmen?",
      "total_reactions": 0,
      "user": "rustyjudas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "A movie that made me think and say \"That maybe some superhero movies are not for kids\". It is a dark movie not for kids. The MA 15+ (R in USA) shows I wouldn't be fazed if it was R 18+ (NC 17 in USA). Ok back to the review if you are fan of the comic you will be disappointed I read the book a week before I saw the movie on blu ray. The story is fanatic very close to the comic only 1 or 2 bits that won't in the comic. The movie has heavy themes to the point you see some nearly getting raped. The movie is not the bad and it has made it on my favourite movies of all time at number 4 but it is worth a look at.",
      "total_reactions": 0,
      "user": "Adam201028"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2013
      },
      "score": 10,
      "text": "I don't understand why this film is so hated, it was flawless. If you're the kind of person who gets worked up over comic book adaptations not being 100% faithful to the material then you really need a new hobby. Every aspect of the movie was perfect and the ending was great, instead of the good guys just casually beating the evil villain they then turned the whole narrative on its head and left you wondering who the good guys really were.",
      "total_reactions": 0,
      "user": "HerrWolf88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2015
      },
      "score": 10,
      "text": "Perhaps one of the very few 'cerebral' comic book / graphic novels ever filmed ... a great film ... I do not think this movie is for everyone though ... as it contains much more than your usual simplistic comic-book slam-bang action ... I think it does have its problems in its adaptation from the novel (most films do) but I think this can be forgiven as it stands apart when compared to most of the superhero genre movies.",
      "total_reactions": 0,
      "user": "Al5421"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2014
      },
      "score": 10,
      "text": "El mejor trabajo de Zack Snyder, impresionante, muy fiel al comic, lleno de detalles, espectacularidad epica para dar de tomar, es estilo zack snyder es genial, su tonalidad catapulta al genero superheroes infantil/juvenil. Simplemente genial.",
      "total_reactions": 0,
      "user": "leonardark"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2016
      },
      "score": 7,
      "text": "I came into it with my expectations too high. I thought there would be a big twist, like Rorschach turning out to be the killer or the whole thing literally being a joke. It's also too long and 2 much backstory. But everything else is pretty good.",
      "total_reactions": 0,
      "user": "TheMetacritiqer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2016
      },
      "score": 5,
      "text": "Watchmen desperately tries to deliver the thought-provoking meaning of the original graphic novel, and somehow it succeeds. Those parts that fails, they are inconsistent and ultimately forgettable.",
      "total_reactions": 0,
      "user": "Tomle1202"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "A great film with a great plot and great characters, Watchmen is possibly Zack Snyder's best film to date. Snyder not only accomplish the task of making a Watchmen film, something Terry Gilliam(Brazil, Time Bandits) failed at, but also made it a masterpiece. With it's dark and gritty tone, there are dark and gritty characters, whom are all well-written and very in depth (The Comedian being the deepest in my opinion). If you get the chance of watching this, by all means don't hesitate to do so.",
      "total_reactions": 0,
      "user": "BrettT"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "Watchmen is not only the best comic-book adaptation I have ever seen, it is easily one of the most inventive, intelligent movies ever. The story is always surprising, and there are some very funny scenes. Not something to show to kids, though. It's darker (way darker) than the Dark Knight, and contains scenes of extremely graphic and/or psychological violence that are always justified. Don't expect comforting characters and a happy end either.  The characters are almost all **** (and all actors are perfect in their roles, even though none of them are really famous) and the ending... well, it's just so clever and unexpected, without coming from nowhere. And also: The soundtrack is perfect.",
      "total_reactions": 0,
      "user": "My_name_is_Khan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "Amazin acting, amazing story, amazing characters. Amazing movie!",
      "total_reactions": 0,
      "user": "TheRoyalMelon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "First time I saw this movie, I really hate it, but then I understood that is a philosophical movie, where each character represents one of the thoughts of those decades, like pessimism, optimism, utilitarianism... Then i realised that this is an amazing masterpiece of another DC Comics series, and i have seen this movie like 3 times in less than a week... simply amazing, and i really love it.",
      "total_reactions": 0,
      "user": "sourenics"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "Not that good of a graphic novel adaptation indeed.But a marvelous movie filled with great moments.With great performances and good looking visuals,this movie is entertaining and has a truly unexpected take on superheroes.",
      "total_reactions": 0,
      "user": "DenisManu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "great adaptation, faithful to the watchmen legacy. great directing and special effects, pleasurable experince throughout the film. grab your chips and drink for this one",
      "total_reactions": 0,
      "user": "brayson18"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2016
      },
      "score": 10,
      "text": "Great comic book film, probably the best R rated one after Deadpool in my opinion. It's extremely true to it's sources, everything from the graphic novel was poured onto the big screen without any compromise. The plot is fantastic and it stays pretty coherent and cohesive for its 3 hours runtime, the acting is great, the special effects are pretty good for 2009 and the costumes and practical effects are incredible. But the most impressive aspect of the film is how it looks in general. Its very dark, gritty and dirty, you can almost smell the blood and the sweat coming out of it. Visually its amazing, Zack Snyder is known for that and this movie is in my opinion his masterpiece. He was able to produce a film in which its storyline and characters were able to reach the heights of the visual spectacle.",
      "total_reactions": 0,
      "user": "Urbanlistener"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "n the mid-’80s, writer Alan Moore began to imagine a world in which the superheroes and costumed crime-fighters he’d grown up reading helped shape the Cold War decades that had repeatedly brought humanity to the brink of extinction. It wasn’t a better world. Behind their masks and glowing eyes, the heroes Moore conceived and created with artist Dave Gibbons were hindered, and occasionally crippled, by the same conflicting impulses, childhood traumas, and redirected neuroses that drive everyone else. Moore and Gibbons’ graphic novel Watchmen helped redefine the types of stories superheroes could be used to tell, not just by freighting them with darkness—too many subsequent creators showed how easy that could be—but by weaving their capes and gadgets into a dense, deep narrative: a detective story played out against the apocalypse in a world so thoroughly realized that Charles Dickens would be jealous.",
      "total_reactions": 0,
      "user": "moviemayhem"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "The director of 300 recreates the dark and gritty DC Comic from the 1980's in a way that somewhat hard to understand but very watchable. Watchmen is great with action sequences and an Ok story, and most of the cast over did the roles except for Jackie Earl Hallie who played as Rorschach gave the performance of his career. All the costumes were spot on from the comic book which made me happy that they at least got something perfect and so close to perfection, and the film's long running times made thing a little more difficult as the Ultimate Cut of the film reaches 4 Hours, but despite of all of the mistakes, it is a worthy comic book adaptation worth watching.",
      "total_reactions": 0,
      "user": "Th3GreenHorne7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2016
      },
      "score": 10,
      "text": "This is the definition of a perfect adaptation. This has great acting, great cinematography, and doesn't hold back on the R rating witch you need with this story. Any person who loves comics, dark stories, or Alan Moore NEEDS to watch this movie. This movie would make even Alan Moore proud (even though it doesn't).",
      "total_reactions": 0,
      "user": "Batman2752"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "Being an amazing movie,the agregate of the movie in metacritic lefted us a big HURM in our faces.it stays true to the graphic novel.and just like the novel,the story is great",
      "total_reactions": 0,
      "user": "SuperHyperST"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2016
      },
      "score": 6,
      "text": "It's crazy how this movie turned out average for me. The graphic novel is great, thought-provoking, and artistic. The movie adaptation, however, feels like a wax replica of the novel. With the actors/actresses looking uninspired and dull.",
      "total_reactions": 0,
      "user": "aadityamudhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2016
      },
      "score": 6,
      "text": "Users defending Zack Snyder's films make me look bad in front of public. Seriously, stop defending any film Zack Snyder has made because you know you're not a true moviegoer if you do this all day. Watchmen just keeps trying, but fails at the end.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "I never read the graphic novel, but I've seen the film several times now and I can hardly get enough of it. For those of you unaware of the plot, it is a compelling film noir mystery thriller about a group of people who become superheroes, are then used by the US government to fight its enemies and are later discarded by the US government. One of the group was murdered and the others start investigating we he had to die.",
      "total_reactions": 0,
      "user": "johnslegers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Zack Synder basically took the comic book,removed the filler and dumb sh*t and placed the remains (one of best comic books of all time) into a movie. You can't go wrong with this movie unless you didn't like the comic.",
      "total_reactions": 0,
      "user": "AgentVenom117"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "Zack Snyder is a genius when it comes to taking images of a comic book and putting them up on the screen. A stunning visual spectacle of a comic book that was deemed impossible to put on screen.",
      "total_reactions": 0,
      "user": "AaronWasserman1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2016
      },
      "score": 4,
      "text": "The only character in “Watchmen” who possesses actual superpowers — resulting from an accident at a top-secret government research lab in the late 1950s — is Dr. Manhattan, a blue, bald, naked dude with blank eyes and the voice of Billy Crudup. Dr. Manhattan’s existence is busy and fairly melancholy, but I do envy him his ability to perceive every moment of past and future time as a part of a continuous present.",
      "total_reactions": 0,
      "user": "MovieMasterEddy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 4,
        "year": 2016
      },
      "score": 10,
      "text": "Seeing 56 at critic average makes my head explode. I watched only Ultimate cut and I have to say that it was perfect. I am unsure if I am supposed to call this superheroe movie as there are no superheroes with special abilities, aside of one who is certainly not a heroe, but lets say in that ganra this remains a king. Story, setting, characters, acting, all done greatly and paying some serious respect to the source.",
      "total_reactions": 0,
      "user": "Nikop0l"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "My favorite film adaptation of a comic book. Well cast and a groovy soundtrack. Must watch!",
      "total_reactions": 0,
      "user": "avamiller21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2016
      },
      "score": 10,
      "text": "Watchmen released into theaters after the astonishing The Dark Knight and boy, this film was amazing. Zack Snyder was able to create an underrated comic book story into a more compelling superhero flick then many other in it's genre. It has a dark tone and horrifying plot that gets you on the edge of your seat with goosebumps rising abve your skin.",
      "total_reactions": 0,
      "user": "Antgiog1202"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2016
      },
      "score": 6,
      "text": "This was a very disappointing book-to-film portrayal. Not only do they include the only stupid element from the book (Jon's ability to see into the future which I fully expected them to keep) but they also changed some things for the worst. For one, unlike in the book where there is some foreshadowing but the twist is still somewhat of a surprise, this movie gives away the identity of the villain pretty much from the beginning. Also, they give the characters superhuman abilities for some reason that, other than one minor glitch in the end of the book, never actually existed. Rorschach can't leap 10 feet into the air at will, Adrian Veidt isn't a superhero, etc. This not only made a dark and realistic world silly but it also made the closing sequence of the film incredibly retarded. And speaking of Veidt, this was by far the worst casting of all of the characters. In the book, Adrian Veidt appeared to be a \"larger than life\" person, not just in terms of his celebrity and persona but also in terms of his physical appearance. The dude was a big, strong, and intimidating person but Matthew Goode looks like a dorky little twerp. Malin Akerman also wasn't a great selection but she at least pulled of the role of Laurie Jupiter decent enough. The rest of the casting was fantastic and they nailed the style of the book spot on. The soundtrack was also really good. Honestly, other than the Adrian character in general, they really stayed very true to the book. It's just that this story is so reliant, not on action and effects but rather on the development of the characters and the world itself. And while they developed the world really nicely, I think they failed to develop Dr. Manhattan enough and his back story is really one of the key turns in the book. Overall I think they gave it a solid effort but it just doesn't have the same impact. I think people who read the book will at least find this movie intriguing and somewhat enjoyable but I think people who never read the book will find the movie mediocre at best.",
      "total_reactions": 0,
      "user": "TheArchetypes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2017
      },
      "score": 10,
      "text": "Watchmen is the most underrated book to adaptation ever. The cast did a great job but the MVP is Zack Snyder, who does an amazing job of creating an almost perfect film.",
      "total_reactions": 0,
      "user": "TheMoe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2017
      },
      "score": 0,
      "text": "Disappointed by the movie. Was expecting much much more. The movie could have been good but there were so many problems with the plots and the overall direction of the movie. The overall execution was terrible and it was a boring mess with not even half way through the movie.",
      "total_reactions": 0,
      "user": "fadithebeast"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2017
      },
      "score": 0,
      "text": "This movie was an utter disappointment for me. The plots were not properly executed, there were many loopholes and the story was boring to be honest. The problem with these commercial films is that their whole purpose is to make money out of amateur movie goers rather than make something that should critically make sense.",
      "total_reactions": 0,
      "user": "ammeoo"
    }
  ]
}