{
  "mc_avg_user_score": 7.0,
  "mc_metascore": 52,
  "mc_mixed_rating_frequency": 57,
  "mc_movie_name": "Water for Elephants",
  "mc_negative_rating_frequency": 14,
  "mc_positive_rating_frequency": 111,
  "mc_pro_critic_reviews": [
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 90,
      "summary": "The filmmakers clearly value their public, crafting a splendid period swooner that delivers classic romance and an indelible insider's view of 1930s circus life."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 88,
      "summary": "Like \"The Notebook,\" but with an elephant, the unexpectedly good film version of Water for Elephants elevates pure corn to a completely satisfying realm of romantic melodrama."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 85,
      "summary": "One of those big, extravagant-looking romances that you might automatically deem \"conventional\" - except for the fact that almost nobody makes big, extravagant-looking romances anymore."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "The film has a pleasing retro-ness that often mitigates the dullness."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "In Water for Elephants, Waltz plays a circus owner and ringleader during the Great Depression, and when he's onscreen, every eye is on him, no matter who is talking."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "In an age of prefabricated special effects and obviously phony spectacle, it's sort of old-fashioned (and a pleasure) to see a movie made of real people and plausible sets."
    },
    {
      "critic": "Carrie Rickey",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "Steamy and sexy with a smack of sadism, the movie is a throwback to old-school Hollywood action/romance."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "\"Twilight's\" Robert Pattinson gets a chance to shed his sparkly vampire persona and play a romantic lead with a pulse. The change suits him."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "Reese Witherspoon can do a lot of things as an actor but playing a damaged-goods Depression era dame isn't one of them."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2011
      },
      "score": 70,
      "summary": "Yes, this is the kind of movie you could imagine seeing with your grandmother at a suburban mall, but does everything have to be edgy and dark and genre-reinventing?"
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 70,
      "summary": "If the circus is a hierarchical pyramid, August is at the very top. It's a part tailor-made for the accomplished Waltz, an Oscar winner for \"Inglourious Basterds,\" and he eats it alive."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2011
      },
      "score": 63,
      "summary": "Sadly, passion and romance are two ingredients missing from this melodrama, which does an excellent job of re-creating the Depression-era circus business."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 63,
      "summary": "When the tent folds and the dust settles, the question is not whether the movie is good – sorry, not a chance – but whether it's garish enough, sappy enough, Hollywood enough to rise to the level of being likeably bad. Is it, in short, a guilty pleasure?"
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 63,
      "summary": "Big, slick and showy. It is also undeniably effective entertainment."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 63,
      "summary": "Mildly entertaining, though the best performances come not from the stars, but the supporting players."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 63,
      "summary": "It's all in the telling. Gruen provided grit and pungent detail. The movie settles for gloss."
    },
    {
      "critic": "Angie Errigo",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2011
      },
      "score": 60,
      "summary": "Familiar but enjoyable. Not being funny, the elephant (Rosie, played by nine-foot enchantress Tai) is the real star as the most moving and only joyful presence in sight."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 60,
      "summary": "The primary drawback is the lack of chemistry between the leads, Reese Witherspoon and \"Twilight's\" Robert Pattinson."
    },
    {
      "critic": "Lisa Schwarzbaum",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 58,
      "summary": "Something is wrong under this big tent. Actually made to resemble a good old-fashioned, crowd-pleasing movie, this cinematic Water for Elephants droops and lumbers like Rosie the elephant herself."
    },
    {
      "critic": "Andrea Gronvall",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "Features a credible and sympathetic performance from Robert Pattinson as an orphaned veterinary student who joins a traveling circus. Yet the film otherwise suffers from a lack of showmanship."
    },
    {
      "critic": "Karina Longworth",
      "publication": "L.A. Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "Beautifully designed, sufficiently choreographed, insipid but watchable, Elephants stresses that showbiz is about the maintenance of an illusion by any means necessary."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "The most rewarding way to watch Water for Elephants is to focus on the sideshow of costumes and craftsmanship, because the romance in the center ring smells like trained animals going through the motions."
    },
    {
      "critic": "Mary Elizabeth Williams",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "You know how they say to find one thing and do one thing well? Well, Pattinson's thing is glowering. It doesn't help matters that the movie itself is so painfully mediocre."
    },
    {
      "critic": "Wesley Morris",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "The camera, costumes, and art direction do everything right. Too much so. The movie strips away both the grand weirdness of the circus and the dire desolation of the Depression. Diane Arbus and Dorothea Lange are exchanged for Vanity Fair."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "It's a tastefully managed, passionless melodrama, full of brooding looks and reasonably sweet moments, but typified by a scantly characterized central couple who bring no sense of engagement to their relationship."
    },
    {
      "critic": "Pam Grady",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "Waltz is the highlight of this glossy but plodding drama, a live wire in a movie that sorely needs a jolt."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "Whatever romance and charm Gruen summoned forth from these rough and tumble show people living by their own laws in a traveling, self-contained world of poverty and cruelty, director Francis Lawrence has hacked and ground them off."
    },
    {
      "critic": "Todd McCarthy",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "Will please fans of Sara Gruen's best seller, but it lacks the vital spark that would have made the drama truly compelling on the screen."
    },
    {
      "critic": "Ben Kenigsberg",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2011
      },
      "score": 40,
      "summary": "Without larger-than-life drama or a steady stream of historical detail, it's merely a gargantuan production that's been lavished on a story hardly worth trumpeting."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 40,
      "summary": "Add romantic chemistry to the list of things that fall flat in the film, alongside dialogue and acting."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 38,
      "summary": "Less fun than any circus movie I've ever seen - and I've seen lots. Maybe they should send in the clowns."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 4,
        "year": 2011
      },
      "score": 30,
      "summary": "No one would mistake the Benzini Bros. Circus for the greatest show on earth – the Depression-era traveling troupe is a junker compared to the gold-standard Ringling Bros. – but still, a film has to try pretty hard to render lions and tigers and trapeze artists so uniformly underwhelming."
    },
    {
      "critic": "Stephen Holden",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 20,
      "summary": "Short-circuits the novel's quirky charms and period atmosphere by its squeamish attitude toward gritty circus life and smothers the drama under James Newton Howard's insufferable wall-to-wall musical soup."
    },
    {
      "critic": "Richard Corliss",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 20,
      "summary": "The proceedings get so slow and saccharine that viewers will relishes the film's moments of redeeming idiocy. In one of them, Marlena whispers to Jacob, \"Bring Rosie to my tent and don't tell anyone\" - as if the roustabouts wouldn't notice a 12-ft.-tall, 10,000-lb. creature striding down the midway."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2011
      },
      "score": 20,
      "summary": "How do I count the ways this movie goes wrong?"
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "WOW!  More than I expected!  Great entertaining movie for both men and women.  Rob Pattinson just jumps off the screen.  He is excellent in this.  Christoph plays the villain magnificently.  Great film with excellent cinematography and costuming.  All around a must see movie.",
      "total_reactions": 10,
      "user": "wingsofabird"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "Excellent movie!  Breathtaking!  Best performance ever by Rob Pattinson, Reese Witherspoon, and Christoph Waltz.  Truly a movie everyone should see.  Just wonderful!",
      "total_reactions": 9,
      "user": "epictimes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "This is fantastic, old-fashioned, magical entertainment.  A strong core cast and an amazing elephant transports you away.  I was touched by the story.   Christoph Walz managed to be scary, horrible, and strangely sympathetic at the same time.  Reese Witherspoon looked like a 1930's movie star with spunk, and Robert Pattinson combined innocence, earnestness and longing that worked perfectly for the part.  Super supporting cast as well.  Definitely worth seeing.",
      "total_reactions": 8,
      "user": "coookies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "This was such an awesome movie! I seriously don't understand why critics gave it such a low rating. I am usually a very harsh critic when it comes to movies, but Water for Elephants was great. I was sitting on the edge of my seat throughout the whole film, and there was never a dull moment. The ending will not disappoint either! I loved the circus theme of the movie, and the acting was great, especially Reese. My only complaint would be Pattinson. I like him a lot, but it is true that he uses his looks to overshadow his poor acting. Overall, his acting didn't spoil to movie in any manner. I would suggest everyone see this movie!",
      "total_reactions": 7,
      "user": "analee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "What a great movie!!I don't know what the critics who gave bad reviews were watching but I was really engrossed in it; at one point I noticed my heart was even beating fast as it became so suspenseful. The acting really should be commended as Robert Pattinson and Christoph Waltz really stood out. As a fan of the book, Rob played Jacob exactly how described and the raw emotion spilled out of him exactly at the points they should have. Very pleased with his performance and no, I am not a twihard. Christoph of course was perfectly cast as the villian and did an excellent job as well. I like Reese Witherspoon but felt if there was a reason the chemistry was lacking it was because she was a little icy. However, in the book her character was never really fully developed either. Overall, what I'm trying to say is that it is definitely worth the price of admission. In fact, I am going to see it again!",
      "total_reactions": 7,
      "user": "Lala7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "Completely surprised at how much I enjoyed this movie. It was very sweet in places but also had some depth. Pattinson surprised me the most. He is a very good actor with the potential to be great in a few years time.",
      "total_reactions": 7,
      "user": "livetour"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "This movie has an essence of charm about it that has been lacking in movies for a while. It is a wonderful adaptation of a wonderful book. Fabulous scenery, costumes and actors.",
      "total_reactions": 7,
      "user": "new2011"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "Great movie!  Must see!  Robert Pattinson is the heart of the movie.  Reese and Christoph wonderful. Chemistry between all three main characters is flawless.   A movie for all ages and sexes.  Just beautiful and entertainment at its best.  And Tai -- just marvelous!",
      "total_reactions": 6,
      "user": "timeisnow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "I'm going to sound like such a girl when I write this but after seeing water for elephants I felt so emotional. It was just so beautiful! I left the movie feeling very moved by the story and that hasnt happened in a very long time!",
      "total_reactions": 6,
      "user": "work75"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "My husband watched the trailer and based on that was happy to take me to see WFE today and he liked it as much as I did. The script made improvements on the book, all the acting was above par, and the sets, locations and costumes couldn't have been better. A very satisfying and moving film. Makes a great date movie, too.",
      "total_reactions": 5,
      "user": "FilmFanForever"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "I can not believe what some critics have written about this wonderful film. Did they even see the same movie I did?? They probably had decided they were going to harshly review it before they even saw it. Completely unprofessional. This movie was great!",
      "total_reactions": 5,
      "user": "joeboggs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "Awesome! Good old fashioned movie with a slow-burn romance - not a in your face one.  Rob Pattinson was superb - really showed his range and his ability in this one.  His facial expressions said it all.  A big step forward.  Reese and Christoph were good as well.  It was a beautifully made movie with excellent acting and directing all around.  Would recommend this for both sexes.  Male and female viewers alike will enjoy this.  Only complaint is the romantic scenes should have played out just a little longer to make it just more appealing and convincing.  Overall 5 out of 5 for this movie.  Best we've scene in a few years.",
      "total_reactions": 3,
      "user": "goodmoviefan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "Fantastic movie! The relationships the characters build with each other and the elephant are wonderfully portrayed. I thoroughly enjoyed this movie and highly recommend it!",
      "total_reactions": 3,
      "user": "jessej"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "My wife took me to this, so I was not sure if I would like it.  Well, I have to say that I really enjoyed it.  Definitely something that can be enjoyed by men as well as women.  I have to say that the main characters, as well as all of the supporting case were great and the story was well told.  It had just enough action as well as romance to hold the viewers attention. It was much more than I expected and a movie that I would recommend.",
      "total_reactions": 2,
      "user": "Justmike"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "No more Edward Cullen; from now long Rob Pattinson will be known as Jacob Jankowski. It's his best performance ever doing a great job along his co-star Reese Witherspoon and Christoph Waltz. Even though   it exists a lack of chemistry in the love story; the good performances and the great landscape save the movie making a great show for the viewers. We have the good guy, the gorgeous girl and the terrible villain; the perfect mix for great blockbuster.",
      "total_reactions": 2,
      "user": "skandar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "Water For Elephants is one of my all time favorite books and now it is one of my favorite movies.  Rob was excellent - really proved himself in my opinion.  Christoph was amazing too.  My entire family enjoyed it.  A must see movie!  Very, very good! A 10!",
      "total_reactions": 2,
      "user": "valfa"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "I can not describe how great this movie is! It will please its target audience entirely and it may surprise a few others too. Go see it and you wont be sorry.",
      "total_reactions": 2,
      "user": "ztatts"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "A beautiful film that definitely has an emotional punch. Robert Pattinson did an absolutely fine job of portraying this character. He is a somewhat \"lost\"  character struggling with a lot of pain and grief. He displayed this very well along with the highly important connection with the elephant, who he is utterly charming with.",
      "total_reactions": 2,
      "user": "Gladdy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "I was hesitant to see this movie because of hearing it was a love story. This movie is excellent! It's the best movie I've seen this year...i loved it!",
      "total_reactions": 1,
      "user": "pagepirate"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "Christoph Waltz absolutely made the movie. I was expecting this from the start, but I was also surprised to see that Robert has somewhat gotten better, even though he could have been a little bit more emotional. Not that he wasn't in all the movie, because there were some scenes in which I was thrilled with him. I don't think it deserves a 5.3, it was entertaining, it was beautiful, great actors, and come on, how come you couldn't love Tai, the Elephant.",
      "total_reactions": 1,
      "user": "RaysNBeanies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "Firstly, I am a librarian and I rarely like films based on movies. It took me a really long time to warm up to the Harry Potter films. \"Water for Elephants\" was clearly going to be a tough sell for me. However, I finally caved to the pleas of my Twihard teen and took her to see WFE expecting a huge disappointment. Boy was I wrong, it was a wonderful surprise and though it did take a few shortcuts it was certainly not a disappointment to this bibliophile, in fact I am running out to re-read the book again.",
      "total_reactions": 1,
      "user": "NinaBee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "Good movie, depicts the harshness of live during the 1930's  Proof that simple movies without major unnatural computer inhancements are possible  today.",
      "total_reactions": 1,
      "user": "mact0n"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "Every actor on this movie delivered what was required of them brilliantly. It is a good old fashioned romance with a fair bit of drama thrown in. Very entertaining.",
      "total_reactions": 1,
      "user": "galaxy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "This film proves that Robert Pattinson has a lot of potential to be a great actor. He has taken a big step in the right direction with this wonderful movie. Highly enjoyed it and would recommend it to anyone. Of course there are still those that resist Robs charms but more and more people are seeing his potential. Give him time. He could be great. Mark my words!",
      "total_reactions": 1,
      "user": "dvd1938"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "Absolutely a beautiful movie with wonderful performances from all the cast. Anyone who says differently has their \"I hate Rob Pattinson and everything he does\" glasses on (including some critics)!!!! But trust me, this movie is very worth seeing and very well done by all involved!",
      "total_reactions": 10,
      "user": "buddy15"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2012
      },
      "score": 4,
      "text": "While the source material was quality, this film doesn't quite pan out, as Robert Pattinson's performance is flat, while he and Reese Witherspoon have the collective romantic chemistry of a dirty dish towel.  That said, Christoph Waltz's deliciously evil performance counter-balances quite a few missteps.",
      "total_reactions": 4,
      "user": "JTKelley"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 1,
      "text": "Here is something not new.  The elephants were abused in training so they would know how to act abused.  Charming.",
      "total_reactions": 4,
      "user": "CritiqueGirl"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2011
      },
      "score": 1,
      "text": "Water for Elephants",
      "total_reactions": 4,
      "user": "Kiki"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2011
      },
      "score": 8,
      "text": "The acting is nice and the background looks neat. Water for Elephants has a nice feature along with great characters. Although, Robert Pattinson's acting was very good on a role and it's more interesting than watching those stupid Twilight films, but he did great job in a role and I think that Twilight shouldn't reveal in the first place. The movie is very good and it's not much excellent film like Titanic, but it brings a decency for the terrific actors including our best actor, Christoph Waltz. Enjoy this movie and it's cool.",
      "total_reactions": 2,
      "user": "DarkCritic"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 0,
      "text": "Putting Robert Pattinson with Reese Witherspoon and Christoph Waltz is an absolute embarassment, for Rob and for Reese/Christoph.  Robert Pattinson cannot show proper emotion when he acts.  He acts like a piece of driftwood that just stares at the screen and smolders.  Yes, his fans are going to say he's amazing no matter what he does, so you really can't trust the \"fan reviews\".  If you want to be bored to death, by all means, go watch this movie!",
      "total_reactions": 13,
      "user": "KristinM"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 6,
        "year": 2011
      },
      "score": 4,
      "text": "\"Please don't die...please don't die,\" a young boy pleas to the elephant in decline as blood hemorrhages from his senescent trunk onto the pavement of a dirty Mexican street, where it pools, the same place as his tears, in \"Santa Sangre\", the 1989 cult classic that makes David Lynch's experiments in surrealism look demure by comparison. The boy magician loves the mammoth beast, but to the starving people of a depressed Mexican town, the pachyderm represents meat. Unlike August in \"Water For Elephants\", fellow circus owner Orgo, perhaps, recognizes the obscenity of feeding his animal acts while destitute people go starving. While the elephant makes its way through the red-light district of the city slums, the hungry masses wait in anticipation with hammers and greedy hands for the funeral procession to culminate at the steep rock overhang, where the coffin, as if at at sea, slides down from its ramp and winds up at the bottom of the gorge. On cue, the people surround the tremendous casket like ants, breaching its iron cover, in which one man with a machete proceeds to hack away at the venerated animal to pieces, starting with the trunk, so forlorn looking in its new context as a vivisected edible. The boy sees the circus performer being savaged for food. He makes water for the elephant. That's what the filmmaker needs out of its lead actor. Jacob has to cry, because its integral to the film's success that the quasi-veterinarian loves the elephant and girl in equal measure. If Robert Pattinson, an actor of limited range, couldn't turn on the waterworks, then the emotional heavy-lifting should have fallen to the elephant. From the novel, Sara Gruen writes, \"I turn to Rosie. She stares at me, a look of unspeakable sadness on her face. Her amber eyes are filled with tears.\" This is where the reader feels the bond between man and animal the strongest. But for some inexplicable reason, the scribe leaves out this key scene of indelible animal cruelty, in which August flicks a cigarette into Rosie's mouth, forcing the panicked animal to fish the butt out with her trunk. Instead \"Water For Elephants\" relies on Pattinson as the entry point for viewers in regard to the film's largely implied violence. Unlike his literary predecessor, the actor, best known as a glittering vampire from the \"Twilight\" saga, looks insufficiently mortified at the thought of August thrashing Rosie with a bullhook behind the cage's sliding door. He doesn't fight hard enough for the elephant. He lies down in resignation after August's yes-men act as bulwarks against his halfhearted attempt at intervening. The Gruen novel places Jacob with Marlena when the beating takes place, wracking the Cornell dropout with guilt. Had the book mirrored the film's narrative restructuring, the Jacob from the bestseller would have been pounding his fists on the iron door, while at the same time, screaming bloody murder at August to stop the senseless bludgeoning. The major failing of this adaptation is that the script prevents Jacob from being Rosie's protector. The elephant should be man's best friend, so to speak. \"Water For Elephants\" is much too preoccupied with the pretty people. There's no room for the freaks. Too bad, because a nod to \"Freaks\" wouldn't necessarily be a bad thing. By putting a deemphasis on the presence of human oddities, ubiquitous to all circuses during the Depression era, the Benzini Brothers' operation looks too respectable and modern, too politically correct to be believed. In the book, the flea-bitten operation stumbles upon Rosie as an afterthought, a consolation prize, when Charles Whatsit, a man rumored to have an infant stuck in his chest, had long been snatched up by the Ringling people, much to Uncle Al's chagrin. He loved freaks. Unfortunately, this mildly bowdlerized adaptation of the popular novel, makes the autocratic ringmaster disappear, or maybe he's sticking out of August's chest, since, after all, much of the circus owner's despicable attributes has been folded into August's character, in particular, Al's many cutthroat practices, in particular, his habit of \"redlighting\" inessential employees from a moving train. The spirit of August's character gets hurt by this amalgamation. The menagerie director, flawed in the Gruen novel, is now completely without the nuances of a recognizable human being. He's a monster. \"Water for Elephants\" makes no mention of his paranoid schizophrenia. Lost in the transition from the book to the screen is that August dearly loves his wife. It's Al, not August, whom Jacob upsets when he puts down Marlena's favorite liberty horse. Ironically, August wants to protect his wife from the gunshot blast, but inevitably, because of his mental illness, he can't protect her from himself. The film renders him one-dimensional. \"Water for Elephants\" is all about Jacob's love for Marlena. It has no room for any competing loves, human or animal-wise.",
      "total_reactions": 1,
      "user": "Shiira"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2011
      },
      "score": 5,
      "text": "I was hesitant to go to this film as I saw one of the Twilight movies and that was one of the most horrible experiences of my movie going career.  However, a friend of mine talked me into it.  Water for Elephants turned out to be a better movie than I thought it would be, albeit predictable.  As it turns out, Robert Pattinson was not horrible as I thought he would be, but there are still moments where the look on his face does not match the scene, such as when his boss was training him how to use the elephant stick to train the elephant.  He had this stupid grin on his face the whole time even though what his boss was showing him was horrifying.  However, overall he did a pretty good job.  I just thought it was a tad too predictable and it started to bore me halfway through.",
      "total_reactions": 2,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2011
      },
      "score": 5,
      "text": "Water for Elephants is a reasonably entertaining movie that will get ahold of you emotionally if you're not careful. Unfortunately, it has several significant flaws that really kill the overall product.",
      "total_reactions": 1,
      "user": "themostbrian"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2011
      },
      "score": 0,
      "text": "How can Hollywood not know these animals were abused.  They are always abused.  And of course, there is now video to back it up.  Good work Reese Witherspoon!",
      "total_reactions": 1,
      "user": "chocolatekiss"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2011
      },
      "score": 6,
      "text": "This movie has a wonderfully photographed period look in its costumes and in its images of circuses on the edges of 1931 American towns, with pennants fluttering in strong winds atop tents.  Such images made we want to run away and join a circus unrelated to this movie, which is melodramatic and emotionally manipulative in unclever, obvious ways.  Roger Ebert pointed me to this movie by praising what it could do without crass special effects.  But it still has the bludgeoning moralism of many action movies, a tyrannical villain (played with panache by Christoph Waltz) and a two-dimensionally \"good\" antagonist (Robert Pattinson, who looks great, but is capable of 1.8 facial expressions as an actor) who is, over and over again, placed in situations in which he can't do anything to right the wrongs (often controlled by Waltz's character).  \"Oh, wrench your hands in frustration, and await catharsis\" these scenes instruct us.  The director has annoyingly confused  melodramatic tension with actual drama--evidently ordering these players to be cardboard-like and passive (except Waltz, and maybe the elephant, who steals the movie) in order to ratchet up frustration and expectation (\"oh, when will evil be recompensed?!,\" we are supposed to feel, chronically).  Implicitly, the movie's soundtrack, which is one long, monotonous instruction to \"feel the impending doom within this ambiguously sweet spectacle\" is really the star of the movie, when it could have been Reese Witherspoon, or somebody who could act better than Pattison, who looks, without benefit, like he's in an ad for Polo cologne in much of the film.",
      "total_reactions": 1,
      "user": "Johann_Cat"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2011
      },
      "score": 5,
      "text": "I, like a lot of sons probably, went to see Water for Elephants with my family on Mother's day. I've got to say, this movie was pretty solid for the most part, and I definitely didn't expect it to be. A lot of elements about this movie were really fantastic. The cinematography for one, Director of Photography Rodrigo Prieto really did fabulous work showing you a side of the circus most of us will never see. Scenes on the Benzini Brothers train are extremely colorful and well shot, there's also a montage of Jacob's first circus that really stands out. The writing was also top notch and I've been told that the book this movie is based on is very good, so that's not a big surprise. This film is also paced well, it moves along at a good steady pace for a large majority and only drags for a few scenes. However, the most notable item in this film is Christoph Waltz. This guy is really just a phenomenal actor, no doubt about it. Now I've only seen this and Inglorious Basterds but in both of these movies, he's just incredible and I'm glad he's getting the recognition he deserves. That covers what I liked about the movie, now why didn't it get a higher score? This movie has some of the WORST lead performances I've ever witnessed on film. It's a huge let down because everything else about this movie is quite strong, but Pattinson and Witherspoon have absolutely no chemistry, or acting capabilities period. It's literally painful watching these two butcher what could have been such a great love story with their idiotic mumblings and **** terrible presence. You end up wishing Christoph's character would just kill them both and we can just watch him be crazy for the rest of the movie. It's like if an artist hand painted a beautiful piece and then stood up, dropped trou, and took a gigantic **** all over the canvas and tried to have a conversation with it. Read the rest of the review on my film review site, rocketcrossing.com, and check out our facebook page at facebook.com/rocketcrossing.",
      "total_reactions": 1,
      "user": "Rocketcrossing"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2011
      },
      "score": 5,
      "text": "\"Water for Elephants\" is an interesting story that would probably have been more entertaining with a different cast. The three main players possessed no chemistry, and at the end, I no longer cared about their relationships.",
      "total_reactions": 1,
      "user": "BamaFalstaff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "After seeing the trailer for this film I was not impressed and was thinking if I saw it at all it would be on DVD; well I was quite wrong and I am glad I went and saw it at the theater. I thought the acting was great and the story line was quite intriguing.",
      "total_reactions": 0,
      "user": "Qadosh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "Beautifully filmed, acted greatly, splendid imagery. Robert Pattinson really shines not only as a great actor but as someone who shall we say is more than aesthetically pleasing. Even the fantastical and absurd ending fits in the riotous setting of the circus.",
      "total_reactions": 0,
      "user": "iamanicon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "Robert Pattinson broods once again as the innocent young man who ends up as the vet for a small Depression-era circus. His attraction to the show's star (Reese Witherspoon) causes conflict with her cruel husband (Christoph Waltz). The film makes circus life look romantic, beautiful and cruel (especially to the elephant), but the simmering discontent takes too long to ignite. It's not a bad film, but the drama drags and the most emotional scenes revolve around the animals, not the people.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "Astounding film with great story and fantastic setting. The magic feel and adventure of a circus was brought to life on screen in such a surreal manor. There was not a moment in which I wasn't transfixed to the screen whether it be due to the beautiful cinematography and depiction of the animals, or the way in which the story just motored along from half way through. The film reminded me so much of Titanic by James Cameron in it pacing and evolution of plot.",
      "total_reactions": 0,
      "user": "beelzie14"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2011
      },
      "score": 8,
      "text": "Water for Elephants, like many movies based upon books, can be a disappointment if you have read the novel. But if not you will be launched into it's vibrant world filled with amazing and genuine emotion and humour. Each actors amazing performance completes the world allowing you live by them in this amazing experience.",
      "total_reactions": 0,
      "user": "Creativita"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "Water for Elephants is a pretty good movie. The love triangle aspects are easily the weakest elements but are thankfully not too overpowering or heavy handed. The real delights of Water for Elephants are it's excellent period detailing, creeping tension and decent performances.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "Good circus flick but it really was pretty predictable.  The main characters were okay but August's bad side was really disturbing.  The animals were charming and the elephant was quite fascinating.  Kind of draggy in places and it was quite long...  Enjoyed the \"flashback\" narrative.  It worked in this film!  Would have been less impressive on the TV - glad I saw it in the theater....",
      "total_reactions": 0,
      "user": "TheTerp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "Nicely shot movie that shouldn't be missed. New story, new locations, attracting performances by  Rob Pattinson, Reese Witherspoon, and Christoph Waltz. An elephant is one of the main roles, seems as he enjoys acting. What bugs me  is how easy for the circus owner, Christoph Waltz, to throw workers out of the train, as if there is no law. Despite high acting, the character of the circus owner is not deeply explored.",
      "total_reactions": 0,
      "user": "Hfahmy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "This melodramatic, big top, forbidden love, three-ring, tearjerker, chick flick is not the greatest show on earth.  It is, however, a deeply romantic, beautifully envisioned and passionate ode to the Hollywood of yesteryear.  Simply put - and if movies were to mate - it would most certainly be the cinematic love child of THE NOTEBOOK and TITANIC.  And if WATER FOR ELEPHANTS were indeed a huge, seagoing passenger vessel - then it's actors on screen chemistry (or huge lack thereof) would be the metaphorical iceberg that started the ship sinking.  Good thing it ended when it did...you know, before my 'stupid allergies' starting acting up. *sniff*",
      "total_reactions": 0,
      "user": "MovieGuyBrian"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "Hollywood Canâ",
      "total_reactions": 0,
      "user": "CSearcy81"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "I guess we saw a different film than the critics saw. This is a big old fashioned melodrama and hopefully the critics won't stop the good word of mouth that is already circulating around this movie.  The three lead characters are directed with restraint, not lack of passion, thank goodness, or the movie would have become a cartoon.  The audience I sat with -- comprised of train enthusiasts, old performers of many stripes, animal lovers, cinema buffs, and very, very few cougars or screamy tweens -- enjoyed it immensely.",
      "total_reactions": 0,
      "user": "Room340C"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "I didn't think Robert Pattinson was all that much to look at. I gotta be honest with you. I don't know what all the kids see in him, but okay.",
      "total_reactions": 0,
      "user": "BlindFilmCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "Critics were way too harsh on this movie and Robert Pattinson. He played his part very well and looked amazing on screen. He definitely has a presence. The movie was wonderfully shot and portrayed. I loved it.",
      "total_reactions": 0,
      "user": "baryorkie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "Completely shocked at how much I liked this movie! Everyone needs to see it! I dont think it got half the credit it deserves!! Trust me...its really good!!",
      "total_reactions": 0,
      "user": "strikeitrich"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 5,
        "year": 2011
      },
      "score": 4,
      "text": "WFE is this years Avatar. Raving Reviews, huge accolades, then when the shine wears off you realize you have seen this movie a hundred times before, only this time they are blue, sorry I mean they have an elephant.",
      "total_reactions": 0,
      "user": "Qbeing"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "Water for Elephants is a breathtakingly magnificent movie which captivates the audience. With a cast of three tremendous actors and an elephant that steals your heart and the show, you can't help but sit in amazement at the sheer talent on screen before you. This movie delivers many types of films with action, comedy, a touch of thriller and most importantly romance! There won't be a dry eye in the house or an empty one either!",
      "total_reactions": 0,
      "user": "ChristieJade"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "This movie was unexpectedly good in my opinion. I think a 52 by the critics is a little low. I think Robert Pattinson, as much of a fan I am not of his, I personally believe that this is his beginning into the REAL acting world. He did a great job in this film. Christoph Walsh again was absolutely amazing. He is a really talented actor, he seems hes growing into that sinister character in his films now. This movie brought us into the world of the circus and its ddidn't seem to be as happy-go-lucky as everyone thought it was at that time. This film was unexpectedly good to me, I only went to see it because my gf was dying to see it because she read the book, but I'm glad I did watch it, it was very good, great acting all around, even from Reese Witherspoon was excellent as Augusts wife. Very good film, 8/10.",
      "total_reactions": 0,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2011
      },
      "score": 7,
      "text": "Much more than expected--- The fine direction and cinematography that enriches the film technically, is reinforced by the best perfomance ever by Rob Pattinson also supported by Waltz and Witherspoon. Definitely, the best movie made in years about circus since The Greatest Show on the Earth.",
      "total_reactions": 0,
      "user": "zutopia"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2011
      },
      "score": 10,
      "text": "Beautiful, old fashioned romance.  I loved the chemistry between Reese Witherspoon and Robert Pattinson.  I thought the acting was superb!  Robert Pattinson deserves kudos for his peformance.   I don't identify him as much as Edward Cullen anymore - I think him of as Jacob Jankowski.",
      "total_reactions": 0,
      "user": "Nene86"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "It pains me every time i see a movie like this getting ~50 score when terrible terrible movies like tower heist get better ratings.  Yes this movie barrows many aspects from other movies but, the story being based off of a novel has more depth than any typical movie and that's why its worth watching.",
      "total_reactions": 0,
      "user": "hootis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "I love the book!  I think I like the story about Jacob as an old man more than the actual love story.  I wished that they played that up a bit more in the movie.  As for the love story, I though it fell a little flat.  Reese, whom I love, I thought wasnâ",
      "total_reactions": 0,
      "user": "Irishblue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "Same old story, water for Elephants was just fine. Characters were good enough but story was something, i would say, boring or at least close to that. It was one of those typically predictable movies.",
      "total_reactions": 0,
      "user": "ansi322"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2011
      },
      "score": 10,
      "text": "Great adaptation from the book - I really was surprised!",
      "total_reactions": 0,
      "user": "mentalscreen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "Considering I am a huge Robert Pattinson fan, I heard about this movie and decided I had to read the book before seeing it. The book being phenomenal, I bought the movie and watched it. It was fabulous. I think Rob just gets better and better with each movie that he is in, and of course Reese was perfect as Marlena. A love story set in the 1930s, it was the tale as old as time story of forbidden love, but done in such a unique way. They really did the book justice, and I was surprised about that. All of the actors played there parts incredibly.",
      "total_reactions": 0,
      "user": "ashley_"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 3,
      "text": "This movie is pretty wretched. The acting is bad. The plot is thin. The love is stale. The elephant is . . . well I guess I kind of liked the elephant.",
      "total_reactions": 0,
      "user": "Greatbeallo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2012
      },
      "score": 5,
      "text": "Interesting to enter the cirkus universe. But the mysterious foreigner, the sexy blond, the bad guy, we've already seen it. it was not realistic enough.",
      "total_reactions": 0,
      "user": "pinkscreen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2012
      },
      "score": 5,
      "text": "Water for elephants is a nice looking film but i couldn't get over the fact that the casting in this movie couldn't have been worst. I also started to lose interest in the last 30 minutes because of how boring it was.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2013
      },
      "score": 4,
      "text": "Such a corny movie. The entire set up was there except it just didn't deliver. The acting was pretty bad, and it wasn't as magical or exciting as I thought it was going to be. Could have been far worse, but it exceeded in terms of disappointment.",
      "total_reactions": 0,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2012
      },
      "score": 9,
      "text": "Interesante ver a Robert Pattinson en un resgistro distinto al de Edward Cullen. Film de época para los amantes del cine, las películas románticas, y la defensa de los animales. Está más guapo como humano que como vampiro!!!!",
      "total_reactions": 0,
      "user": "jordi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2013
      },
      "score": 7,
      "text": "This was a decent movie. Christoph does a wonderful job playing a somewhat crazy circus ringmaster. The chemistry between Pattinson and Witherspoon is somewhat annoying in that it isn't hardly developed at all, it simply appears. Nonetheless, a movie that is worth at least one watch.",
      "total_reactions": 0,
      "user": "artifaxx"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "\"Water for Elephants\" could be more than it is. A beautiful story about love. Circus is stage, it has many colours. Young man loves to older woman than him. It has an interesting story and screenplay but...Robert Pattinson has no charm with Reese Witherspoon. Pattinson is a good actor but there are no chemical link with her. It's a pain becauses this love story I really loved it.",
      "total_reactions": 0,
      "user": "mapizarro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "really good movie. great acting from both Pattinson and especially Waltz. Feature good characters and had some fun moments. Waltz' character was terrifically portrayed and made the viewers truly dislike the man. would've like more depth to witherspoons character",
      "total_reactions": 0,
      "user": "cheeseberger11"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "this is a well put together drama. i love that it's not cliche, and that it happens on a circus is fantastic. the only thing that is dissapointing is that the 2 main actors don't fit together i mis the chemistry between them.....",
      "total_reactions": 0,
      "user": "jasper6333"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "In this case, the movie far exceeded my expectations. Beautifully filmed. Great acting. Loved the costuming and authenticity to the time period. music score was amazing. Well told story and lovely feel to the film.",
      "total_reactions": 0,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "A very inspiring love story about two people who fell in love truly. I just feel good watching this kind of movie.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ]
}