{
  "mc_avg_user_score": 5.6,
  "mc_metascore": 71,
  "mc_mixed_rating_frequency": 9,
  "mc_movie_name": "We Are What We Are",
  "mc_negative_rating_frequency": 7,
  "mc_positive_rating_frequency": 13,
  "mc_pro_critic_reviews": [
    {
      "critic": "David Rooney",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 90,
      "summary": "The film is that rare modern horror movie that doesn’t simply fabricate its scares with the standard bag of postproduction tricks. Instead it builds them via a bracing command of traditional suspense tools... This is polished film craft."
    },
    {
      "critic": "Peter Sobczynski",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 9,
        "year": 2014
      },
      "score": 88,
      "summary": "Intelligently conceived, beautifully executed and filled with surprisingly convincing performances all around... We Are What We Are is that rare horror film that could play at both arthouse and grindhouse theaters without seemingly out of place at either one."
    },
    {
      "critic": "William Goss",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2013
      },
      "score": 86,
      "summary": "Among the stronger American horror films of the year."
    },
    {
      "critic": "Ian Buckwalter",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2013
      },
      "score": 85,
      "summary": "Mickle and co-writer Nick Damici gutted Grau's story to the bone. And they not only built something entirely new on that skeleton — they managed to equal and in many ways surpass the dark, bloody beauty of their source material."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2013
      },
      "score": 83,
      "summary": "It plays less like a contemporary horror film than an increasingly gruesome drama, building to a climax — completely original to this version — where the movie’s core themes are expressed through grotesque imagery."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 83,
      "summary": "Make no mistake: Mickle wants to make you jump and scream, but death only arrives in this movie once its world comes to life, which makes each sudden turn all the more intense."
    },
    {
      "critic": "Jessica Kiang",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 83,
      "summary": "We Are What We Are is just a great yarn, well-acted, elegantly shot and put together cleverly so that even its more visceral delights feel well-earned."
    },
    {
      "critic": "Nigel Floyd",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 2,
        "year": 2014
      },
      "score": 80,
      "summary": "Against all the odds, Stake Land director Jim Mickle has cooked up a controlled, affecting ‘companion piece’ that honours the Mexican original while deepening its themes."
    },
    {
      "critic": "Kim Newman",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2014
      },
      "score": 80,
      "summary": "A crunching, visceral transplant for this cannibal tale from its urban Mexican setting to an American milieu."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2013
      },
      "score": 80,
      "summary": "With its lush look, uniformly excellent acting, slow cadences and unhurried unspooling, We Are What We Are rewards your patience without skimping on the goods."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2013
      },
      "score": 80,
      "summary": "There’s a hint of Terrence Malick (or David Lowery, of “Ain’t Them Bodies Saints”) in the often-gorgeous photography of Ryan Samul, and a hint of Shakespearean grandeur in Sage’s portrayal of a dignified and honorable American father infused with an ideology of madness. I’m pretty sure I’ve never seen an exploitation film played so effectively as human tragedy."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2013
      },
      "score": 78,
      "summary": "An American remake of Jorge Michel Grau's 2010 Mexican shocker, this Sundance and Fantastic Fest fan favorite is undeniably creepy stuff that’s been given a dusty, American Gothic anti-sheen courtesy of cinematographer Ryan Samul."
    },
    {
      "critic": "Tirdad Derakhshani",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "\"The Silence of the Lambs\" gave us an articulate, Euro-suave gourmand cannibal, but served up pretty much the same stew."
    },
    {
      "critic": "Bill Stamets",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "A family implodes with a biting commentary on patriarchy."
    },
    {
      "critic": "Walter Addiego",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "The movie saves most of its modest number of jolts for its last quarter or so, which makes them all the more intense. They stick in your craw - and be warned, they're not for the squeamish."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2013
      },
      "score": 75,
      "summary": "A first-rate example of good storytelling and well-timed — while not excessive — gore. Its disgusting, hilarious conclusion left me eager to see what’ll be next from director Jim Mickle."
    },
    {
      "critic": "Jen Chaney",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 70,
      "summary": "What Mickle really gets right, and what makes this far and away a more artful and effective work of skin-crawly horror than its predecessor, is atmosphere."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 70,
      "summary": "Like the family, the film occasionally comes apart at the seams. But Childers and Garner are absolutely mesmerizing as Iris and Rose."
    },
    {
      "critic": "Pete Vonder Haar",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2013
      },
      "score": 70,
      "summary": "It isn't until the ending, which turns the squirm amplifier up to 11 and exceeded even my horrific expectations, that we finally see the story's potential realized."
    },
    {
      "critic": "Guy Lodge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 70,
      "summary": "That We Are What We Are steers just shy of silliness even at its most outrageous is in large part thanks to a committed cast of non-disposable character actors."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 63,
      "summary": "A grade A, meat-and-potatoes genre flick."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 60,
      "summary": "It’s all a little silly, but Mr. Mickle’s restrained gravity stifles the impulse to laugh."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 60,
      "summary": "While ultimately gory — and a little dopey — this is no rowdy, exploitation-y, gross-out picture. This is a film where ambience, glossy imagery and performance are more effective than the splatter."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2013
      },
      "score": 60,
      "summary": "Outside of its cracked psychology (well conveyed by papa Bill Sage), We Are What We Are is horror leftovers, neither inedible nor piping hot."
    },
    {
      "critic": "Chuck Bowen",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2013
      },
      "score": 38,
      "summary": "Jim Mickle plays the scenario deadly straight and unintentionally exposes all of its attendant absurdities, leaving the cast stranded."
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 37,
      "summary": "There’s some fun to be had, as long as your idea of fun includes being grossed out."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "This is a horror movie you can sneak past the ladies, gentlemen. There is such a feeling of despair through the whole ordeal that I became quite transfixed by the power of it. Far, far too many things go on at one time for this to be a one watch - there are deeper things in this movie than the visceral exterior. The movie flows toward the climax with unending vigor and dread that it grips you and the ending will leave you looking like a clueless teenager - the celery stick fell out of my mouth. Outstanding work that man. I give it 6 hurls out of 10 for gore and 3 sets of underwear out of 10 for fear.",
      "total_reactions": 1,
      "user": "rebelmswar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2013
      },
      "score": 9,
      "text": "One of the best horror/thriller movies I've seen in the last couple of years. I love the Hawthornian  Lovecrafting setting and mood.  Michael Parks (Jean Renault from \"Twin Peaks\") is one of my favorite actors, and he delivers an outstanding performance here as the local village ME/doctor.  The script is terrific  it pulls you in without throwing in the standard horror shocks and scares. And it absolutely saves its best for last, so stick it out!",
      "total_reactions": 3,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2016
      },
      "score": 2,
      "text": "We Are WHat We Are hand a fantastic concept on their hands, unfortunately it falls short with poor pacing, bad writing, awful acting, with scenes that jump all over the place, often times not making much sense, We Are What We Are isn't worth the time or energy spent watching this flick.",
      "total_reactions": 0,
      "user": "kuehnau"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2016
      },
      "score": 4,
      "text": "We Are What We Are is a film that simply was not up my alley for many different reasons. Aside from being incredibly cliche, the ending is far too much, and the film feels as if it is far more content just trying to shock its audience instead of creating any unique atmosphere. Though there are a few great scenes, the film's atmosphere is slack, the pacing is slow, and the film as a whole suffers from these inadequacies.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 7,
        "year": 2015
      },
      "score": 5,
      "text": "It is not at the level of poetry and it never will, but in this case there is a poesy by Philip Larkin called \"This Be The Verse\" that explains it perfectly:",
      "total_reactions": 0,
      "user": "jppl1999"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2016
      },
      "score": 8,
      "text": "The movie is brilliantly raw. Full of detail, tension, character and meaning. Its well acted, well written, well directed. Importantly, its horrifying, but not for the sake. It gruesomely brings to life an act that is usually amateurishly portrayed. Disappointedly, it does lose its sense of mystery early on, and some of the later scenes are a little ridiculous in contrast to the rest of the film. Still great.",
      "total_reactions": 0,
      "user": "Joellemm"
    }
  ]
}