{
  "mc_avg_user_score": 6.4,
  "mc_metascore": 45,
  "mc_mixed_rating_frequency": 11,
  "mc_movie_name": "Whatever Works",
  "mc_negative_rating_frequency": 24,
  "mc_positive_rating_frequency": 68,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2010
      },
      "score": 9,
      "text": "I'm a huge Woody Allen fan and I think this is the best film he's done since his 80's heydays. Larry David is brilliant and I was laughing right from the start and kept laughing throughout. Some people were turned off by the pessimism and sarcasm of the Larry David character, but I thought he was hilarious. Even the other characters in the film ignored him and didn't take him seriously.  I liked it even better than Vicki Christina Barcelona or Point Blank - the other two great recent Woody films.",
      "total_reactions": 1,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2016
      },
      "score": 10,
      "text": "It is an outrageously pedantic movie, the characters are misanthropists, misogynists, misandrists; and they play every stereotype in the book... but lovingly. It is a deeply dark comedy, sweet and acrid: you'll ever love or hate it, I enjoyed it, even if it is made by Woddy Allen.",
      "total_reactions": 0,
      "user": "Barny"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2017
      },
      "score": 7,
      "text": "An hour and a half of Larry David complaining about the world and the human race directed by Woody Allen. There was no way I would not like Whatever Works. Accompanying this is a message of following your heart. No matter how bleak things may be in the world, as astutely pointed out by Boris Yellikoff (David), we all might as well embrace our desires, wishes, and dreams. If it provides happiness, do it and expect nothing less. If something makes you unhappy, stop doing it immediately. Though we all may die in the end and are a doomed race, certain to lead ourselves to extinction, we all have the right to make life less unbearable by finding something or somebody we love. Even if it is wrong in your mind, nothing that makes you truly happy and fulfilled is wrong (with exceptions, e.g. murder or killing people, but that is the exception not the rule).",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 7,
      "text": "I am not sure why this website continually knocks intelligent films but this was actually highly funny. Larry David is always on top form and Woody Allen produced yet another hilarious and witty film. Evan Rachel Woods was completely different to normal too, I didn't even recognise her!",
      "total_reactions": 0,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2016
      },
      "score": 1,
      "text": "Whatever Works?",
      "total_reactions": 0,
      "user": "Introduce"
    }
  ]
}