{
  "mc_avg_user_score": 4.9,
  "mc_metascore": 25,
  "mc_mixed_rating_frequency": 11,
  "mc_movie_name": "When in Rome",
  "mc_negative_rating_frequency": 28,
  "mc_positive_rating_frequency": 25,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "One of the few movies that start badly and then just go uphill and keep improving. good for a couple of laughs and just overall extremely fun to watch. i normally hate kristen bell, but even she couldn't drag down this great film. loved it.",
      "total_reactions": 1,
      "user": "Payup"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "FUN, FUN, FUNNY i liked this  movie a lot i have seen better films but it had a few laughs i wish they made more romantic comedies that aren't rude like this one",
      "total_reactions": 1,
      "user": "smumites45"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 8,
        "year": 2015
      },
      "score": 9,
      "text": "Really fun and exciting movie.  Kristen Bell has such an endearing personality which really made the plot move along.  Josh Duhamel is also really hot, and they make a perfect couple!  I am amazed that the critics didn't like it because I thought it was really creative and comedic.",
      "total_reactions": 1,
      "user": "kat267"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2011
      },
      "score": 1,
      "text": "Kristen Bell definitely does not save this cliche driven romantic comedy ( if it should even be called that. It should be a horror movie). She gives such a bad performance she almost steeps as low in acting quality as the supporting actors. When in Rome isn't funny or romantic. Please stay away. I give this movie 9%.",
      "total_reactions": 3,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2012
      },
      "score": 9,
      "text": "I loved it! and I disagree with this movie's critics...in generall I will never understand most of the critics (especially the ones of Rotten Tomatoes!) . For example, critics often give many starts to comedies that are gruesome, raw and abbuse of sexual imagery (e.g There's Is Something About Mary) while they disregard romantic comedies. 'When in Rome' is engaging, sweet, yet a cool movie. It never gets tacky or overly emotional/corney. Seeing this movie was like a refreshing breeze! . If you are trying to find realism in comedies, you are not always going to find it and you may get disappointed with this. The purpose of a comedy is making you laugh, and in order to do so, the resources that producers/directors/writers use are very diverse and those may include 'fairy tale' sort of fantasy! At the end,what is important is that you enjoy it . The plot of this movie is a bit 'Disney-like' so even your children-in you have them- may enjoy it. But remember, this movie is not there to teach you anything, nor is it there to be trascendental, for is just a comedy; thus, is just about having a good time. So watch it with an open mind and an open heart...and forget about critics (their opinions are, after all, subjective) and remember, just because it is romantic it doesn't mean is bad!!! Finally, if you see it positively come and share it here! The movie needs it!",
      "total_reactions": 2,
      "user": "RegOz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2010
      },
      "score": 1,
      "text": "This movie is poorly put together and just kind of weird.  Worst of all, the jokes are not funny.  There is not really even a good plot or character development.  My wife and I paid $1 to see this from Redbox and I still feel ripped off.  See a good movie instead of this boring piece of crap.",
      "total_reactions": 1,
      "user": "Evan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2010
      },
      "score": 3,
      "text": "Not worth the time. It's true that probably the only good romantic comedy i've seen in the past couple of years was 500 Days of Summer, and this genre keeps setting the bar lower and lower, but still, you expect more than this dull, humorless movie. The so-called jokes (i don't consider falling or being hit by something a joke) are not funny, the lines are naive and the story is uninteresting.",
      "total_reactions": 1,
      "user": "Razv"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2011
      },
      "score": 1,
      "text": "For a film with a cast so rife with comedic talent, this is painfully unfunny. Bell's charm is the only redeeming factor here, but it is not even remotely enough to make this watchable.",
      "total_reactions": 1,
      "user": "Tony"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2011
      },
      "score": 1,
      "text": "someone should ban this type of films because it only hurts the intellect of the people, these films are an aberration to the true stories of love, this movies is just .... bad",
      "total_reactions": 1,
      "user": "RodrigoBGC"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2011
      },
      "score": 2,
      "text": "When In Rome is a cheesy, cliched and poorly acted film that mainly relies on predictable and annoying romantic-comedy cliches than originality.",
      "total_reactions": 1,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2012
      },
      "score": 3,
      "text": "It wasn't totally awful and it doesn't disguise itself from what it is. The cliched rom-com doesn't really get made anymore and I can see why. It doesn't work. With comedies like The Hangover and The 40 Year-Old Virgin dominating the landscape, romantic comedies don't hold a place in the market. Also, the story in general is beyond moronic.",
      "total_reactions": 1,
      "user": "dev92"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 3,
      "text": "I watched this a second time and I have no idea what I saw in it the first time.  Not only was the story so-so, but it wasn't even told well. The pacing was horrible! I felt like the two main characters met, then they were instantly in love, and then there was immediate conflict. Also, the supporting cast is exhausting and annoying. I hate Jon Heder! While I'll admit I liked this film the first time, it did not deliver at all the second time.",
      "total_reactions": 1,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 7,
        "year": 2013
      },
      "score": 0,
      "text": "Walt disney deja peliculas bonitas pero al mismo tiempo ridiculas y mal hechas como esta..............................................................",
      "total_reactions": 1,
      "user": "Jmsbpp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2010
      },
      "score": 5,
      "text": "Kristen Bell's first big role and it's not bad just not that good. What's wrong is that the film is just continuously repeats on itself. And by the end, it's so repetitive, it really gets under your skin. And yes, I like Kristen Bell and at times, she was funny but her supporting performers really killed it. And it was predictable, not surprised Josh Duhamel look embarrassed at times.",
      "total_reactions": 0,
      "user": "shlugalug"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 7,
      "text": "There is no doubt When In Rome is a decent film to just spend the time and have a few laughs, but it doesn't bring anything truly new to the table. Kristen Bell has potential as an actress, I just don't think she fits in comedy. Same thing for Josh, he is more like the action hero kind of guy, but props to him because I thought he was going to do bad in this film, but he did good.",
      "total_reactions": 0,
      "user": "Sonicphoto"
    }
  ]
}