{
  "avg_user_score": 7.7,
  "metascore": 72,
  "mixed_rating_frequency": 3,
  "movie_name": "When Marnie Was There",
  "negative_rating_frequency": 8,
  "positive_rating_frequency": 62,
  "pro_critic_reviews": [
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2015
      },
      "score": 100,
      "summary": "There is a quality of enchantment to When Marnie Was There that can’t be faked, and that the studio behind this animated feature is justifiably famous for."
    },
    {
      "critic": "Joe McGovern",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 83,
      "summary": "The animation is dazzling."
    },
    {
      "critic": "Philip Kemp",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2016
      },
      "score": 80,
      "summary": "A gentle tale, tinged with melancholy told with all the loving attention to detail you expect from Studio Ghibli."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 80,
      "summary": "It deals with friendship, loneliness, abandonment and forgiveness, and though its curious narrative arc means you're never sure exactly where it's going, the film works up a considerable emotional charge by the end."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 80,
      "summary": "It’s a quiet film of modest narrative ambitions and simple shifts. But its technical and visual ambitions couldn’t be higher. It’s as if Ghibli is still trying to raise its own bar, so that even if it’s going out, it’s reminding viewers what they’d be missing."
    },
    {
      "critic": "Sherilyn Connelly",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2015
      },
      "score": 80,
      "summary": "At its most beautiful, Yonebayashi's picture is about the magic of female friendship at its purest."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 80,
      "summary": "Yonebayashi’s open-hearted tale, more than any other Ghibli offering, could conceivably have worked just as well in live-action, and yet the tender story gains so much from the studio’s delicate, hand-crafted approach."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 75,
      "summary": "A bit too familiar, and at times gentle to a fault."
    },
    {
      "critic": "Molly Eichel",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2015
      },
      "score": 75,
      "summary": "Deserves to be considered on its own merits, and while not a masterpiece, it is beautiful, nonetheless."
    },
    {
      "critic": "Walter Addiego",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 75,
      "summary": "The film’s depiction of loss, isolation and reconciliation, and the rewards of friendship, grows more touching as the story builds to its highly emotional conclusion."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 75,
      "summary": "Though the narrative of “Marnie” bogs down toward the end, this does not diminish its spell."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2015
      },
      "score": 75,
      "summary": "It’s not the predictability that’s disappointing as much as the pat resolutions and emotional fixes provided to Anna. If you’re going to set up a young character who’s this complicated and in this much pain, you owe her a similarly complex catharsis."
    },
    {
      "critic": "Brian Tallerico",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 75,
      "summary": "It is filled with the luscious, beautiful 2D animation that we’ve come to expect from Ghibli, and if the storytelling sometimes gets a bit lethargic for its own good, we’re more forgiving just to have one final dance in the moonlight."
    },
    {
      "critic": "Sara Stewart",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2015
      },
      "score": 75,
      "summary": "Subtle, sometimes really sad and honest about the struggles of adolescence, Marnie is a worthy last entry from Ghibli before the studio reportedly goes on hiatus."
    },
    {
      "critic": "Clayton Dillard",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 5,
        "year": 2015
      },
      "score": 75,
      "summary": "The film at first plays like a refresher and throwback to Hayao Miyazaki's Kiki's Delivery Service, before revealing itself to be less minimal than minor."
    },
    {
      "critic": "Kerry Lengel",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2015
      },
      "score": 70,
      "summary": "There are no princesses, monsters or castles in the sky, but that doesn't mean there is no magic."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 70,
      "summary": "When Marnie Was There may start off a bit awkwardly, but it'll have you bathing in your own tears by the time it's over."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 70,
      "summary": "The conclusion is rushed and poorly staged, yet the damp caul of loneliness that envelops the film’s early scenes feels moving and true."
    },
    {
      "critic": "Boyd van Hoeij",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 70,
      "summary": "A beautifully animated tale of the growing friendship and occasionally rather cloying emotional travails of two 12-year-old girls."
    },
    {
      "critic": "Jesse Hassenger",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2015
      },
      "score": 67,
      "summary": "As a children’s movie, it’s uncommonly sensitive and complicated, rooted in relationships rather than dazzling action. But adults may notice its simple poetry turning, after a while, to suds."
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2015
      },
      "score": 40,
      "summary": "This is, disappointingly, a long way from being a Studio Ghibli classic. The essential plot may be archetypal, but it’s no \"Kiki’s Delivery Service.\""
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2015
      },
      "score": 40,
      "summary": "Director Hiromasa Yonebayashi did a wonderful job adapting “The Borrowers” into “The Secret World of Arriety.” But this slow-moving film, also from a book, tends to plod rather than float."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2015
      },
      "score": 8,
      "text": "As the last movie (at least temporarily) from Studio Ghibli, I was really impressed and I really think they took a break with style, even though it's definitely not their best piece of work.",
      "total_reactions": 3,
      "user": "vahn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "Not as great as The Tale of the Princess Kaguya or The Wind Rises, but it is what it is, a wonderful and sweet tale of growing up. Vastly superior to the best many other studios (with ears) can offer.",
      "total_reactions": 1,
      "user": "quentntarantado"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2015
      },
      "score": 9,
      "text": "german",
      "total_reactions": 1,
      "user": "soulJoe88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "This film is so beautiful, and it deals with some very deep and important themes. It's a puzzle movie. I adore this film. This is one of only a few movies I have ever seen that made me tear up, and make me want to cry. While it's probably aimed mostly at mothers to watch with their daughters, anyone who enjoys good films should love this masterpiece.I do have to say though that I prefer the Japanese version with English subtitles to the English language version for two reasons.",
      "total_reactions": 1,
      "user": "BrianAD9"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "When Marnie Was There is undoubtedly the most emotional Ghibli movie in my opinion.  I love the haunting atmosphere of the marsh and the breathtaking animation.  The characters are also amazing with Anna being so complex and emotionally damaged, its lovely to watch her character grow throughout the movie.  The whole mystery behind Marnie was a little too drawn out and it towards the end I just wanted it to get to the end so I could find out what happens.  But the ending was so emotional and so sad yet happy at the same time.  Such a wonderful movie that everyone should watch.",
      "total_reactions": 1,
      "user": "AriseAndBe"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2016
      },
      "score": 10,
      "text": "You will never be disappointed with a Studio Ghibli movie and this is no exception. A complete masterpiece in every way, beautiful story, visually stunning, perfection in film making. I could not recommend this highly enough, it's brilliant.",
      "total_reactions": 1,
      "user": "Rebecca31"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "A really good and magical animated movie.A film for children that is mature,and also very important for kids to see because it teaches a lot.The animation is beautiful,it has a good mystery and some very good messages.I would say it is one of the best Studio Ghibli's film ever.",
      "total_reactions": 6,
      "user": "GentM2015"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "Once again, Studio Ghibli gives us a magical film, and probably their last, which would really make this movie is the perfect way to say goodbye. It was an emotional experience, even when it maybe dragged in some parts, it is really enjoyable and touching. Like The Wind Rises, it's not a children's movie, it touches very mature themes, but it is certainly a movie that some smart kids can enjoy. A fantasy drama very well made.",
      "total_reactions": 3,
      "user": "Dokalu"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "From the director Hiromasa Yonebayashi of 'The Secret World of Arriety' fame. Based on the 1967 English novel of the same name and so the important characters borrowed the western names. This is what I call a fine adaptation, great transformation from the words to the motion picture. Actually, it suited for the narration from the standpoint of Japanese culture and lifestyle, especially for this anime version with the beautiful fictional coastal landscapes. Whenever I remember this film in the future, that Marsh house would be the first thing to pop out in my mind, an unforgettable landmark for sure.",
      "total_reactions": 5,
      "user": "LeZee"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "Can not show the same breath the charm of the previous films of Ghibli even more so shows the quality of the studio as a whole, even if the plot is not as lush, but still yes is good.",
      "total_reactions": 3,
      "user": "Iky009"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "Enjoyable, but the story could have been a lot better. I really loved the illustrations, though. Especially the images of the countryside. Talented group of illustrators. About the story, it was a little confusing - and dry. At first I thought the story was going to be about gender exploration. I initially thought Marnie and Anna had something going on - she always blushed, and the director would focus in on the romantic sensuality between the two girls... but... I'll stop here. Kind of weird. Also, a blonde hair, blue eyed girl by a half Japanese half white father? That was kind of weird. No Hayao Miyazaki, but it's enjoyable.",
      "total_reactions": 5,
      "user": "sandyva"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "I'm going to be very blunt. Some of the hatred that this film has gotten is completely justifiable. I'm not afraid to admit that Ghibli could have done WAY better. But for we got as the possibile last Ghibli ever, it was still beatiful. On paper the plot of the story sound like pure perfection, and utterly flawless. But how the story was executed was not flawless. A good example are the dream scenes. They start amazingly, but after the half way point they start to get muddled, and pretty pretentious because of what direction the plot is taking. When you get down to it, this film only has one true criticism. It's not long enough to flesh out all of its themes and characters. not including Marnie. But despite that heavy criticism, the film overall is enjoyable. After the first watch you'll definitely have mixed feeling, but by the second watch you'll definitely have a much better time. That I swear.",
      "total_reactions": 4,
      "user": "cartoonfaxuator"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2016
      },
      "score": 9,
      "text": "I really liked this movie as it was an experience from start to end. It was a very fulfilling movie as the art was great as expected from Studio Ghibli. The story at the start and end was very interesting but the middle part was only ok. The parts with Anna and Marnie were great but there were sometimes I got confused. There are some side character but they show up once or are in a side plot that is not resolved or built upon till the end and it is over in a few sentences and one character who knows something is only given a little to explain at the very end. Anna has some development and she does grow a little bit but I felt like most of it happened at the end. In total even though there are some things that I don't like I still think that it is a great movie and the ending really makes it for me since all of the mystery's and side plots are resolved at the end. I feel like they should have made it a little longer to go more in depth about everything. But it is an experience that I do not regret watching. If you can go see this movie then I would recommend it.",
      "total_reactions": 0,
      "user": "killerofdeth"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2016
      },
      "score": 10,
      "text": "I loved When Marnie Was There.  I loved it so much, this film was so fantastically written, so fantastically animated and it was a joy to experience.  I loved the characters, the story line was great and engaging the mood is set perfectly.  The characters are designed brilliantly, it’s just an all round excellent film and it doesn’t appear that too much has been lost in translation between Britain and Japan.",
      "total_reactions": 0,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2016
      },
      "score": 7,
      "text": "Even if its mystery is often confusing, When Marnie Was There is definitely worth appreciate for its narrative depth, usually beautiful animation, and a heartwarming and though-provoking story.",
      "total_reactions": 0,
      "user": "papeadojhon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2017
      },
      "score": 10,
      "text": "When Marnie was there is an intense, magnifecently animated and surprisingly impressive film that carries the audience to a wonderful world full of charm and drama.",
      "total_reactions": 0,
      "user": "Futuredirector"
    }
  ]
}