{
  "mc_avg_user_score": 6.5,
  "mc_metascore": 71,
  "mc_mixed_rating_frequency": 57,
  "mc_movie_name": "Where the Wild Things Are",
  "mc_negative_rating_frequency": 101,
  "mc_positive_rating_frequency": 229,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "A stunning, emotional , well acted and written movie. Although im glad many others give it a 10 i would disagree with any that state it not a childrens movie. Its for everyone that is or has ever been a child, and certainly some children ( just like the \" adults \" hear giving well thought out 0 reviews ) will find it boring but some will love it. It has a certain look like no other film . Everyone has differnt opinions on everything in life so dont listen to the ( incorrect ) bad review....know what your getting into and just watch it. U could be missing out on one of your new favs :)",
      "total_reactions": 2,
      "user": "joe1975"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2010
      },
      "score": 5,
      "text": "A sad experience, one that made me feel about myself rather than enjoying the innocence of youth. There's not enough story to carry a full movie, and the wild things seem more like reality show characters bickering amongst themselves rather than fantasy creatures. I was excited for this film, mainly because the story is brilliant and Jonze is very good, but I was sorely disappointed.",
      "total_reactions": 1,
      "user": "nboley08"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2013
      },
      "score": 1,
      "text": "Now, yes. Many people.. are going to disagree with me, go ahead, hate me. I don't like this movie. I DESPISE THIS MOVIE!!! This is just too dark, too dark (by this part, I mean literally, JUST LOOK AT THE BACKGROUND PEOPLE!!!), and what is pretty much one of the worst costumes on a person for a kids movie, this movie is unappealing and is too dark for a children's movie. And I wanted to give it a chance, because when I was a little kid (or even a baby), this was one one of my favourite books, and you people are giving me this, how disgraceful.",
      "total_reactions": 1,
      "user": "SolidWeaselMGS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "Slow pacing does not hinder this enchanting movie, a story so innocent and at the same time so dangerous one cannot help but wonder if director Spike Jonze is secretly a ten years old kid. The integration between costumes and CGI looks beautiful  the Wild Things show real emotions and are never clumsy. At one point the movie starts going nowhere, but its delicate allegories and interesting look keep the attention up. Soundtrack is spot-on.",
      "total_reactions": 1,
      "user": "FilFestuccia"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "\"Where the Wild Things Are\" is a movie campier than its original book source, but director Spike Jonze successfully transfers the unbiased, pure perspective of a child (Max) to the audience.",
      "total_reactions": 6,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2012
      },
      "score": 2,
      "text": "The book is my all-time favorite children's story and still holds up as a wonderful tale well into my adulthood.  So forgive me if I take it a little personally when (the normally competent and entertaining) Spike Jonze comes along and turns it into a complete bore.  On top of being a snoozer, the world of the Wild Things is as stale and spartan as you can get... the complete opposite of the lush world created by Maurice Sendak.  There are also moments of scariness that I don't believe young children should see despite it's questionable PG rating.  So yeah, it's a kids' movie that's unsuitable for younger kids.  Good call on that one, Spike.  Altogether a huge, thudding disappointment that I would like to say would have Mr. Sendak rolling in his grave... except he's still alive... and he has a producer credit in the film. So an unfortunate big thumbs down to one of my literary heroes.    :(....",
      "total_reactions": 2,
      "user": "CooterPatooter"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2010
      },
      "score": 4,
      "text": "If you are a fan of this book, or if your kids are just now becoming fans of the book, please do not let them watch this movie, it will ruin the book for them. This movie does no justice to it. The only way you could watch this movie and maybe enjoy it a bit is if you had nothing better to do and you rented this movie. Otherwise stay way.",
      "total_reactions": 5,
      "user": "Tubie"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "Where the Wild Things Are may be the first family film in recent memory to rely not on narrative or character development but on ideas and the director's vision. The result is an involving experience for all but the most fidgety children and an opportunity for parents to enjoy (rather than endure) a motion picture with their offspring. For director Spike Jonze, this represents a \"pet project\" and it turns out better than is often the case when a filmmaker is too close to the source material. There are problems, but they are mostly minor and do little to detract from Where the Wild Things Are's effectiveness as a 2009 answer to The Wizard of Oz.",
      "total_reactions": 1,
      "user": "Cinemassacre94"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2010
      },
      "score": 0,
      "text": "There is comfort in having a small number of people elevated in one's opinion. For any thinking person that number is never very large. It is very disheartening when one of that number plummets in our esteem. And, in this case, in such a way. It was a betrayal from someone I have held in this position from my youngest days. Where the Wild Things Are was art, and there was a magic to that story in particular. And he lied right to me. I was extremely dubious when I heard it was being made into a full length live action film. But I heard good reviews, and I saw the man himself interviewed, and as incredulous as I normally am (How can you tell when someone is lying? Their lips are moving.), he seemed sincere when he said the film faithfully captured the spirit of the book.",
      "total_reactions": 0,
      "user": "softmonkey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "A beautiful work of cinematic art, although with its flaws. Although it does seem to take itself a tad bit too seriously, it makes up for it in its ability to portray the inner-workings of a childs' mind. Their escape into the world of fantasy to keep from facing reality and the redolent fear of changing is evident. It's certainly not a movie to see with the children, despite the deceptive marketing done. I adored it, personally, and I completely understand those that don't. It's a hard tale to grasp, and also some people just don't like that kind of movie. But I always grew up with people telling me I was a somewhat strange, so maybe that's what drew me to this strange movie. The camera-work was different and gave it a more realistic feel, the lead, who also is named Max, was very good considering how irritable I am when it comes to child actors. Over-all, a wonderful and somewhat hollow (in a good way) film. I suggest it to those who are up for the challenge.",
      "total_reactions": 0,
      "user": "JennaS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 0,
      "text": "This is the most unrelentingly depressing film I have seen in decades.  The producers have completely missed the point of the charming and whimsical book on which it it based and created a film that is very disappointing.  Perhaps those who have given good reviews have not read and loved Maurice Sendak's original version--but for anyone who has read this to children at bedtime, the film version is a total failure and major disappointment.",
      "total_reactions": 0,
      "user": "Bobbsy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "Where the Wild Things Are is probably my favorite children's book of all time. The movie is just as soulful as it's source material. It's guaranteed to make any parent weep uncontrollably (much like the first time they read their child the book). This is about as good a movie as could have been made from the slender tome. Excellent stuff.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2011
      },
      "score": 8,
      "text": "WHERE THE WILD THINGS ARE",
      "total_reactions": 0,
      "user": "JonnyFendi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "This was nowhere near as brilliant as it could have been. It was severely flawed in it's lead character, Max, who most of the time came across as selfish and rude, but never really changed throughout the film. The creature effects were well done and there were a few memorable scenes, but overall it was a bit of limp adaptation. That being said, considering what Spike Jonze had to work with, pulling a half decent movie from it was impressive.",
      "total_reactions": 0,
      "user": "TargetF209"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "Film maker Spike Jonze directs a magical, surreal, visually astonishing film version of Maurice Sendak's celebrated classic exploring the joyous and wild rumpus of the time and place we call childhood.",
      "total_reactions": 0,
      "user": "asthobaskoro"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 4,
        "year": 2011
      },
      "score": 7,
      "text": "I enjoyed the movie. Good voice work and the young boy did a good job. The graphics were pretty good. But it was not as good as the book. It won't \"ruin\" the book for you, but don't watch this before you read the book to yourself or your kid.",
      "total_reactions": 0,
      "user": "TheChaser1985"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 10,
        "year": 2011
      },
      "score": 3,
      "text": "It is rubbish, I'm sorry to people that liked it but I really didn't enjoy the film. I was looking forward to going to see the film at the cinema but I was really dissapointed, I am a fan of the book but it isn't based on the book at all. I really disliked it.",
      "total_reactions": 0,
      "user": "spielbrick90"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "A beautiful recreation the book by Maurice Sendak in which the story is develop in a deeper way with a conflict that connect with real life, even when the characters are monsters. If you think this a movie for children, then you're wrong. Just see it and learn about life.",
      "total_reactions": 0,
      "user": "ramona"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "You might think that because of this movie is based on a book for kids, this movies is also for kids or is the same than the book, but no, this movie talks about grow up and all the process of maduration, is a great job and a has a fantastic development and the camera work is excellent",
      "total_reactions": 0,
      "user": "RodrigoBGC"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "I'm not sure what exactly to make of the meaning behind all those beautiful images.  The center to me seems to be the portrait of childhood imagination, the boundless energy and freedom of play. But the magic is marred by a conservative guitar-soundtrack that reminds us of the mundane, uncreative rituals of adults. In passages, the film plays like a commercial because of the overly pleasing music. It just destroyed the atmosphere and magic for me. The child acted like a child acting like a child, as if his subconsciousness was constantly aware that it was all theater. Real kids are supposed to be more fully 'into it', a state of mind nailed pretty well in some other films. The monsters had voices of standard human bodies, although being much bigger than humans. In a movie that plays all-in on atmosphere, those mistakes are deal-breakers. If you have a special interest in childhood psychology, I guess its a relevant movie, but I doubt you'll come away from it much wiser. I had high expectations for some movie magic and the movie didn't deliver. Only partly, in the sometimes grand scale of the images. I want to give extra points for originality, but it was based on a book, so in fact its a very conservative vision based on an original book.",
      "total_reactions": 0,
      "user": "mrnice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2016
      },
      "score": 8,
      "text": "Where the Wild Things Are, as a picture book, certainly allows for itself to be played with and altered quite a bit. Though director Spike Jonze obviously incorporates all elements from the book, he instills his own world view and experiences upon the book. The end result is a truly passionate and stirring look at childhood and a young boy dealing with many issues (abandonment, lack of empathy, etc) but through his interactions with these beasts, he learns how to improve himself. Impressively scripted and told, Where the Wild Things Are is a truly imaginative and inspired take on Maurice Sendak's famed children's book. That said, it is likely not a children's movie. A few sequences are quite scary and the amount of adult emotion and reflections on childhood will likely go over many children's heads. That said, I loved this one. The star here is Spike Jonze who really crafts a truly personal film here and this is quite apparent in his gentle handling of the film. Overall, though not a children's movie, Where the Wild Things Are is a very good realization of a staple of many's childhood.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "A beautiful movie that perfectly captures the essence of the classic tale. Masterful puppetry. Anyone who appreciates the original book will no doubt realize how great this movie is.",
      "total_reactions": 0,
      "user": "travispipes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2013
      },
      "score": 9,
      "text": "No doubt this is not for everyone, when you begin to understand all that you see, the universe is the saddest and most beautiful possible thing you can imagine, the mind of a Child, here, is so powerful, sad, depressed, but never without love.",
      "total_reactions": 0,
      "user": "khutch"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2013
      },
      "score": 9,
      "text": "A fun emotional adaptation of a beloved children's book.  I loved how the connection between Max and these creatures with the feelings of loneliness and anger.  Plus the fantastic music by Karen O.",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2013
      },
      "score": 0,
      "text": "This movie was absolute garbage. It ruined the book for me. Which was my favorite bedtime story to read when i was 6. No nostalgia, just garbage. Very eerie for some reason and very dark. I was actually scared of the monsters. Max is a complete baby. Annoying character. And what happened when his room turned into the forest?!?! Instead he runs away cuz he bites his mom or something. Whatever dont watch this movie.",
      "total_reactions": 0,
      "user": "tybizkitleigh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 11,
        "year": 2016
      },
      "score": 10,
      "text": "I kid you not, I'm writing this review while listening to \"All is Love\" in the background. \"Where the Wild Things Are\" was definitely a polarizing movie, but I personally consider it one of my favorite films. Beyond the brilliant soundtrack, design, and acting, \"Where the Wild Things Are\" is beautiful for the way that is so wonderfully portrays childhood. Be it through curiosity, fear, adventure, or innocence, the film is just so beautifully crafted in so many ways that it's such an excellent film. Do I believe the film is for everybody? No. Will everyone find it as profound and breathtaking as I did? No. But either way, \"Where the Wild Things Are\" is a perfect example of wonderful, imaginative filmmaking that should bring out the inner child (and, for that matter, the inner \"Wild Thing\") in all of us!",
      "total_reactions": 0,
      "user": "FreedomFighters"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "Childhood redeemed!",
      "total_reactions": 0,
      "user": "MetaCryptic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2014
      },
      "score": 2,
      "text": "Oh boy! I don't know what to say about this awful and really boring movie",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2014
      },
      "score": 0,
      "text": "By far the worst movie I have ever watched even worse than Romeo and Juliet: Sealed with a Kiss. The story line, actors, and everything was infinity times worse than the book. Max seemed so dumb I wanted to whack him with a stick to get back to his poor mother. This movie shouldn't even be shown to children.",
      "total_reactions": 0,
      "user": "WaterTiger5"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2014
      },
      "score": 4,
      "text": "A mind numbingly boring story with a stupid premise , the only redemption  this film has is the special effects and costumes , and even then they are not  that great.",
      "total_reactions": 0,
      "user": "zperry-20"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "this film make me laughing at Start till' end .. Spike Jonze Oscar Winner is Brilliant!! Different story and Fresh. Dan yang tidak kalah pentingnya adalah bagaimana cerita di dalam film ini juga menunjukan urgensi rasa kasih sayang dan kepedulian yang ada dalam keluarga. Max memang digambarkan sebagai seorang anak yang kesepian dan pemarah, tapi petualangan yang dilalui Max telah membuka matanya dan membawanya kembali ke pelukan penuh kasih ibunya. Bagaimana ceritanya? Silakan ditonton sendiri. Jangan lupa mengajak anak atau keponakan saat menonton film ini karena nilai moral dalam film ini begitu penting untuk ditanamkan dalam diri mereka.",
      "total_reactions": 0,
      "user": "Wahlberg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Where The Wild Things Are is a very interesting achievement which will go down as one of the most intriguing and original children's adaptations in recent memory. While not everything about the story or its execution is entirely satisfying, Jonze deserves a lot of credit for capturing the mood and tone of Sendak's story, and for his realization of the titular creatures. Whether as a playful exploration of a child's imagination or a complex Freudian journey, it is something that remain with you for a very long time.",
      "total_reactions": 0,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "I just watched this with my 9.5 year and we were both transfixed for different reasons.  It was a great discussion starter around how to deal with really big feelings, the messiness of relationships and tapping into feelings in general. 24 hours later, we are both still processing it. It's a quiet movie. Lots of introspection. But it's nice not being told what to think or feel and to just be in the moment. It wasn't what either of us expected - and that's what made it so intriguing. Enjoy this but be prepared to to discuss with children.",
      "total_reactions": 0,
      "user": "Mumofone"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2017
      },
      "score": 3,
      "text": "If Spike Jonze was hoping to capture the power of imagination to a stressed child, he succeeded. He was much less successful in conveying how imagination transcends childhood, which is dissapointing as the books resonance is quite universal.",
      "total_reactions": 0,
      "user": "Benkoko11"
    }
  ]
}