{
  "mc_avg_user_score": 4.8,
  "mc_metascore": 69,
  "mc_mixed_rating_frequency": 2,
  "mc_movie_name": "White Reindeer",
  "mc_negative_rating_frequency": 2,
  "mc_positive_rating_frequency": 1,
  "mc_pro_critic_reviews": [
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2013
      },
      "score": 91,
      "summary": "White Reindeer eagerly pokes the mythology surrounding the holiday season narrative to find something hauntingly beautiful lurking beneath it."
    },
    {
      "critic": "Guy Lodge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 90,
      "summary": "This complex, compassionate film finds both wicked humor and, less expectedly, transcendent hope in America’s gaudy fixation with Christmas spirit."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2013
      },
      "score": 90,
      "summary": "If White Reindeer's satirical elements feel off the rack, that's because what they're satirizing in our real lives is, too."
    },
    {
      "critic": "Calum Marsh",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 12,
        "year": 2013
      },
      "score": 84,
      "summary": "White Reindeer concedes that much about Christmas is funny — its notions quaint, its fixtures cliched. But it proposes that beneath this sometimes lurid veneer lay something to cherish all the same."
    },
    {
      "critic": "David Lewis",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2013
      },
      "score": 75,
      "summary": "Every time it threatens to devolve into sentimentality or cynicism, someone is there to take the reins."
    },
    {
      "critic": "David Lee Dallas",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2013
      },
      "score": 75,
      "summary": "What's dark and weird about Zach Clark's film is also what's tangible, authentic, and wise about it."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2013
      },
      "score": 70,
      "summary": "Writer-director Clark's commitment to a deadpan vibe of crisp comic kink amid eccentric, left-turn sorrow can sometimes feel condescending. But within this not-so-jolly trip into the detailed recesses of simmering suburban emptiness, Hollyman takes this woman's barely controlled dignity on a quietly brave, revealing ride."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2013
      },
      "score": 70,
      "summary": "White Reindeer is a deliberately awkward little movie, and it’s a hard one to shake."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2013
      },
      "score": 70,
      "summary": "Mr. Clark finds unexpected heart amid cliché and frigidity."
    },
    {
      "critic": "Nathan Rabin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2013
      },
      "score": 70,
      "summary": "The film executes its bad-taste gags with such delicacy and unexpected emotional truth that they don’t even seem like jokes. This is attributable largely to Hollyman’s fearless, convincing lead performance, which grounds the movie in a believable reality, no matter how crazy things become."
    },
    {
      "critic": "Mike D'Angelo",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2013
      },
      "score": 67,
      "summary": "If nothing else, this is the least festive Christmas movie since \"Bad Santa,\" dissecting the absurd belief that the holiday season can somehow magically cure all ills."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2013
      },
      "score": 63,
      "summary": "Writer-director Zach Clark doesn’t rise much above that level of subtlety in his lampoon of the phony goodwill and soulless commercialism of the Yuletide season. Luckily, he has a cast that elevates the puerility into genuine pathos and absurdity."
    },
    {
      "critic": "Frank Scheck",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2013
      },
      "score": 60,
      "summary": "Despite its flaws and unevenness, White Reindeer at least deserves points for not providing another sugarplum-infused view of Christmas."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2013
      },
      "score": 60,
      "summary": "Throughout, Hollyman rings true . She’s heartfelt, freaked-out and never too way out."
    },
    {
      "critic": "Katie Walsh",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2013
      },
      "score": 58,
      "summary": "An unprecedented take on the holiday film, but not an entirely successful one."
    },
    {
      "critic": "Sam Adams",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2013
      },
      "score": 20,
      "summary": "Everything is tainted by a sneering sense of superiority. It’s like washing down Christmas dinner with rancid eggnog."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2013
      },
      "score": 1,
      "text": "Don't listen to the critics reviews.  This movie is just a boring, pointless mess.  Based on the trailer, the story is about a woman who's husband is violently killed just before Christmas.  Afterwards, she finds out that her husband had a brief affair with a stripper and the woman goes on a quest to find herself and more about the husband she thought she knew.  If that had been the movie, then we might have something.  Unfortunately, the remainder of the film is simply a series of segments where the woman indulges in extreme behavior (like excessive shopping, drugs, and sex parties) for no real reason other than they're just things most upscale family women don't do.",
      "total_reactions": 0,
      "user": "Zack2981"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2013
      },
      "score": 2,
      "text": "It's not like any other Christmas film I've ever seen.  I was expecting black comedy but this one  was just bleak throughout..  Perhaps the jokes were so subtle I didn't realize they were supposed to be funny.  After a tragedy near the holidays, the eerily isolated main character makes a series of bad decisions.  Suzanne's character isn't really developed.  She is just sent reeling from one blow after another, reacting to each new humiliation.  If you really hate the Christmas season, this movie might compliment your mood.",
      "total_reactions": 0,
      "user": "smreaves"
    }
  ]
}