{
  "mc_avg_user_score": 5.8,
  "mc_metascore": 28,
  "mc_mixed_rating_frequency": 18,
  "mc_movie_name": "Whiteout",
  "mc_negative_rating_frequency": 7,
  "mc_positive_rating_frequency": 13,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2013
      },
      "score": 7,
      "text": "When I first saw the previews for Whiteout, I didn't think it would be anything special. It wasn't until Netflix recommended it for me and I read the description, that I thought there might be something there. While the previews made it look like some arctic nightmare, the truth is that it was a pretty great film. The story is centered around a U.S. Marshall, stationed at the base in Antarctica. For more than 3 years, she didn't really have much to do, but that all changed when two base members are found murdered. It then becomes Carrie Stetko's job to solve the first murders in the continents history. Despite a lack of other people and places to go, the writers of this film did an excellent job at keeping this movie intriguing. I didn't think in a million years that a film like this would work, but actually it works out really well, and unlike a similar story, Fargo, the producers of Whiteout hold nothing back. Kate Beckinsale stars and really does a fantastic job. I've always like her abilities, not to mention the way she looks, but this film is the first time her performance really stood out to me as something special, maybe she should consider playing a cop more often. As someone who's seen thousands of films, it always amazes me how the films I expect the least from, always deliver the biggest surprises. Whiteout is pure intensity, not to mention, a great mystery, that is absolutely worth seeing.",
      "total_reactions": 1,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "Whiteput is pretty cool. I don't know why are so many people saying that's a bad movie! I think the thriller is great and at the end you don't know what to thik about it.",
      "total_reactions": 3,
      "user": "javier24"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2011
      },
      "score": 7,
      "text": "great thriller, good suspense as It will keep you guessing  who is the killer is, the flashbacks are a bit corny and i thought they really didnt need to be in the movie. and the fighting scenes where well made and exciting. a must see movie.",
      "total_reactions": 2,
      "user": "moviefreak12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 6,
      "text": "WHITEOUT is an entertaining thriller film.",
      "total_reactions": 2,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2013
      },
      "score": 5,
      "text": "esta película comienza con paso firme pero a menudo que avanza se va volviendo sofocante y enredado y al final uno queda con la boca abierta pensando",
      "total_reactions": 2,
      "user": "diego9901"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 5,
        "year": 2013
      },
      "score": 3,
      "text": "This just was not a very good movie.  It's never really engaging at all, the visual effects are mega cheezy, and the direction is very bland.  It was basically like a bad episode of C.S.I.  Even if you find it scrolling through the channels at 10 at night and nothing else is on, do something else, because it's a waste of time.",
      "total_reactions": 0,
      "user": "BradySmith"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2013
      },
      "score": 3,
      "text": "Yet even the movie’s big blizzard battle is utterly botched. We’re told at the beginning of the film of something called a “whiteout”, the name for what occurs when a big storm blows in and everything quite literally disappears in an impenetrable curtain of white. To travel outside in these conditions, brave souls must attach themselves to guide wires which run between buildings, lest they lose their way and freeze to death or worse, get blown into oblivion. This might seem like the ideal environment for a final showdown, but in the hands of fumbling Dominic Sena it proves mostly ridiculous. Characters flail their way through the snow and we squint to see what’s going on only to discover that, as in the rest of the movie, what’s going on is pretty much nothing.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2016
      },
      "score": 7,
      "text": "The story is not very original and the movie is predictable but, the acting was good, the fight scenes were well made and the movie was entertaining. Whiteout might not be the most original police drama out there but it's still effective during the entirety of it's running time.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "Whiteout isn't particularly bad but it does follow the thriller playbook step-by-step with only a little tweaking. A lack of originality isn't the end of the world but it could have been so much better.",
      "total_reactions": 0,
      "user": "avamiller21"
    }
  ]
}