{
  "avg_user_score": 7.1,
  "metascore": 76,
  "mixed_rating_frequency": 42,
  "movie_name": "Wild",
  "negative_rating_frequency": 15,
  "positive_rating_frequency": 137,
  "pro_critic_reviews": [
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2014
      },
      "score": 100,
      "summary": "There are other movies out this year that are more technically ambitious than Wild (I'm thinking \"Birdman.\") There are others that are wider-reaching in scope and sheer audacity (the 12-years-in-the-making \"Boyhood\"). But there aren't any others that offer the power and profundity of Wild. This movie is a gift. It's also a journey."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2014
      },
      "score": 100,
      "summary": "It’s one of the year’s most galvanizing cinematic experiences."
    },
    {
      "critic": "Tina Jordan",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2014
      },
      "score": 91,
      "summary": "Vallée has taken a contemplative book where, frankly, very little happens and transformed it into a gut-punching drama."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 91,
      "summary": "Witherspoon does really uncompromising work here, playing Cheryl without any hesitancy or any fear or any ego. It's not a glamorous role, and she doesn't try to make Cheryl seem perfect, and she doesn't sand off this woman's rough edges."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2014
      },
      "score": 90,
      "summary": "In its thrilling disregard for the conventions of commercial cinematic storytelling, Wild reveals what some of us have long suspected: that plot is the enemy of truth, and that images and emotions can carry meaning more effectively than neatly packaged scenes or carefully scripted character arcs."
    },
    {
      "critic": "Stephanie Zacharek",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2014
      },
      "score": 90,
      "summary": "Both the material and the setting seem to have shaken something loose in Witherspoon (who is also one of the movie's producers): She's moved further away from those uptight, humorless romantic-comedy cuties she played in the mid 2000s and more toward the breezy, blunt, self- determined characters of her early career."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2014
      },
      "score": 88,
      "summary": "Wild may sound like a film about redemption, but it’s more about learning to live with what you can’t control — and accepting what you can control, which is sometimes just as difficult."
    },
    {
      "critic": "Geoff Pevere",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2014
      },
      "score": 88,
      "summary": "It’s a movie in which you can feel the spirit of the material infusing the filmmaker both as an artist and as a human being, and what results is that thing that occurs when even the simplest of songs sends sparks to the soul."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2014
      },
      "score": 88,
      "summary": "As for Witherspoon, there’s not a shred of her America’s Sweetheart persona in this work. She strips naked, literally and otherwise, in a raw, brave performance."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2014
      },
      "score": 88,
      "summary": "Translating solitary musings, raw despondency and personal enlightenment into arresting visuals is a substantial feat and novelist/screenwriter Nick Hornby was the perfect choice to convert the fascinating book into a lively script."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2014
      },
      "score": 88,
      "summary": "As he did with “The Dallas Buyers’ Club,” director Jean-Marc Vallée covers this inner and outer journey with a minimum of fuss. The flashbacks and their revelations, filling in the puzzle, are sparingly doled out. The stunning scenery Cheryl hikes through is barely noticed."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2014
      },
      "score": 83,
      "summary": "This is a performance without ego or modesty, for a character without self-respect, played by Witherspoon as unvarnished as any pampered movie star can be expected."
    },
    {
      "critic": "Jamie S. Rich",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2014
      },
      "score": 83,
      "summary": "The best stuff in Wild is the simplest. The movie is at its strongest when it's just Strayed out in the wilderness, seeing what there is to see and finding the strength to keep going. Witherspoon is excellent in the lead, delivering a contemplative performance and appearing comfortable with just being by herself."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2014
      },
      "score": 82,
      "summary": "For director Jean-Marc Vallée, the film's smarts and soulfulness give him a leap upward from “Dallas Buyers Club” that puts him head-to-head with Tate Taylor (“Get On Up”) as 2014's Most Improved Filmmaker. The other big surprise of Wild turns out to be Reese Witherspoon, going far from her usual comfort zone here."
    },
    {
      "critic": "James Rocchi",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 81,
      "summary": "Heartfelt and haunting, sympathetic while still aware of the limits of sympathy, Wild incorporates beautiful direction, smart writing and brave acting."
    },
    {
      "critic": "Simon Kinnear",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 80,
      "summary": "Driven by a committed turn from Witherspoon, Jean-Marc Vallée confirms himself as the go-to director for triumph-over-adversity character studies."
    },
    {
      "critic": "Nev Pierce",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 1,
        "year": 2015
      },
      "score": 80,
      "summary": "A quietly moving coming of age story that resists formula or easy redemption, driven by a strong, unvarnished performance from Witherspoon, who deserves huge credit as both star and producer."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2014
      },
      "score": 80,
      "summary": "Witherspoon is an outstanding actress whose material doesn't always fit her talents. \"Wild\" meanders a bit, in its trips from present to past and back, but Witherspoon remains the constant, doing what sounds simple enough but proves so difficult: soldiering on."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2014
      },
      "score": 80,
      "summary": "The soundtrack is extraordinary. Songs from the Shangri-Las, Simon & Garfunkel, Leonard Cohen, Portishead, and many others drift in and out, sometimes taken up by Strayed as she heads into the scrubby landscape toward a mountain a long way away. The fragmentation is remarkably fluid. The pieces are all of a piece."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2014
      },
      "score": 80,
      "summary": "Though there are occasional stumbles along the 1,100-mile hike, the peaks in Wild make the journey more than worth it."
    },
    {
      "critic": "Henry Barnes",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2014
      },
      "score": 80,
      "summary": "Vallée, in collaboration with screenwriter Nick Hornby, gives the film its energy by pulling the narrative apart. They create a two-hour hallucinatory montage of the hike and Cheryl's back story that's wound together with the songs, phrases and poetry that she recited to herself as she walked."
    },
    {
      "critic": "Stephen Farber",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 80,
      "summary": "Vallee’s latest offering is alternately harrowing and heartbreaking, but laced with saving bursts of humor."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 80,
      "summary": "While Wild will surely be praised in the coming months for having a strong, well-written, flesh-and-blood female at its center, it’s to the film’s credit that it wears this badge of honor with a lightness that in no way undermines its sincerity."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2014
      },
      "score": 78,
      "summary": "Wild lands some hard punches, but it can’t sustain the impact. Some of that lies in its inherited arc: Strayed found some peace – the whole point of the trek – but arriving-at-peace is less provocative than the struggle, at least in a movie."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "Something about the way the film has been assembled doesn't feel altogether organic."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "Where Wild disappoints is in the didactic, show-and-tell approach of Vallée’s direction and of the screenplay."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "While the wilderness vistas are starkly beautiful, there’s no tangible sense of Strayed’s ultimate goal. (Why Oregon?) And the flashbacks, which include scenes of sexual misadventure and heroin use, are too brief to provide answers."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "While Cheryl's journey is interesting, it isn't as compelling as the one embarked upon by Christopher McCandless (Into the Wild). The most arresting aspect of Wild isn't Cheryl's perambulation along the 1000-mile long Pacific Crest Trail but the memories that percolate to the surface as flashbacks."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "Too much of Wild is broken up by flashbacks that tend to dissipate rather than enhance Strayed’s trek. At times she is swallowed up almost to the point of vanishing by the immensity of the vistas."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "Wild has so many things in its favor that it’s tempting to leave out the fact that it’s a movie about a hike that sometimes feels like being on a hike, a long one, without many changes of scenery. But the movie’s achievement is that it overcomes this."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "Like the Danny Boyle film version of \"127 Hours,\" Wild is extremely nervous about boring its audience with its protagonist's aloneness. Still, Witherspoon and Dern are reason enough to see it."
    },
    {
      "critic": "Mike D'Angelo",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "People tend to equate great acting with demonstrative emoting, but knowing when not to telegraph what a character is feeling is just as crucial. Sometimes, walking from point A to point Z — simply, without fuss — is all that’s required."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "Under the keen-eyed direction of Jean-Marc Vallée (Dallas Buyers Club), Wild emerges as an exciting, elemental adventure that takes you places you don't see coming."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "Laura Dern — only nine years older than Witherspoon’s fresh-faced 38 — could also net a Best Supporting Actress nod for her outstanding work as Cheryl’s spunky and nurturing mothe."
    },
    {
      "critic": "Susan Wloszczyna",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2014
      },
      "score": 75,
      "summary": "Witherspoon tries, even doing her first-ever nude scenes, to convince us she has hit the skids. Yet no matter how greasy her hair or how dead her eyes, I just can’t buy her as a self-destructive junkie."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2014
      },
      "score": 70,
      "summary": "For most of Wild, we’re alone with Cheryl’s stark aloneness with herself. That’s a fine place to be."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2014
      },
      "score": 70,
      "summary": "This screen adaptation of Cheryl Strayed’s autobiographical best-seller is burdened, out of fidelity to the book, with life lessons and unneeded explanations that it dispenses, like CliffsNotes, at every opportunity."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2014
      },
      "score": 70,
      "summary": "Cheryl is a thoroughly realized, warts-and-all character, and the flashbacks contribute to that. But like their heroine, the filmmakers do some fumbling to get to their destination."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 67,
      "summary": "Witherspoon excels as a committed figure battling through each rough day. So long as the action remains on the trail, Vallée stages an engaging survivalist tale that plays up the resolve on Witherspoon's face, complemented with the rich visuals of an expansive landscape."
    },
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2014
      },
      "score": 63,
      "summary": "Wild is an accomplished movie, and often a beautiful and moving one, but the woman at its center remains warily at arm’s length."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2014
      },
      "score": 63,
      "summary": "Director Jean-Marc Vallée has created a film out of Cheryl Strayed's beloved 2012 memoir that never quite matches the blunt audacity of its simple title."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 12,
        "year": 2014
      },
      "score": 60,
      "summary": "Wild the movie has a curiously unsticky and unmemorable quality, as if it had melted along the journey, a Sierra Nevada snowball in the Mojave Desert. It has the same nearly invisible flaws as “Dallas Buyers Club,” Vallée’s last agreeable pop-anthropology fable of fall and redemption, but writ larger: It’s just that little bit prepackaged, it stands off from us a little too far. It wants us to feel, but not to feel anything dangerous."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2014
      },
      "score": 60,
      "summary": "Unfortunately for us, Dern — only seen in flashback — isn’t the main character."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2014
      },
      "score": 60,
      "summary": "You may admire Witherspoon’s solid performance, but you won’t forget you’re watching a star."
    },
    {
      "critic": "David Denby",
      "publication": "The New Yorker",
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 12,
        "year": 2014
      },
      "score": 60,
      "summary": "The scenery, of course, could stop the heart of a mountain goat, and Wild has an admirable heroine, but the movie itself often feels literal-minded rather than poetic, busy rather than sublime, eager to communicate rather than easily splendid."
    },
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 42,
      "summary": "Wild never really earns its hard-fought struggle for redemption and personal reinvention."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "This movie is based on a popular  auto-biographical book with the same name written by Cheryl Strayed. After her mother got cancer and passed away at 45, Cheryl got depressed and her life was in downward spiral – cheating on and divorcing her devoted and loving husband, sleeping around, using drugs etc. Whether she was thinking how to extricate herself from this predicament, or not, but one day she bought a book “Hiking the PCT trail” and decided to do it, without prior experience, ALONE.",
      "total_reactions": 3,
      "user": "netflic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "Wild features a journey through the wilderness of the Pacific Crest Trail and the mind of Cheryl Strayed--both familiar to the screen. But through the eyes of Reese Witherspoon and astounding direction from Jean-Marc Vallée, we see into the soul of a true and honest woman--through the journey of her own life. You'll find yourself taking that journey alongside Cheryl.",
      "total_reactions": 5,
      "user": "beingryanjude"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "The early scenes of 'Wild' have the unfortunate effect of immediately distancing you from both the film and the lead character. Uncharitably one starts to think that its sole purpose is to be an Oscar baity vanity project for Reese Witherspoon. However, one never quite gives up on this flawed, but not unlikeable individual. Before long one begins to warm to her and even embrace the unusual structure employed in telling the parallel stories.",
      "total_reactions": 5,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "WILD is an honest gutsy movie with a truly wonderful structure that feels the way we think. No film has better captured stream of conscientious. Pitch perfect until it's last 20 minutes become a bit too New Agey for my taste. What's really great is that this film never feels \"inspirational.\"",
      "total_reactions": 3,
      "user": "LowbrowCinema"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "This is Resse Witherspoon at her best.  Despite the fact that Witherspoon spends most of the movie without traditional make-up her personality shines through.  The majority of the scenes involve Witherspoon by herself so if you didn’t like Gravity because the film centered on Sandra Bullock then you may not like this flick either.  The movie is based on the true story of Cheryl Strayed, a woman unable to cope with her own life.  Weighed down with frustration and grief from the death of her sweet, but white trash, mother (Laura Dern) and unable to connect emotionally with her nice guy husband Paul (Thomas Sadoski), her only release comes from engaging in some seriously self-destructive behavior.  But, Paul ultimately her leaves her for her infidelities and she realizes that she’s no longer in control (not that she ever was) and that she’s allowed her life to spiral down dangerously close to the edge of the abyss.  She tries cut-rate psycho-therapy for about 5 minute before giving up.  When the therapist asks why she does the things she does, she responds by saying, the only time life doesn’t hurt like sh*t is when I’m fuc*ing someone or shooting up.  As an act of desperation, and despite the fact that she has no backpacking experience, she leaves home (Minneapolis) to hike the 1,100 mile Pacific Crest Trail - which runs from the Mojave Desert in California to Washington State - by herself.  The movie is about her trek.  The movie has a grittiness and real-life feel to it.  The only odd moment occurs in the closing scene where, despite the fact that the journey proves to be her salvation, Cheryl tries to embrace her past rather than renounce it and claims that she doesn’t seek or need forgiveness or redemption.  It’s a prideful “broken but unbowed” final speech, which I found interesting given that her survival appears to be founded as much on luck and the kindness of strangers as it is on her own inner strength.  But, despite Cheryl’s lack of humility, you still feel good that she makes it through both the Pacific wilderness and her own personal wilderness and through to other side.  Stay and watch the credits for some interesting photographs of the real Cheryl.",
      "total_reactions": 5,
      "user": "Axgrinder"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2015
      },
      "score": 4,
      "text": "Initially I had no interest in watching this movie until Reese Witherspoon was nominated for best actress, full disclosure I am not a Witherspoon fan, I think she is highly overrated. So as a big fan of the Oscars I make a point of seeing every nominated film with the thinking maybe she can pull off an Oscar winning performance. I did not agree her first Oscar was worthy.",
      "total_reactions": 5,
      "user": "rmartusa"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2015
      },
      "score": 2,
      "text": "Sometimes little things can mess up one's investment in a movie. In this case, I got hung up when Reece walked through the desert and never got a tan, never mind the uneven ravages of the sun and dusty trail. Although she's shown with various cuts and bruises on her body, her face pretty much never shows any wear and tear.",
      "total_reactions": 4,
      "user": "Edeltraud"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "Wild: It's almost impossible not to compare this film to Into the Wild from a few years ago. I loved Into the Wild. I found myself very drawn to the central character in the film. Wild, unfortunately not so much. I don't know why. Films are subjective. I can only tell you why I think I couldn't get myself into the film: Reese Witherspoon is a great actress. She proved it in Walk the Line, Election, and even Legally Blonde. Unfortunately, she was too Reese Witherspoon (in my opinion) the hollywood star in Wild. I didn't see the character Cheryl Strayed. I saw Reese Witherspoon throughout the film. Nothing personal as I still think Reese is a great actress, just didn't anything for me in this film.",
      "total_reactions": 2,
      "user": "marioping"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2015
      },
      "score": 3,
      "text": "There are very few stories with strong female leads not involving children and/or romantic partners. Therefore I was looking forward to “Wild”, since I read it was about the journey of discovery of a single woman.Turns out, the “single” woman was a promiscuous divorcee and her discovery boiled down to “whatever I did wrong, I would do it again”. Even if much criticized, I did not find Witherspoon’s performance bad. Her character was not supposed to be sunny and easy-going; therefore her bad attitude, fear and depression were appropriate.  However, I agree that her character is mostly unlikable and the only word she seems to know and use is “F..k”… so much for her alleged level of “sophistication”.",
      "total_reactions": 2,
      "user": "dierregi"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "\" Eu posso desistir a qualquer momento\"",
      "total_reactions": 2,
      "user": "GustavoTalaini"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2015
      },
      "score": 1,
      "text": "What an absolute whore bore of a slow nothing of a little film directed by a jackass who may have helped McConaughey win an Oscar but by no means knows what he's doing besides trying to be artsy while leaving any sense of good narrative on the floor.  It's poorly shot (only total amateurs shoot so much meaningless handheld:  it's easy to do and it's NOT how we see the world in reality!) with so many missed opportunities in the setting.  Not great acting by any measure with Laura Dern (always liked her) absolutely undeserving of nomination.  Subject matter sordid with bent toward druggie culture which this dirt bag amateur filmmaker tends to know most about.  You have to be either a complete feminist Nazi or utter pretentious liar to pretend to like the non-merits of this piece of ****  Oh yeah, that would include a lot of professional film critics wouldn't it?",
      "total_reactions": 2,
      "user": "AxeT"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Wild is a film that was an incredibly better than I thought it would be becoming a film i would really recommend. the film has amazing cinematography almost like it was intended to be used for national geographic and an incredibly engaging story made up of a series of brilliantly odd almost unconnected events alongside and incredibly emotional life story. oh and the cast is fantastic giving excellent performances across the board.",
      "total_reactions": 2,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "The movie 'Wild' is an adaptation of Cheryl Strayed's self discovery memoir \"Wild: From Lost to Found on the Pacific Crest Trail.\". Cheryl Strayed, played by Reese Witherspoon, is a narcissistic, divorced, drug-addict who decides to go on this 1,000 mile trek to heal herself from all her self-destructing behavior. Her adventure consists of flashbacks and the people she meets along the way.  Bobbi Grey (played by the excellent Laura Dern) is a balancing force in the movie, not just for the viewers, but for the central character as well. Despite terrific performances by Reese Witherspoon and Laura Dern, it feels like we've been down this path before. Into the Wild comes to mind. The film could have been a disaster. The pacing is brutal in some areas and the life lessons come across as something you'd find in a fortune cookie.",
      "total_reactions": 2,
      "user": "j3015"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 8,
      "text": "Cheryl Strayed: \"I have only another 300 miles left to walk. I'm desperate for it to be over. I'm terrified too. When I'm done, I'll only have two dimes to my name, but I'll have to start living. I'm nowhere near ready.\"",
      "total_reactions": 2,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "Reese Witherspoon gave the performance of her career, by bringing desperation, humor, loneliness, and plenty of sadness, in a tale of drugs, sex and lost.",
      "total_reactions": 8,
      "user": "RamonGuerrero"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2014
      },
      "score": 1,
      "text": "Horrible movie, this is NOT about hiking or redemption.  As someone who leads people in the wilderness and vision quests, this movie is a hollywood movie about a (SPOILER ALERT) junky, sex addict who runs away from the world when she doesn't like herself after her mother passes.  Of course, as would happen on a hike of any length, memories come up for her and, as she is on the PCT as a solo woman, dangers of men who might rape her come up (I found this sideline a bit abusive after a while - how many of these experiences are necessary for her? - seriously, one was enough).",
      "total_reactions": 9,
      "user": "Satya"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "I admired Cheryl Strayed's book very much -- the sheer harsh honesty of it. The movie does a pretty good job conveying the pain that drove her to hike the Pacific Crest Trail, through some nicely done flashbacks. Still, I had a hard time with Witherspoon in the lead role (and she is on screen virtually every moment). Cheryl Strayed the author actually is attractive, but it's hard to make a \"real person\" out of Witherspoon's perky, porcelain-skinned perfection merely by mussing her hair. I would love to have seen what an actress like Saoirse Ronan might have done with the part.",
      "total_reactions": 3,
      "user": "Lyn"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "This movie reminded me why I loved Reese Witherspoon on screen in Man in the Moon, Pleasantville, and Election.  Her honesty, intelligence, and humor as an actress do justice to Cheryl Strayed's journey.  In fact, there are two great performances in Wild.  Laura Dern is wonderful as Strayed's mother, and the scenes with her and Witherspoon truly illustrate the close, loving bond between mother and daughter. It was great to watch a film in which the female lead was not yet another victim but someone who took charge of her life.",
      "total_reactions": 3,
      "user": "dylan111"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "A very well made and often times heartfelt film. Director Jean-Marc Vallee once again delivers with another great film. While it didn't quite live up to last year's Dallas Buyers Club for me, he still managed to make a genuine-feeling film full of life. The story was a little slow at times, but was easily made up for thanks to Reese Witherspoon's honest and soulful performance. Her Oscar buzz is very deserving and I have to agree with everyone else that it's her best performance since her Oscar win for 2005\"s Walk the Line. I also really enjoyed Laura Dern, who also gave a worthwhile performance. Overall, while the story and pacing didn't quite live up to my expectations, it's Witherspoon's performance that made the film memorable for me and made it worth it in the end.",
      "total_reactions": 3,
      "user": "moviemitch96"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "A superbly directed, beautifully acted, gorgeously filmed story of self-discovery and personal evolution. Told in an ever-captivating way, the story reveals just enough to keep viewer interest without divulging too much through its main narrative and skillfully incorporated flashbacks. Easily one of the year's best.",
      "total_reactions": 3,
      "user": "Brent_Marchant"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "It's a testimony to how bad movies have become that the allegedly good movies are so bad.  This is Reese Witherspoon walking 1,000 miles without changing expressions except when she loses a toe nail.  It's a text book example of one way not to use FLASHBACKS - trying to build drama in the past because you can't make the effort to build any in the present.  There's no real drama or conflict with anyone she meets or anything she does in the present.  It's a solid \"C minus\" in the pantheon of great hiking movies.  If you want to see how this should be done, watch Sean Penn's marvelous \"Into the Wild\" where one actually cares about the whacky guy who gives up everything for - the Wild.  Wild, this isn't:  MILD would be a much more appropriate title.",
      "total_reactions": 3,
      "user": "5thStFreddie"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2015
      },
      "score": 0,
      "text": "One of the worst movies I have ever seen .Painfully slow and boring.I am surprised Ms Weitherspoon took on such  a poor script.I go to the movies every Sunday for the last 40 years .",
      "total_reactions": 13,
      "user": "loydbour"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "This film is all hype and no delivery. Instead of focusing on the demons that necessitated the hike, we focus on the hike which is purely bland material. You can predict everything that will happen on the hike and it is rather boring except for the scenery. The film need more of the flashbacks that explored the demons not prissy Reese hiking up the trail. This is not a daring or breakout film as advertised. We were sold a bill of goods on this.",
      "total_reactions": 3,
      "user": "JamesL"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2015
      },
      "score": 6,
      "text": "After consummating “McConaissance” in DALLAS BUYERS CLUB (2013), Jean-Marc Vallée’s next step is another star-vehicle biography, Reese Witherspoon plays Cheryl Strayed, a young woman embarked on a 2,650-mile hike of Pacific Crest Trail from Minneapolis, Minnesota to the Bridge of the Gods connecting Oregon and Washington in 1995. The aim of her journey is to detoxicate herself from her past bad habits of promiscuity and heroin addiction which had encroached her entire life after the untimely death of her mother Bobbi (Dern) and had already destroyed her marriage with Paul (Sadoski).",
      "total_reactions": 1,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "I was wild about this movie -- great acting, great cinematography, and an interesting story. Regarding the acting, Reese Witherspoon should have taken away the Oscar for her role here instead of Patricia Arquette as it was one of the best performances in her career.",
      "total_reactions": 1,
      "user": "jgzeger"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 4,
      "text": "Despite some nice scenery of nature the film too often becomes an unemotional bore that continuously    uses flashbacks that offer nothing but random chopped up scenes. Reese Witherspoon was nothing special and neither was the movie.",
      "total_reactions": 2,
      "user": "csw12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "******************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************",
      "total_reactions": 1,
      "user": "dollarsign"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2015
      },
      "score": 10,
      "text": "A triumph of story telling, which holds such emotion, determination and redemption. Wild truly is one of the most inspiring real life stories that  will  be forever remember.",
      "total_reactions": 1,
      "user": "busbfran"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2014
      },
      "score": 4,
      "text": "The great challenge in adapting someone’s story for the screen is that the filmmakers might not do the story justice.  Vallée did great things with Ron Woodroof’s story in Dallas Buyers Club, a film similar to this one in that it is a true story of a protagonist with a reckless past who goes on to something loftier.  Unfortunately,Vallée doesn’t have that magic in him again.",
      "total_reactions": 1,
      "user": "ScribeHard"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "An okay movie. Far from great, or even particularly intelligent. Just the ultimate Sixties feminist cliche tale of \"finding myself,\" \"loving myself,\" and \"affirming all the dumb, sleazy things I did\" because \"I gotta be me\" and \"without ALL I've done I wouldn't be the wonderful woman I now am,\" etc., etc. Compare the skills and brains involved in a really good movie like Force Majeure with the level of intelligence and art in Wild. No contest. Witherspoon and everyone else is \"good,\" but trite, since all the roles are trite themselves. Hornby did the best he could with the material he was given, but that material itself is the core problem with this film--the trite vision of Strayed herself. Her book was like a machine for great  sales to female book clubs, the people who centrally determine best sellers in America, because it seems a little \"edgy\" in their context, but is finally very flattering in an \"I am woman!\" and so are you way.",
      "total_reactions": 1,
      "user": "jeanrenoir13"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2015
      },
      "score": 4,
      "text": "Boring, boring, and...triple boring. A load of nonsense really - the backpack thing, just plain stupid, and obviously empty during many scenes. It beggars belief that some found this firm to be something other than plain silly and vapid.",
      "total_reactions": 2,
      "user": "CelticView"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 4,
        "year": 2015
      },
      "score": 4,
      "text": "Yes, the bag is heavy, we got it the first time around. But fifteen minutes in, it seems, this is still the main thing going on with the plot. This is one really slow, quite boring, unfocused mess of a non-picture. Go watch the news or whatever on the TV instead. It is that bad.",
      "total_reactions": 2,
      "user": "pesho_one"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 2,
        "year": 2015
      },
      "score": 3,
      "text": "Wild was a good outdoor film with nothing new to add about how nature builds the soul and moves us.",
      "total_reactions": 2,
      "user": "RockWolf"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 6,
        "year": 2015
      },
      "score": 3,
      "text": "It started out pretty boring and then it slowed down.  Nothing to see here, folks.  Just another tired and trite piece of Hollywood emotions of the shallowest kind.",
      "total_reactions": 3,
      "user": "RenaissanceMan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "It would have been interesting to see this movie in another director's hands. I liked Jean-Marc Vallee's \"Dallas Buyers Club\" quite a bit, but here his naturalism and acting first approach shorts the story.",
      "total_reactions": 0,
      "user": "DirigiblePulp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "Reese Witherspoon plays Cheryl Strayed, who wrote the book about her 1000+ mile hike on the Pacific Crest Trail in an attempt to reverse her disastrous life (including a ruined marriage and heroin addiction). The movie alternates between numerous outdoor challenges and reflections on her past. It works on both levels and is absorbingly told by director Jean-Marc Vallée (\"Dallas Buyers Club\"). The scenery is expectedly lovely and the complex sound design adds an almost trippy layer to her journey. This double-edged \"adventure\" is continually compelling, but not as emotionally rewarding as you'd expect. NOTE: Look for the real Strayed in an early cameo as she drops her movie star version off from a truck.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "The true story of a woman walking the Pacific Crest Trail in order to find her way back to the woman her mother always thought she could be, sounds like a hippy dippy 60's throwback that would try the patience of the average moviegoer. In actual fact it's a heart-warming character study of a woman trying to get het life back on track that works because of a standout performance from Witherspoon and a smart script from Nick Hornby. What the film does lack is a certain amount of dramatic weight, with the arduous journey passing with little incident, the characters past never seeming that terrible and her drug rehabilitation coming across as a little too easy.",
      "total_reactions": 0,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "Reese deserves her Oscar nomination. She goes through the gamet of emotions. Amazing because we know how well she can do comedy too. Wonderful scenery. It makes me feel like walking the trail, but I would have a car dropping me off and picking me up at strategic moments. Not only do I not have what it takes to walk that trail the way Cheryl did, I have no desire to either. I would try finding myself in a more fun way. But good for her for doing it this grueling way!",
      "total_reactions": 0,
      "user": "ledaumas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "Wild is a clever movie that leaves you thinking about what have you done, where you are right now and what will happen next. The film construction really helped with this reflection, because the protagonist goes on this trip and occasionally something in there triggers a reminiscence of her past, creating an atmosphere of hunting. Another thing is that as time goes by Cheryl finds out what she is capable of. So it's a journey of redemption and self-discovery. Reese Whiterspoon has a great performance on leading role as an anti-hero that puts a stop on her life and decides to start all over; here lays an enormous courage that not everyone can afford, because it implies admitting that you were wrong from de beginning. Laura Dern is also captivating in her role. With an interesting direction the film flows with an unique rhythm, very refreshing.",
      "total_reactions": 0,
      "user": "NedRyerson1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2015
      },
      "score": 6,
      "text": "Although Witherspoon gave a great performance at the end of the movie you find yourself asking the question: \"Did Cheryl really learn anything?\" Other than the monologue at the end there was no instance when you found yourself believing that Cheryl was truly ready to turn her life around. Along the hike she even seems to make similar mistakes to the ones that sent her there. On top of this flaw the editing is very poor. It constantly switched from present to flashback. The switches were so quick (and at times unnecessary) that they muddle the timeline and the plot. If half of the flashbacks were cut they could have maintained effectiveness and power but they occur so frequently any sort of effectiveness is lost. Overall great acting by Witherspoon, acceptable directing, but poor editing and poor storytelling. 6/10",
      "total_reactions": 0,
      "user": "moonman1994"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2015
      },
      "score": 7,
      "text": "This one will not appeal to everyone since it is a character study of a deeply flawed woman, but I really enjoyed it. Not only is it beautifully filmed, but Reese Witherspoon turns in a fantastic and emotionally vulnerable performance that really serves as a great example of her talents. Director Jean-Marc Vallee sure knows how to get a good performance out of his actors and it is not just limited to Witherspoon, but to the whole cast as well. Wild is a tale of self-discovery and making amends for your past demons. What it truly does well it is feels authentic, it feels like an open book that is desiring for human connection, and it is not afraid to get dark or to get light (it is quite funny at times). Wherever the story went, it felt real and, honestly, was deeply affecting. This journey rides on Witherspoon's performance and with her turning in such a heartfelt and down-to-earth performance, there is no way the movie could be bad.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "I usually judge movies on the takeaway - the message - of it all. What strikes a chord here? What can I apply to my everyday life?",
      "total_reactions": 0,
      "user": "Bshop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Ever since the movie 'Dallas Buyers Club' grabbed the three golden statues at the Oscars, the director has been in the spotlight. But I was enjoying his movies before that and yet this one is another remarkable adventurous-drama based on the real expedition into the wild. Cheryl Strayed whose story was this film based upon appeared in the beginning scene where she drops off her version of the movie character and wishes her a luck.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "It seems like there is no better way of finding yourself, than by losing yourself completely.",
      "total_reactions": 0,
      "user": "NightReviews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2014
      },
      "score": 5,
      "text": "Since she is tiny enough, it would have interesting if she bumped into Bilbo and the dwarves on a mountain trail. Otherwise, this seems like Witherspoon's \"Monster\"-like bid for an Academy Award. It's a game try, but I'm not sure that Reese has all the pieces.",
      "total_reactions": 0,
      "user": "Beowulf4862"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 4,
        "year": 2015
      },
      "score": 7,
      "text": "A solid effort by Jean-Marc Vallee. Witherspoon is as good as ever in this biopic about one woman's quest for self-forgiveness. Although not central to the story, I feel like they didn't take advantage of the breath-taking scenery as much as they could have. A fine film otherwise.",
      "total_reactions": 0,
      "user": "heromoder"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "I thought this film was really quite average and that kinda saddened me. Reese Witherspoon wasn't too bad in it but i don't know if it was oscar nomination worthy, however i haven't seen too many other leading actress movies. Witherspoons character basically goes out on a (about) 1000 mile long trail to walk and i suppose clear her head and get things straight: or perhaps also enlighten herself. The thing that makes this film average is that she doesn't really look like she accomplishes/gains anything, and that makes it a kind of dissatisfying watch. For this i would give it a bad score but instead i'm giving it an average score as i find some of the direction in it very well done and i enjoyed the support roles too. Conparing this to \"Into the Wild\", this one is to give a pass as there is no sense of her gaining or accomplishing anything, whereas in \"Into the Wild\" the guy in it (SPOILER FOR INTO THE WILD) ends up dying and still seems to achieve and realise more. This was a pretty average film overall.",
      "total_reactions": 0,
      "user": "oDjento"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Director of \"Dallas Buyers Club,\"  Jean-Marc Vallée's  adaptation of Strayed's novel is just heartwarming and emotional film, it's a weird and inspiration feeling. with Witherspoon's acting this movie and book is  unbreakable. Grade A+",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 4,
        "year": 2015
      },
      "score": 2,
      "text": "Nope, movie makes no sense.  in Wild the main actor tries to find herself and doesn't. Nope, movie makes no sense.  in Wild the main actor tries to find herself and doesn't. Nope, movie makes no sense.  in Wild the main actor tries to find herself and doesn't. Nope, movie makes no sense.  in Wild the main actor tries to find herself and doesn't.",
      "total_reactions": 0,
      "user": "evearcher"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "I'm a little bit surprised that no one has mentioned that Wild is very much a movie about challenges unique to women that Male Privilege otherwise excuses - continual vigilance at being propositioned for sex; disbelief or \"concern praise\" that a woman gets for doing something men typically do; experiencing sexist assumptions made about a lone female versus a lone male; \"favours\" done so that a woman will \"come around\".  Despite the physical isolation and potential dangers in nature, Cheryl must still face these realities and Wild makes an admirable attempt to highlight a female-centred experience amidst all the other problems in Cheryl's life.",
      "total_reactions": 0,
      "user": "Mancunian2014"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "I remember when I was watching “Wild” that I suddenly realised that I wasn’t walking beside the films protagonist Cheryl Strayed, but was in fact watching her being played by Reese Witherspoon. But this wasn’t just because of how immersive the cinema screen is and how it made me feel like I was experiencing Strayed’s story first hand, but it was also how, using Strayed’s hike as the guide leading us through the film, “Wild” uses Strayed’s internal monologue as a way of letting the audience see what led to Strayed to embark on such a terrific feat. This fluent style matches that of the book the film is based on, “Wild: From Lost to Found on the Pacific Crest Trail”. It was also Witherspoon’s performance that drew me in to the film, and by combining that with the inevitable landscape shots that are going to feature in a film like this, I suddenly realised that I had been walking beside Strayed/Witherspoon as the film had gone on.",
      "total_reactions": 0,
      "user": "TheRocksBarney"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2014
      },
      "score": 8,
      "text": "As you have most likely figured out on your own, there is no reset button for life. You just have to learn how to live life through all it's punches, keep an optimistic outlook, and remember that it will only get better from there. And always continue to chase that light at the end of the tunnel. For Cheryl Strayed, the light at the end of her tunnel just so happens to be a trail, the Pacific Crest Trail (PCT). The Pacific Crest Trail is a hiking trail that spans 2,650 miles from Mexico to Canada. With nothing but a backpack that looks like it weighs more than her, Cheryl Strayed finds herself hiking through the snow, heat, rain, and cold and at the end of the path was her light of self-discovery and self-repair.",
      "total_reactions": 0,
      "user": "Iheardthatmovie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2015
      },
      "score": 4,
      "text": "On my devices I had filed",
      "total_reactions": 0,
      "user": "moviejudy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "Wild has a really intriguing premise, the idea of a solo hike does it for me but I was wary that the movie lasted over 100min. What could possibly be entertaining about a women hiking alone from the Mexican border to the Canadian Border? As it turns out quite a lot.",
      "total_reactions": 0,
      "user": "wornoutspines"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "I don't normally like movies with a lot of flashbacks, but this movie uses it so effectively that I couldn't see it have done any other way.  It's was very effective and the beautiful scenery added in to generate the flashbacks was genius. The cinematic effects were creative and added to the quality of the movie and made it even more enjoyable.  I have always liked Reese Witherspoon, but now see her in a new light as she gives her best performance of her life!!  Overall this is one of those movies that leaves you with something to take with you, once you are finished watching.  Top notch movie and one that I will watch again and again.",
      "total_reactions": 0,
      "user": "horizonbts"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2015
      },
      "score": 6,
      "text": "Genel ortalamanın altında bir not verdim onu da hikayenin bazı yerlerinde anlatıma dair küçük farkları beğenmemden dolayı. Burada filmlere dair ayrıntılara girmiyorum ki izleyenlerin heyecanını ve yeni bir şeyler keşfetmelerine engel olmayayım. Ancak her ne kadar gerçek bir hikayeden alınmış bir film olsa da bir kefaret seferi veya başka bir değişle bir tür Hac yolculuğu olarak da yorumlanabilecek konusu ile aslında çok da yeni bir şey söyleyen bir film olmadığını söylemeliyim. Boş vakit değerlendirmesi olarak bir kayıp diyemesem de heyecanla mutlak izleyin de diyemeyeceğim...",
      "total_reactions": 0,
      "user": "yardash"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2015
      },
      "score": 7,
      "text": "After Song for Marion in 2012 and Labour Day in 2013, this year’s May Fair Hotel Gala enriched the London Film Festival with another bold, inspired feature: Wild. The film is based on Cheryl Strayed’s “Wild: From Lost to Found on the Pacific Crest Trail”, a memoir of her 1,100-mile hike on the Pacific Crest Trail, and a best seller that topped many book club favourite lists in 2012, including The New York Times’ and Oprah’s. By the time the book was published, Pacific Standard (actress Reese Witherspoon’s recently created film company) had optioned it for film rights. With Witherspoon already cast as lead actress, English legend Nick Hornby writing the screenplay and Dallas Buyers Club’s Jean-Marc Vallée signed as director, Wild had all it needed to be a very interesting feature.",
      "total_reactions": 0,
      "user": "Devilmath"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2015
      },
      "score": 9,
      "text": "An engaging, emotionally resonant piece of filmmaking.",
      "total_reactions": 0,
      "user": "james417"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Wild is wild. [Pun included because normally it is a pun and no other puns can be made to stop the pun chain from going] [Filling in the rest of the characters required to make this review a review]",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2016
      },
      "score": 5,
      "text": "Apparently this was based off a true story. While watching it I was confused about why in the world did having a Mom die turn her into a crackhead. Obviously having a close loved one die is absolutely terrible, but the connection wasn't there, resulting in me feeling very little empathy for her horrible treatment towards her husband, or her -what seemed like-over-the-top drug problems. Perhaps reading the original story of this woman's life would have made it much clearer, but the film sure didn't.",
      "total_reactions": 0,
      "user": "Bias"
    }
  ]
}