{
  "mc_avg_user_score": 5.4,
  "mc_metascore": 40,
  "mc_mixed_rating_frequency": 31,
  "mc_movie_name": "Wild Card",
  "mc_negative_rating_frequency": 11,
  "mc_positive_rating_frequency": 16,
  "mc_pro_critic_reviews": [
    {
      "critic": "Odie Henderson",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 63,
      "summary": "I really enjoyed listening to Statham talk. His fight scenes have their predictable, violent payoffs, but his rambling monologues are unexpectedly, gloriously entertaining. This film’s tagline should be “Come for the stabbing, stay for the gabbing!”"
    },
    {
      "critic": "Geoff Pevere",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2015
      },
      "score": 63,
      "summary": "There’s a modern noir story struggling to get out of Wild Card, just as there was in \"Heat,\" and you can feel it every time Statham – a fine actor even when he’s not rearranging people’s skeletal structure – has to sit down, stare into yet another tumbler of vodka rocks and contemplate the miserable life sentence of his habit."
    },
    {
      "critic": "Bruce Ingram",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2015
      },
      "score": 63,
      "summary": "It’s no secret that Jason Statham demonstrates remarkable flair when it comes to bone-crunching action-movie mayhem, but he deserves special props for making some of the more outrageous flights of macho fantasy in Wild Card seem credible."
    },
    {
      "critic": "Josh Modell",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2015
      },
      "score": 58,
      "summary": "A largely forgettable lark, notable more for its slight diversions from action-movie norms than anything else."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 50,
      "summary": "Stanley Tucci, Hope Davis, Anne Heche, and Sofia Vergara all pop up in glorified cameos and give the movie more fizz than their roles require. Which begs the question: Why would they sign on for such thankless, bite-size roles?"
    },
    {
      "critic": "Roger Moore",
      "publication": "Movie Nation",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2015
      },
      "score": 50,
      "summary": "Somewhat less than the sum of its many amusing or at least unusual parts. But with Goldman, West and all these classy co-stars, he’s at least kicking butt in better company these days."
    },
    {
      "critic": "Jordan Mintzer",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2015
      },
      "score": 50,
      "summary": "By doubling down on a movie that yearns to be both introspective and bone-crunchingly cool, Wild Card overplays its hand."
    },
    {
      "critic": "Scott Foundas",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2015
      },
      "score": 50,
      "summary": "As usual, Statham gets a lot of mileage out of his droll, ever-present scowl, but as in “Heat,” the movie’s disparate narrative strands never really come together, and the climactic showdown feels pretty anticlimactic."
    },
    {
      "critic": "Kevin Jagernauth",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2015
      },
      "score": 42,
      "summary": "Trying to find a middle ground between an action packed Statham vehicle, a '70s style mood piece, and a '90s era, character-actor packed crime tale, Wild Card is not surprisingly an unsuccessful marriage of those ill-fitting genres."
    },
    {
      "critic": "Tim Robey",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 3,
        "year": 2015
      },
      "score": 40,
      "summary": "Wild Card, which keeps giving the Stath too much mannered hard-boiled dialogue for his own good, is a promising blend of components that don’t quite end up gelling."
    },
    {
      "critic": "James Rocchi",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 2,
        "year": 2015
      },
      "score": 40,
      "summary": "Delivering boredom when it promises mayhem, Wild Card is a bad bet that doesn’t pay off for either the film’s makers or its audience."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2015
      },
      "score": 40,
      "summary": "Although the film has little of the smarts and the sizzle of the best of Goldman, it does have a splash of the writer's sense of irony."
    },
    {
      "critic": "Andrew Lapin",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2015
      },
      "score": 40,
      "summary": "The film doesn’t ask its stars for much, and they deliver."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 1,
        "year": 2015
      },
      "score": 40,
      "summary": "Overstuffed and distractible, this episodic redo feels like a couple episodes of some Showtime series stitched into a feature."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2015
      },
      "score": 38,
      "summary": "A better cast this time around — Michael Angarano, Milo Ventimiglia, Sofía Vergara and Max Casella, with cameos by Jason Alexander, Stanley Tucci and Hope Davis — tries to breathe life into Goldman’s cliché-ridden plot."
    },
    {
      "critic": "Ed Gonzalez",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2015
      },
      "score": 38,
      "summary": "The action-movie pyrotechnics succeed only at reinforcing Simon West's macho bona fides and condescendingly forcing Jason Statham back into his wheelhouse."
    },
    {
      "critic": "Nicolas Rapold",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2015
      },
      "score": 30,
      "summary": "Slow-motion knockouts follow, with Mr. Statham as sure-fisted as ever, but the “Expendables” director Simon West can only summon dead air in between. Mr. Goldman’s slightly offbeat underworld is not very convincing, and Mr. Statham’s thick voice and inexpressive acting suggest brain fog rather than gritty blues."
    },
    {
      "critic": "Rex Reed",
      "publication": "New York Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2015
      },
      "score": 25,
      "summary": "A quirky re-boot of the old Burt Reynolds hashtag \"Heat,\" this modest character vehicle for the lifeless, balding and incomprehensibly inarticulate Jason Statham is so bleak and moody it won’t be much of a lure to action fans."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 1,
        "year": 2015
      },
      "score": 20,
      "summary": "Statham brings so little energy that the fight scenes are hardly more vivid than the gambling ones. His one-liners have no heart; his cynicism is no longer sharp."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 5,
      "text": "The trailer for Wild Card is very misleading, the film is not just a revenge movie staring Martial Art expert, ass-kicking, lethal weapon Jason Statham. It's actually surprising, well though-out, and more about Nick Wild's character than mindless fight scenes.",
      "total_reactions": 3,
      "user": "wornoutspines"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Has anyone mentioned that this is a remake of the movie Heat starring Burt Reynolds from the 80's?   I think it's a better rendition of that movie by far,  so don't be so hard on it",
      "total_reactions": 2,
      "user": "Karterfury"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "Statham never dissapoints when he's in his element. I love his action movies and this one is no exception.",
      "total_reactions": 1,
      "user": "jinannn31"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2015
      },
      "score": 1,
      "text": "This movie is one of the most stupid I have ever seen, the action is just awful and script is all over the place, and the end is just dumb.",
      "total_reactions": 1,
      "user": "ozzsoffy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "When you watch a Jason Stratham movie, you basically know what you are getting.  Little plot, lots of action, killing, and bone crushing is pretty much a guarantee.  There are no surprises in this movie, and it is easy to see what is coming.  Nothing out of the ordinary for Stratham.   Fun to watch if you don't want to think about what might or might not happen, and want a halfway decent action movie.",
      "total_reactions": 0,
      "user": "moviegoerMA"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 6,
        "year": 2015
      },
      "score": 5,
      "text": "Action movies have to do a lot nowadays in order to feel fresh. Simply attaching one of the genres big named stars like Statham to it no longer works. I give the movie props for trying. Rather than just focusing on all out action the movie spends a lot of time talking. The majority of it actually tries to be part character driven drama. However missing bits of backstory and some cheesy moments make the movie feel half-baked.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "Jason Statham in a movie scripted by William Goldman? Who'd have thought? Yet despite what seems like a very odd couple the film actually works. Statham does his hardman/sardonic routine as a Vegas fixer, only this time he has Goldmans words as weapons to go alongside the fish knives and ashtrays he uses to dispatch various bad guys. Surrounding Statham with an A list supporting cast always helps and here, with Hope Davies and Stanley Tucci, he couldn't have asked for better.",
      "total_reactions": 0,
      "user": "duncan1964"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 1,
        "year": 2015
      },
      "score": 5,
      "text": "Wild Card is a bizarre movie. It's practically Jason Statham chatting about random stuffs with some people and then brutally mauling other people until their lives are miserable. Strangely, despite the long investment on many characters, the plot never pays off in any satisfying way. Wild Card is one of the movies that leaves audience wondering what were they watching, but not in good Inception way. If this is a complicated plan to elevate Statham's acting, it doesn't work, it would've been more believable if this is documentary of Jason Statham's actual weekend.",
      "total_reactions": 0,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 8,
        "year": 2015
      },
      "score": 10,
      "text": "this movie delves into Statham's insanity. how he's being manipulated by his impulsive ex-girlfriend into fixing her problem, and in the process, getting into trouble with the mafia, how's he's constantly looking for a way out of Vegas and to retire in the Mediterranean. and along comes a Wild Card, a crazy rich kid, who gives him a plane ticket out of this madness.",
      "total_reactions": 0,
      "user": "RPGFanatic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 1,
        "year": 2015
      },
      "score": 4,
      "text": "Wild Card is stupendously predictable, violent and trashy entertainment. But all that wouldn't matter if it didnt work as a cheesy action flick. Sadly, Wild Card is too much cheese to work well. Jason Statham's perfromance is the typical fare, the action scenes are awesome, though. Wild Card doesn't add anything new to action genre, it really is another action movie, big whoop.",
      "total_reactions": 0,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2015
      },
      "score": 6,
      "text": "Not one of the best movies I watched, but Jason Statham is a very good actor, manages to impress me all the time. And this story, is ok.    .",
      "total_reactions": 0,
      "user": "Marick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 6,
      "text": "This is a rather disappointing Jason Statham movie.",
      "total_reactions": 0,
      "user": "markvantpark"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 2,
        "year": 2016
      },
      "score": 5,
      "text": "Wild Card is a very bland and forgettable movie with a few nice shots. Jason Statham has given solid performances in previous movies and in this one I thought he was alright, I mean he wasn't great, but not bad. It's an easily forgettable movie that wasn't anything that special when it first came out and it's nothing special now.",
      "total_reactions": 0,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2016
      },
      "score": 9,
      "text": "Well Acted & Great fight choreography, A little some stopped, but have a Great script.........",
      "total_reactions": 0,
      "user": "sicrano"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2015
      },
      "score": 8,
      "text": "Wild Card is offbeat and entertaining enough to stand a fair chance of achieving cult status in future years.",
      "total_reactions": 0,
      "user": "james417"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 11,
        "year": 2015
      },
      "score": 3,
      "text": "When I want to see a good action film I usually turn to a Jason Statham movie, sure beats yet another Liam Neeson film right? Wild Card is predictable, uninspired and surprisingly funny, with way too many slow motion fight scenes that are hilariously terrible. Comes with the usual head crunching fist fights that go on for 20 minutes at a time and the rest of the cast are pretty much pushed to the side with as little screen time as possible. Compared to Statham's other films this one is a load of rubbish but I still consider it to be the lesser of 3 evils (the other two being The Gunman and Run All Night). Recommended if you want a film that requires you to switch your brain off.",
      "total_reactions": 0,
      "user": "Rebecca31"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 1,
        "year": 2016
      },
      "score": 8,
      "text": "This film is a bit more story-driven than your typical Statham flick, which is a roulette game of its own.  Story-driven Statham films have a tendency to flop, but not this one, given that it is a nearly word-for-word remake of Heat with Burt Reynolds.  You still get some great, well-choreographed fight scenes, and with a coherent storyline, I say this is a winner.  Statham movies are a category of their own, a category I enjoy immensely.  I would recommend this movie to any Statham fan.",
      "total_reactions": 0,
      "user": "Judge_Redd"
    }
  ]
}