{
  "mc_avg_user_score": 7.7,
  "mc_metascore": 75,
  "mc_mixed_rating_frequency": 13,
  "mc_movie_name": "Win Win",
  "mc_negative_rating_frequency": 2,
  "mc_positive_rating_frequency": 66,
  "mc_pro_critic_reviews": [
    {
      "critic": "Ann Hornaday",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2011
      },
      "score": 100,
      "summary": "In spirit, and sheer joie de vivre, it's everything the movie business should aspire to. Win Win exemplifies movies the way they oughtta be."
    },
    {
      "critic": "Pam Grady",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2011
      },
      "score": 100,
      "summary": "A film with a big heart; it's an eccentric dramedy and a crowd pleaser."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2011
      },
      "score": 90,
      "summary": "Shaffer's inexperience pays off. He's completely natural as a mixed-up kid (and great on the mat)."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2011
      },
      "score": 90,
      "summary": "Blessed is the go-for-it movie that can make room for dissonances and weirdness."
    },
    {
      "critic": "Calvin Wilson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2011
      },
      "score": 88,
      "summary": "It's an original that plays as if it were based on a novel."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2011
      },
      "score": 88,
      "summary": "With Win Win, McCarthy has found his emotional sweet spot, a sweet and complex story to set it in and the perfect title for it."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2011
      },
      "score": 88,
      "summary": "Confident enough to simply go with the exotica of average middle-class Americans who are well-intentioned, flawed, and dog-paddling like crazy to keep their heads above water. There's nothing at all unusual about them, and that's unusual."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2011
      },
      "score": 88,
      "summary": "The story feels believable as a witty chronicle of human behavior, in contrast with the self-consciously satirical style of some indie films and the far-fetched heroics of big studio fare."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2011
      },
      "score": 88,
      "summary": "This movie wins you over, head and heart, without cheating. It's just about perfect."
    },
    {
      "critic": "Shawn Levy",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2011
      },
      "score": 83,
      "summary": "A gentle movie with heart, spirit and wit."
    },
    {
      "critic": "Owen Gleiberman",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2011
      },
      "score": 83,
      "summary": "Win Win, it turns out, isn't a tale of facile victory. It's a movie about how loss makes everyone do things they'll both defend and regret."
    },
    {
      "critic": "Mary Pols",
      "publication": "Time",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2011
      },
      "score": 80,
      "summary": "The story wraps up with a tenderness that feels true but completely without mush. The irony of the title fades as Win Win wins you over."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2011
      },
      "score": 80,
      "summary": "There's a wonderfully steely spine inside of Tom McCarthy'sWin Win,\" but it's hard to see at first because it's inside the doughy, everyman person of Paul Giamatti."
    },
    {
      "critic": "Michelle Orange",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2011
      },
      "score": 80,
      "summary": "Warmly observed and solicitous of its audience to the point of caress, Win Win is as comfortable an experience at the movies as you might have this year."
    },
    {
      "critic": "Kenneth Turan",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2011
      },
      "score": 80,
      "summary": "Pure pleasure to experience. Written and directed by Tom McCarthy with an impeccable feel for off-center human comedy at its funniest and most heartfelt, its low-key qualities are so relaxed and unforced every moment feels like a gift."
    },
    {
      "critic": "David Rooney",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2011
      },
      "score": 80,
      "summary": "Think \"Napoleon Dynamite\" and \"Little Miss Sunshine.\" In many ways, Win Win fits that mold, which should make it McCarthy's most broadly appealing movie to date."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2011
      },
      "score": 75,
      "summary": "The kind of indie gem that doesn't come around nearly often enough -- and, when they do, often not enough people go to see them."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2011
      },
      "score": 75,
      "summary": "The same kind of keen, empathetic observations that made \"The Station Agent\" and \"The Visitor\" so illuminating are at play here, too."
    },
    {
      "critic": "Roger Ebert",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2011
      },
      "score": 75,
      "summary": "I'm happy I saw Win Win. It would have been possible to be happier."
    },
    {
      "critic": "Amy Biancolli",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2011
      },
      "score": 75,
      "summary": "The effect is an endearing and plainspoken clarity that stops just short of naturalism; the people in his movies don't seem real, exactly, but we end up caring about them as though they were."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2011
      },
      "score": 75,
      "summary": "The film offers plenty of good screen company along the way."
    },
    {
      "critic": "Scott Tobias",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2011
      },
      "score": 75,
      "summary": "All these characters make a beautiful mess together, even if McCarthy spends too much time tidying it up."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2011
      },
      "score": 75,
      "summary": "It's a bit less good than McCarthy's earlier films -- Jeffrey Tambor has a large, superfluous role that abruptly disappears, and Ryan, a fine actress, makes a less than entirely convincing spouse for Giamatti. This one is a crowd-pleaser nonetheless."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2011
      },
      "score": 75,
      "summary": "Win Win is less quirky than \"The Station Agent\" and less soulful (and political) than \"The Visitor,\" but it still does little to buck the trend."
    },
    {
      "critic": "J.R. Jones",
      "publication": "Chicago Reader",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2011
      },
      "score": 70,
      "summary": "A thoughtful and admirably nuanced moral drama."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2011
      },
      "score": 70,
      "summary": "Win Win goes a bit soft in places, protecting its characters from serious danger or tough moral reckoning. But the film's niceness is also central to its appeal, because nearly all of the characters are people you enjoy spending time with."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 4,
        "year": 2011
      },
      "score": 67,
      "summary": "The standout in Win Win is Alex Shaffer, a former New Jersey state champion cast as Kyle."
    },
    {
      "critic": "Connie Ogle",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2011
      },
      "score": 63,
      "summary": "In the end the film stacks up just this side of twee, as the sort of quirky fare that's passably entertaining without ever offering anything real or remarkable."
    },
    {
      "critic": "Rick Groen",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2011
      },
      "score": 63,
      "summary": "Win Win is a paragon of truth at a slow jog, but that upbeat sprint to the finish feels like a big cheat."
    },
    {
      "critic": "Angie Errigo",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 5,
        "year": 2011
      },
      "score": 60,
      "summary": "Funny, agreeable and thoroughly enjoyable, if a little bit too neat and fortuitous in sorting out its entangled strands."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2011
      },
      "score": 60,
      "summary": "No matter how predictable his arc is, writer-director Thomas McCarthy (The Station Agent) never loses sight of the difficulties of cashflow and making one's weekly nut. You'll want to give his movie-and his secret weapon, the lovably neurotic Bobby Cannavale, as a recent divorcé hoping to co-coach the team-a pass for sweetness."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2011
      },
      "score": 50,
      "summary": "In his short career (The Station Agent, The Visitor), McCarthy has established himself as a craftsman of conventionally quirky pictures that are ENTIRELY about ingratiating themselves with the audience."
    },
    {
      "critic": "Karina Longworth",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 3,
        "year": 2011
      },
      "score": 50,
      "summary": "A \"quirky\" dramedy in the \"Juno\"/\"Little Miss Sunshine\" mode, but lacking the latter's vibrant ensemble and the former's snappy patter, Win Win is indie with the edges sanded down completely."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 3,
        "year": 2011
      },
      "score": 50,
      "summary": "A disappointing domestic comedy in which all but the audience get what they want."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "The power behind this movie is in how it reveals the lengths to which normally honest, educated, hard-working middle class Americans have to go in this economy just to keep paying the mortgage.  It's a morality tale, a tale of sin and redemption, and a slice of life look into the hearts of those (most of us) who are just trying to get by and do the best for those we love.  Paul Giamatti is excellent, Bobby Canavale is hilarious, but it's Amy Ryan and the new kid (playing Kyle) who really steal the movie.  A must-see.",
      "total_reactions": 1,
      "user": "HunterM"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2011
      },
      "score": 10,
      "text": "This movie is ok--realistic and plausible, but it certainly doesn't deserve stellar reviews.  Paul Giamatti is very good and believable as a small town lawyer who isn't really making a go of it, through no fault of his.  The other actors are very good too, but there's nothing exceptional about this film.  I wish I hadn't spent almost $9 to see it;  it was worth about half that.  Amusing, a good way to fill some time, but not a soul-replenshing, satisfying film.",
      "total_reactions": 2,
      "user": "bethesdabob"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2011
      },
      "score": 5,
      "text": "Went to this movie intending to love it because I respect Paul Giamatti so very much.  Sorry, not a good movie.  First 60% is worth a watch and perhaps worth part of the price of admission, but that last 40%.....take your smart phone so you have something to do.  This looks like a very poor effort in the cutting room with scenes that don't make any sense, being presented in odd ball order.  Watch for poor, demented Leo to go home in one scene, and be back in the nursing home in the next with no transition.",
      "total_reactions": 1,
      "user": "chandutt"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2011
      },
      "score": 3,
      "text": "I am so tired of seeing Paul Giamatti play the husband of lovely talented women.  This must be male wish fulfillment casting.  Although well acted, this is a very boring, predictable film, sentimental film.  It would play much better on TV.",
      "total_reactions": 1,
      "user": "Newyorker"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2011
      },
      "score": 0,
      "text": "I am writing this review because this is the worst movie I have seen in months and I am one of Giamatti's biggest fans so it pains me to say so. To be fair, I went into this movie expecting it to be funny... or at least contain a bit of dark humor and what I got was melo-drama capital C, capital R, capital A, capital P.  Lastly, bethesdabob wrote \"This movie is ok--realistic and plausible, but it certainly doesn't deserve stellar reviews.\" and then gave it a 10 out of 10. Dementia much?",
      "total_reactions": 1,
      "user": "joelschnick"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2012
      },
      "score": 4,
      "text": "The film is very plain and boring.",
      "total_reactions": 1,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "A really good movie that feels so genuine. The interaction between Giammati and the wrestler is highly original, and the wrestler's relationship with his mother is not something we've seen before.  I love Amy Ryan, and she nails her part.",
      "total_reactions": 0,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "With his team mired in last place, Morris Buttermaker(Walter Matthau), the beer-swilling coach of the most incompetent Little League baseball team imaginable, is not above using desperate measures to improve his players' fortunes. Buttermaker wants to win, badly, and he knows that the struggling team's chances rests in the hands of his pretty daughter's ability to recruit Kelly Leak(Jackie Earle Haley), so he drives Amanda(Tatum O'Neal) to the arcade where negotiations take place over a competitive game of air hockey. The girl loses, much to her father's considerable irritation, especially since she has to date the power-hitting righty blessed with speed an a cannon for an arm, as part of the terms of the deal. But despite the apparently fruitless outcome, Kelly, who looks old enough to shave, is still joining the team, exactly what the rough-edged boy wanted all along, haunting the periphery of the ballpark like he did from atop his motorbike on a daily basis. It's a win-win situation for all three parties involved. Partly because he smokes, Buttermaker expresses a leeriness about Amanda's upcoming social engagement with Kelly, since only punks up to no good smoke, which is why in \"Win Win\"(a film that bears a passing resemblance to Michael Ritchie's \"The Bad News Bears\"), Jackie(Amy Ryan), due to concerns over her young daughter's safety, locks the basement door on Kyle(Alex Shaffer), associating the unwelcome guest's nicotine habit with Eminem. Far from being a pool cleaner, Mike Flaherty(Paul Giamatti) practices the law, but on account of the downward turn in economic growth, clients are hard to come by, a deriving materialization that could put the firm and middle-class lifestyle that his profession provides at risk. As a sideline gig, Mike oversees a losing high school wrestling team which the filmmaker introduces at the outset of \"Win Win\" with transient scenes showing the coach's umbrage toward his young student-athletes as a sort of punctuation for everything that's going wrong with the counselor's life. Every bit as bad as the Bears, the filmmaker gets no comic mileage and levity from the talentless New Providence High wrestlers, whose incompetence, rather than being a consistent source of easy howlers, only serves to exacerbate Mike's already-heightened financial anxieties, for the reason that the lawyer's failure to drum up business through a fresh infusion of new clients is compounded by his failure at coaching a solitary win. The filmmaker understands that our economy is no laughing matter. On paper, \"Win Win\" has the makings of an inspirational sports movie, especially during the intervening time when Kyle transforms the Pioneers overnight  into a squad other schools have to reckon with, and he himself, an up-and-coming champion seeking redemption. \"Win Win\", however, narratively speaking, is much more sophisticated than, for starters, Howard Becker's \"Vision Quest\", inasmuch as the feel-good genre to a large extent gets installed by the ambitious filmmaker as a McGuffin. Strapped for cash, Mike commits a potential disbarment-causing breech of ethics, when in his capacity as the legal guardian of a client(Burt Young), he manipulates the dementia-afflicted old man into taking up residence at a nursing home, while pocketing the money with the court's understanding that Leo would be supervised from his own house. In actuality, \"Win Win\" is a moral thriller, epitomized by the pointed existence of a faulty boiler whose clanging noises represents the cacophony in the lawyer's tell-tale mind. Just like the furnace, Mike knows that the scam has the potential to blow up his practice in an instant. How Kyle performs at the wrestling tournament is not the film's climax; it's merely a byproduct of the explosion that occurs when Cindy(Melanie Lynskey), Kyle's mom, steps forward to claim her father's monthly stipend, and finds the bombshell in the court transcript. It all but subjugates the wrestling subplot to irrelevancy. The film's real and pressing subject is how greed isn't exclusive to just the fabulously wealthy. The deregulation of ethical standards has become a state of mind that encompasses us all, even a nice guy like Mike. The filmmaker, above all else, makes a salient point about money being a drug, a narcotic that is every bit as potent as the one Kyle's mother went to rehab for. \"Win Win\" uses this dialectic to witty use. Comparable to the scene in Ryan Fleck's \"Half Nelson\"(a wrestling hold, it should be noted) where Dan Dunne(Ryan Gosling) tells his student's uncle, a drug pusher, to back-off from Drey(Shareeka Epps), despite the fact that the teacher himself is a user, Mike encourages Cindy to leave her son alone, even though the corrupt lawyer is in no real moral position to do so. He makes more errors than the Bears shorstop Tanner Boyle. \"Win Win\" is not \"The Bad News Pioneers\"; it's \"Mike Flaherty: The Smartest Guy in the Room\".",
      "total_reactions": 0,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2012
      },
      "score": 6,
      "text": "Portrayed by many as a funny film, this is a otherwise indifferent drama graced with the exceptional charisma of Paul Giamatti, who holds it together elequantly enough to feel like a win win proposition for a DVD night at home.",
      "total_reactions": 0,
      "user": "nutterjr"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "Thomas Mccarthy's Win Win achieves a somewhat tour de force trait for a comedy, creating a laughable film with characters the audience truly cares about. This Sundance favorite tells the story of lawyer and part-time wrestling coach Mike Flaherty (Paul Giamatti) who is dealt with a struggling firm and a hopeless wrestling team.  To make some extra cash to support his family, he becomes the guardian of his dementia-bound client through some questionable business actions.  After he takes on this task, he stumbles across his client's grandson, Kyle, a star athlete in the form of a troubled teenager. Just when Kyle brings success to Mike's wrestling team, Kyle's mother - fresh out of rehab - threatens to hinder everything.",
      "total_reactions": 0,
      "user": "RyanGee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "I honestly can't imagine how someone could dislike this film. It is funny, warm, weird, and overall just incredibly enjoyable. Every character seems genuine and authentic, which is a testament to both the superb cast and the incredibly smart and witty script. Easily the best film of the first quarter of 2011.",
      "total_reactions": 0,
      "user": "Tony"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "This movie was such great fun. Paul Giamatti at his best, and a 'spot on' supporting cast. The humor was dry, refreshing, and definitely added to the unusual story line. It was independent film making at its best.",
      "total_reactions": 0,
      "user": "noonan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "History was taken very well, a little common argument, but moving with a good message, emphasizing the double standard, in short, the cast very well, although on occasions some scenes were a little uncomfortable and that was a little thread of the movie, but overall very good movie :D",
      "total_reactions": 0,
      "user": "wishmaster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "Good film, good story line and great acting.  I really don't laugh often at movies but this got me at least a few times.  Good drama and good fun.  Enjoy it while you can!",
      "total_reactions": 0,
      "user": "perfectd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "I think its a great movie to watch on a weekend with friends and family. It is full of small moments of laughter and the acting is great. The story will not blow your mind but instead represent the day to day life of a New Jersey family that comes across an unusual situation.",
      "total_reactions": 0,
      "user": "CBZ"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 4,
        "year": 2011
      },
      "score": 10,
      "text": "If you are able to see this film, do it. New comer Alex Shaffer acting is quite funny, and Giamati is great as always. By the end of the movie you will feel like you just made some friends that you will never see again.",
      "total_reactions": 0,
      "user": "DC19"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 8,
        "year": 2011
      },
      "score": 4,
      "text": "Lose. I wanted to stop watching it but the girlfriend was glued to the fairy story that was Win Win. Its melodrama. Its a saturday matinee. Its humor without the humor. Its a story without a story. Its annoying.",
      "total_reactions": 0,
      "user": "MorriBey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2011
      },
      "score": 9,
      "text": "Win Win is genuine, authentic, natural and believable. Okay, so all those adjective basically mean the same thing, but this movie is so much funnier than most of today's Comedies. None of it felt forced. I cared about the characters. Paul Giamatti is such a great actors, and he had an equally great supporting cast. Fantastic movie.",
      "total_reactions": 0,
      "user": "RJSmoove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 4,
        "year": 2011
      },
      "score": 5,
      "text": "Paul Giamatti is always a pleasure. And to watch how the arc of his moral dilemma is played out is fascinating in this excellent film. It's comforting to see an all too familiar middle class crisis assuaged in an amusing and non-condescending way.",
      "total_reactions": 0,
      "user": "glenolden"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "\"Win Win\" is an honest, good movie that, unfortunately, left me wanting more story. I really enjoyed Paul Giamatti's performance, and the supporting cast is also wonderful.",
      "total_reactions": 0,
      "user": "BamaFalstaff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "This movie is about real people dealing with real life issues and dilemnas.  Nothing is sugar coated, which is so refreshing. I really liked this film.  The characters are all believable & the acting was perfect.",
      "total_reactions": 0,
      "user": "mgrk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2011
      },
      "score": 9,
      "text": "I read a review for Win Win that described it as \"soul crushingly clichÃ©d\" and I have to admit that the ending plays like the end of a Nicholas Sparks novel (except no one dies......I think). However this may be the only problem with the film.",
      "total_reactions": 0,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2012
      },
      "score": 8,
      "text": "Thomas McCarthy once again takes an incredibly small-scale story and delivers a heart-felt message, while Paul Giammatti delivers a stellar performance and character actor Jeffrey Tambor steals just about every scene he appears in.",
      "total_reactions": 0,
      "user": "JTKelley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2013
      },
      "score": 8,
      "text": "We live in an era that produces films not by standards of quality, but quantity. We have endless sequels and unspeakable remakes year after year. My God-- a remake of \"Red Dawn\"? Who was fighting for this to be remade? So when a subtle and delightful film like \"Win Win\" comes around, it gives you hope in Hollywood, and reminds you of the greatness of the film medium. \"Win Win\" isn't a straight-up sports movie--though it does offer a few vivid scenes of triumph and loss on the mat. It doesn't obey the conventional rhythms of the genre. Tom McCarthy's \"Win Win\" sees Paul Giamatti star as Mike Flaherty, a struggling lawyer and part-time high school wrestling coach. Only trying to make ends meet financially, Mike makes some ambiguous business deals that ultimately lands him a star-studded wrestler without parents. Being the considerate family they are, Mike and his wife Jackie Flaherty (Amy Ryan), take this confused teenager in. One thing leads to the next as the addition of Kyle (Alex Shaffer), on this seemingly hopeless wrestling team, proves to be successful. The once tension-filled family gets put to rest with the transformation in personality of Kyle. Then one day, Kyle's mother shows up just fresh out of drug rehab. Kyle despises her and she has merely returned into his life to pick up a long awaited paycheck from his grandfather (plot logistics that reveal to much of the story for me to explain). She makes plenty of threats, which evidently puts everything created by the Flaherty's and Kyle, in jeopardy. \"Win Win\" is a small--though emotionally touching character study. It's grounded and rarely steps out of the director's comfort zone. McCarthy has a very precise and intricate directorial style that makes all of his character human beings who are easy to relate to. Still, none of the film's accolades could not be given without help from the slew of great performers in display here. Amy Ryan as the hard-nosed mother, Jeffrey Tambor and Terry Delfino as assistant wrestling coaches with two completely different styles, Burt Young as the grandfather who just wants to go home, and Melanie Lynskey as Kyle's mother who has returned purely for the money--these performers are very good. However, it's Paul Giamatti and first time actor Alex Shaffer who give the film its gravitas. Giamatti is quite simply one of the best working actors we have in the entertainment business. Yet, it could be Alex Shaffer who gives the most impressive performance. Having never acted on screen before, he manages to give Kyle some emotional empathy. Shaffer's performance appears to be given so effortlessly, and by the end of the movie, he is completely convincing in the role. \"Win Win\" gathers all the strands (the illegal trusteeship, the wrestling team, the hazardous rapts boiler, the wrestling, the rehabbing mother, Jackie finding out about her husband's misdeeds) and wraps everything up a little to neatly. Everything clicks into place--and life seldom has uncomplicated endings. In his short career (The Station Agent, The Visitor), McCarthy has established himself as a craftsman of conventionally quirky pictures that are entirely about ingratiating themselves with the audience. He wins this fight.",
      "total_reactions": 0,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "WIN WIN makes Tom McCarthy three-for-three. Grabbing the affection from the audience is what he wants, and dear reader, he can't lose.",
      "total_reactions": 0,
      "user": "audreythomas25"
    }
  ]
}