{
  "mc_avg_user_score": 7.4,
  "mc_metascore": 69,
  "mc_mixed_rating_frequency": 10,
  "mc_movie_name": "World's Greatest Dad",
  "mc_negative_rating_frequency": 7,
  "mc_positive_rating_frequency": 47,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 1,
        "year": 2012
      },
      "score": 10,
      "text": "I just watched the \"World's Greatest Dad\". This a black comedy movie, however the ending ruined the whole black comedy aspect of the theme. I mean, the ending is MACRO BIZARRE. I felt that the whole movie was literary flushed down the toilet when it turned 180 degrees into a \"black hole of nonsensical disparity\". Respectfully submitted and thank you. SAAA PRODUCTIONS",
      "total_reactions": 1,
      "user": "andreadoloffo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "This is a good little flick sporting a great performance from the late Robin Williams. This is not the best film to watch if you want to see it for him right now, but all the same, I enjoyed it a good bit. The comedy works for the most part and at times, it gut bustingly hilarious. However, there are definitely a lot of long portions of this one that are not all that funny. This one is certainly very dark at times, but the humor of the situations lighten it up a tad. The film is also an interesting discussion of posthumous celebrity, suicide, and teenagers. However, the film itself is pretty predictable. As you watch it, you can pretty much assume how it will end, but that is not a huge deal to me, though it does hurt the overall enjoyment since I knew what was ultimately going to happen. All the same, this one is a dark, enjoyable, at times upsetting little film that is a good one to watch if you are looking for something to watch.",
      "total_reactions": 1,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 6,
      "text": "A really good little dark comedy. Half of the film I absolutely loved while the other half I absolutely hated; the tone is uneven and truly bizarre.  Robin William's plays a dad whose son unexpectedly dies. He then takes it upon himself to write a diary in his son's name which then makes him popular and successful. It was very strange but I still can't recommend this enough. It features some really good performances. An absolute must-see!",
      "total_reactions": 1,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2015
      },
      "score": 7,
      "text": "World's Greatest Dad could be Robin Williams' last really strong performance. I don't think this movie is overly funny but it is well written and I found myself making a lot of connections to the film. Basically every character in the film is a phony and it shows how death can completely change someone's opinion on a person because no one will ever say anything about a dead guy.",
      "total_reactions": 1,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2015
      },
      "score": 10,
      "text": "This is a sad, sad film, but it is also hilarious! It is an extremely dark and cynical comedy that will make you feel almost depressed, but laugh at the same time. It is a hard feeling to explain, but I felt it.",
      "total_reactions": 1,
      "user": "smartmart"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 9,
        "year": 2010
      },
      "score": 6,
      "text": "The InstaFlicka Index",
      "total_reactions": 2,
      "user": "InstaFlicka"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2010
      },
      "score": 6,
      "text": "I thought this movie was interesting but that the moral message was wrong. Even though he was being deceitful his book was helping people. He had created a way to stop many kids from committing suicide and to inspire confidence in people and so i think it was selfish of him to take that away from them by revealing the truth. His feelings of loneliness and guilt were a sacrifice he should have made to keep the lie going and to keep helping kids with depression problems. It's like he had a cure to many suicides and then took it away. I discussed this with some people after watching the film and they all thought he did the right thing, that the truth is what matters. But i thought to myself 'is the truth really important if the lie is helping people and saving lives?' The truth was important to Lance, it freed him of his guilt, but at the same time it ended the feelings of confidence and companionship people felt after reading the book. While thinking about this i remembered a quote someone said, i can't remember who it might have been off Batman: \"those who have the power to do good, have the responsibility to\" and so i think Lance's decision and the moral message were wrong.",
      "total_reactions": 0,
      "user": "moviedays0"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2010
      },
      "score": 9,
      "text": "This movie is admittedly not for all tastes, but really surprised me. The odd cover art you might see for this will typically just show Williams, and with all of the family friendly cookie cutter movies he's made, his image along with the title is bound to make people think it's another one of those Disney type popcorn movies, and that might be what they are expecting when they see it. The intended audience (who might like darker and twisted comedies) might pass for the same reason, the title. It's meant to be darkly ironic of course, but I can just imagine what marketing discussions were like, they must have had no clue on how to \"sell\" this movie. I truly enjoyed it, and it got big deserving laughs several times. Williams is at his absolute best, and the script is full of highly amusing dialogue. The one area where Bobcat flails a bit in my opinion is in relying too heavily and too often on montages set to music. It's used very well in some scenes, and too much or too heavily in others. And when you have two humorous montage music segments within minutes of one another it really breaks up the flow of the story. That said, that is really the extent of my criticism as I think the movie succeeds very well on it's own terms. Some of the smaller scenes are wonderfully played, such as a scene where Williams visits his paranoid shut in neighbor and they share a plate of pot brownies. It's a shame more people will not see this movie, but then again it's the kind of comedy that makes people uncomfortable, like \"King of Comedy.\" A lot of people won't enjoy being messed with in such a genuinely edgy way, but the right people will love it. You don't see movies with guts like this one has very often.",
      "total_reactions": 0,
      "user": "DigitalShark"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "The title might be misleading. The trailer does not reveal what this movie will turn out to be either. This is black humor. You won't know if you should laugh or feel sad. Scenes from this film might keep haunting your thoughts for a couple of days. \"World's Greatest Dad\" is extraordinary and possibly unique. Highly recommended!",
      "total_reactions": 0,
      "user": "juliankleiss"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "it was 2am and i was about to go to bed,when i saw this movie starting and i decided to just see the title before going to bed,and i found myself hooked and my heavy eyes suddenly became wide open.now that's just how good this movie is. The story is so deep,it would take you some days to climb back up to the surface. R.william was so great and believeable. A great movie,loved it",
      "total_reactions": 0,
      "user": "hugoboy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 3,
        "year": 2013
      },
      "score": 9,
      "text": "Many would say that World's Greatest Dad has quite a misleading title, but this couldn't be further from the truth, perfectly summing up a dangerously funny film that pushes the boundaries of comedy, but also how us human beings may deal when tragedy strikes under the most unexplainable of circumstances.",
      "total_reactions": 0,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2013
      },
      "score": 3,
      "text": "Robin Williams is one of the funniest men to ever star on the silverscreen, but occasionally he does a weird dark comedy, that's very hit or miss. In World's Greatest Dad, Williams plays an English Teacher, who covers up his son's bizarre and embarrassing death. The suicide note he forged gets printed by the school newspaper, making his loser son, an overnight sensation. Williams is a great actor and gives creedence to even a bad film like this, but even he can't save this one. The story is just ridiculous, his son (Daryl Sabara) was a complete  that everyone wanted dead. No one would all of a sudden care, just because he wrote a heartfelt suicide note. It's also extremely unrealistic, since his son was as stupid as they come. That being said, with the exception of newcomer, Eric Martin, the rest of the supporting cast was awful, making the film that much more unrealistic. World's Greatest Dad may have landed it's star, but it's a sloppy movie, that really doesn't make a whole lot of sense. It's an hour and a half of pure torture, with the occasional funny scene that's all Robin Williams. This is one film that just starts out slow, never gets going and is anything but the \"hilarious\", \"wonderful\" film that I was expecting.",
      "total_reactions": 0,
      "user": "Tss5078"
    }
  ]
}