{
  "mc_avg_user_score": 5.5,
  "mc_metascore": 58,
  "mc_mixed_rating_frequency": 5,
  "mc_movie_name": "Wrong",
  "mc_negative_rating_frequency": 2,
  "mc_positive_rating_frequency": 4,
  "mc_pro_critic_reviews": [
    {
      "critic": "Read full review",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2013
      },
      "score": 83,
      "summary": "In its wonderfully irreverent way, Wrong makes it clear that this reality is never to be trusted as anything more than a succession of strange moments that coalesce into an abstract representation of the subjectivity that traps us all. This is the essence of new film noir, which challenges our perceptions through a series of compellingly ambiguous moments."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 80,
      "summary": "As this wry, dry and glittering near-masterpiece proclaims, life is full of wrongness, but also full of mystery and wonder."
    },
    {
      "critic": "Adam Nayman",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2013
      },
      "score": 75,
      "summary": "Truth be told, Wrong isn’t as funny as \"Rubber,\" which played kamikaze games with horror-movie tropes. The tone here is flatter and more meandering, and more than a few of Dupieux’s digressions feel like dead ends. At the same time, there’s a winning confidence to the filmmaking, which is deceptively stylish."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2013
      },
      "score": 75,
      "summary": "Wrong never feels dangerous or truly challenging, content generally to amuse rather than amaze."
    },
    {
      "critic": "Eric D. Snider",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "Wrong is more absurd and more laugh-out-loud silly than “Rubber;” it’s also less focused and more pointless."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 70,
      "summary": "The film's heady buzz is invigorating, and there are substantial pleasures—and laughs—to be found in all its real-life-just-gone-sour strangeness."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2013
      },
      "score": 70,
      "summary": "If the premise isn't as attention-grabbing as Rubber's was, the execution should help build the filmmaker's following."
    },
    {
      "critic": "Tasha Robinson",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 67,
      "summary": "It’s a Dada daydream of a movie, but no one who sits through it can complain that they weren’t warned up front."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 63,
      "summary": "The movie is flimsy, glib, and occasionally pretty funny."
    },
    {
      "critic": "Joel Arnold",
      "publication": "NPR",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 60,
      "summary": "Each event's inherent banality is skewed slightly by the actors' matter-of-fact delivery and an external sense of dread amplified by the playfully ominous score, composed by Dupieux."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 60,
      "summary": "Fichtner is always good; just trying to sort out his accent here is kind of fun. Plotnick is the key, however. He plays it straight, even as the world around him grows weirder by the minute. Often he seems confused by the proceedings, which is fitting: Join the club, pal. But we’re having a better time of it than he is."
    },
    {
      "critic": "Leah Churner",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "Plotnick is an appealing actor. He has the same sweetly knit brow and watery blue eyes as Breaking Bad’s Aaron Paul, but his character here is as flat as a pancake. Moreover, if you’ve seen the trailer for Wrong, you’ve seen the movie."
    },
    {
      "critic": null,
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "It doesn't seem to have any pretensions beyond the regimented unveiling of a parade of odd occurrences, plodding along under the banner of absurdity."
    },
    {
      "critic": "Dennis Harvey",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 3,
        "year": 2013
      },
      "score": 50,
      "summary": "A curious tale about a man searching for his missing dog in a suburban bubble where everything is a little askew, has some laughs, but it doesn’t take long for the absurdist humor to pall among a pileup of nonsensical ideas that would be funnier if grounded in a less hazy concept."
    },
    {
      "critic": "Mark Olsen",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 40,
      "summary": "\"Rubber\" felt inventive and complex, but here Dupieux's absurdism is simply muddled, masking the fact he doesn't really have much to say."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 3,
        "year": 2013
      },
      "score": 40,
      "summary": "Weird for weirdness’s sake gets you only so far, however, and when Dupieux tries to connect all these strange goings-on to Dolph’s corporate-drone despondency, the movie takes a spurious turn toward rancid sentimentality. It seems that even a piece of dog excrement has feelings. Yuck."
    },
    {
      "critic": "Nicolas Rapold",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 3,
        "year": 2013
      },
      "score": 30,
      "summary": "Wrong lets most of its random gags and view-askew premises twist in the wind like hamhandedly wacky improv comedy, punctuated with synthesizer effects. The film’s misguided flatness is perhaps its fatal flaw, not so much deadpan or existential as just monotonous."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 12,
        "year": 2016
      },
      "score": 6,
      "text": "Seems everything is wrong, but in a funny way.",
      "total_reactions": 0,
      "user": "LeZee"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2017
      },
      "score": 0,
      "text": "C'est Gogol qui a perdu son clebs, alors il appelle un détective privé, le gars est un spécialiste du genre \"profiler\" qui se met à profiler la merde du clébard, une sorte de coloscopie à distance pour retrouver le fugitif. Le cabot accusé à tort est bien entendu innocent et ne sera, à notre grand soulagement, pas inquiété. Il n'a pour l'heure pas donné suite à nos demandes d'interview.",
      "total_reactions": 0,
      "user": "Broyax"
    }
  ]
}