{
  "avg_user_score": 8.4,
  "metascore": 74,
  "mixed_rating_frequency": 156,
  "movie_name": "X-Men: Days of Future Past",
  "negative_rating_frequency": 85,
  "positive_rating_frequency": 1664,
  "pro_critic_reviews": [
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 91,
      "summary": "Once every couple of years, a movie comes along to remind us how satisfyingly complex the genre can be. Christopher Nolan’s reimagining of the “Batman” saga did that masterfully. On a slightly less ambitious scale, so does X-Men: Days of Future Past."
    },
    {
      "critic": "Betsy Sharkey",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 90,
      "summary": "There is action galore, but Future Past is a deeper, richer, more thoughtful film, more existential in its contemplations than earlier Xs, all rather nicely embedded in the mayhem churned up by the mutants' altered states."
    },
    {
      "critic": "Joe Morgenstern",
      "publication": "Wall Street Journal",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 90,
      "summary": "The most striking thing about X-Men: Days of Future Past is its generosity. Huge franchise installments are rarely as enjoyable as this one. They aren't as inventive, richly detailed, surprisingly varied, elegantly crafted or improbably stirring."
    },
    {
      "critic": "David Rooney",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2014
      },
      "score": 90,
      "summary": "While it's more dramatically diffuse than the reboot and lacks a definitive villain, the new film is shot through with a stirring reverence for the Marvel Comics characters and their universe."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2014
      },
      "score": 90,
      "summary": "If the characters’ quandaries at times feel overly circumscribed, they’re also advanced with a bracing emotional directness, devoid of either cynicism or sentimentalism, that touches genuine chords of feeling over the course of the film’s fleet 130-minute running time."
    },
    {
      "critic": "James Berardinelli",
      "publication": "ReelViews",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 88,
      "summary": "To reboot the X-Men franchise, director Bryan Singer, who first gave these characters screen life fourteen years ago, has crafted a continuity-lover's nightmare."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 88,
      "summary": "Step up, cynics, and see the summer 2014 blockbuster that gets damn near everything right."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 88,
      "summary": "Think of it as a thrill ride with gravitas."
    },
    {
      "critic": "Richard Roeper",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2014
      },
      "score": 88,
      "summary": "Thanks to the first-class special effects, a star-packed cast, screenwriters who know just when to inject some self-aware comic relief without getting too jokey and director Bryan Singer’s skilled and sometimes electrifying visuals, X-Men: Days of Future Past is flat-out big-time, big summer movie fun."
    },
    {
      "critic": "Lou Lumenick",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2014
      },
      "score": 88,
      "summary": "Bryan Singer’s whip-smart and witty time-travel romp X-Men: Days of Future Past blows a breath of fresh air through the musty Marvel universe."
    },
    {
      "critic": "Peter Rainer",
      "publication": "Christian Science Monitor",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 83,
      "summary": "I couldn’t follow many of the ins and outs of the time-travel scenario, and I’m not altogether sure that the filmmakers could, either. It doesn’t really matter. It’s enough that the movie is fun. We shouldn’t also expect it to make sense."
    },
    {
      "critic": "Marc Mohan",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 83,
      "summary": "Hold onto your hats, True Believers! This one's got the most massive, momentous montage of Marvel's merry mutants ever mashed into one movie!"
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2014
      },
      "score": 83,
      "summary": "X-Men: Days of Future Past effectively passes the torch from one generation of socially segregated mutants to the next."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2014
      },
      "score": 83,
      "summary": "Not surprisingly, the best thing about Days of Future Past is that it's heavier on the days past than future."
    },
    {
      "critic": "Drew McWeeny",
      "publication": "Hitfix",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2014
      },
      "score": 83,
      "summary": "It feels like the single most successful attempt to pull the shape of one of the beloved comic stories into the film world. It also feels like Bryan Singer has finally figured out how to shoot an action scene where the X-Men actually look and feel like the X-Men, and where the fantastic is handled the right way."
    },
    {
      "critic": "Dana Stevens",
      "publication": "Slate",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 80,
      "summary": "Days of Future Past is the kind of extravagant production that sweeps you up in a sense of mythic grandeur even as you struggle to follow what’s going on."
    },
    {
      "critic": "Bill Goodykoontz",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2014
      },
      "score": 80,
      "summary": "This is a smart movie, a treat for fans of the comics and the franchise. And it's a lot of fun."
    },
    {
      "critic": "Kevin Harley",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2014
      },
      "score": 80,
      "summary": "Singer has refreshed the series with blasts of his original entries’ X-factors: vim, levity, clarity and a sincere, soulful grip on the emotional stakes involved."
    },
    {
      "critic": "Nick de Semlyen",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2014
      },
      "score": 80,
      "summary": "With so much going on, and such a ferocious pace, several parts of the story feel undernourished... But what we do get here is largely fantastic."
    },
    {
      "critic": "Steven Rea",
      "publication": "Philadelphia Inquirer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 75,
      "summary": "Ambitious, even audacious, the movie's mix of action and for-devotees-only intrigue can overwhelm, but there are moments of sheer virtuosity, too."
    },
    {
      "critic": "Adam Nayman",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 75,
      "summary": "It doesn’t take a lot of wit or imagination to use Richard Nixon as a bad guy, but it’s still satisfying to watch a climatic showdown between two supervillains – one brought back from out of the past and the other from off the comic-book page – and wait to see who blinks first. Seems like we’ll always have Nixon to kick around, after all."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 75,
      "summary": "“Days” is fast, smart, well-acted, and intermittently inspired, and if you don’t know or care who Beast or Blink or Storm are, you can safely skip it."
    },
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 75,
      "summary": "Most important, there is an emotional undercurrent in this installment that the earlier films only aspired to. When for a brief moment, the younger Charles Xavier meets the older, there is the sense of time's mystery - and also of the long, magnificent slog of a purpose-driven life."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 75,
      "summary": "How could you not marvel at a movie that includes a revisionist explanation of the JFK assassination, a football stadium floating over the White House and the sight of Richard Nixon firing a .45 at a villain in a Christ-figure pose?"
    },
    {
      "critic": "Michael O'Sullivan",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 75,
      "summary": "Days of Future Past is, in itself, as intoxicating as a shot of adrenaline. It’s what summer movies are meant to be."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 75,
      "summary": "The deep cast (look out for a slew of crowd-pleasing cameos) play this borderline-silly stuff so well, there isn’t a single unintentional laugh in the entire thing."
    },
    {
      "critic": "Ignatiy Vishnevetsky",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2014
      },
      "score": 75,
      "summary": "For better or worse, X-Men: Days Of Future Past is the first Marvel movie to truly embrace comics-style storytelling."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2014
      },
      "score": 75,
      "summary": "Days of Future Past is most everything we’d hoped the summer’s earlier popcorn pictures would be, most of all — fun."
    },
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2014
      },
      "score": 75,
      "summary": "Spanning across several continents, and obviously decades, Days Of Future Past feels vast and epic in scope. But as large as the movie is, it never loses sight of character and themes (at least the ones that matter)."
    },
    {
      "critic": "James Rocchi",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 72,
      "summary": "Even when it seems mercenary and muddled, X-Men Days of Future Past is enjoyable and well-made and actually about character, a necessary shot of adrenaline born of both inspiration and desperation for a franchise that desperately needed one."
    },
    {
      "critic": "David Edelstein",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 70,
      "summary": "He’s (Singer) reborn — deft, elegant, spring-heeled — in X-Men: Days of Future Past. The special effects don’t bog him down: They lift the movie to a surreal and more emotional dimension."
    },
    {
      "critic": "A.O. Scott",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 70,
      "summary": "As usual, the characters — and the performers playing them — step unto the breach to provide just enough wit and feeling to make Days of Future Past something other than a waste of a reasonable person’s time."
    },
    {
      "critic": "Andrew O'Hehir",
      "publication": "Salon.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 70,
      "summary": "I basically really enjoyed this movie, even while lamenting that I was enjoying it under mendacious premises and that there was something fundamentally cynical about its elegiac, retrospective tone."
    },
    {
      "critic": "Matt Singer",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 70,
      "summary": "At its best, Days Of Future Past feels not just like an X-Men comic book, but like an X-Men comic-book crossover... Like Days Of Future Past, crossovers in comics tend to be light on character development. But when they’re good, the huge stakes and epic scale of the action make them hard to put down."
    },
    {
      "critic": "Kimberley Jones",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2014
      },
      "score": 67,
      "summary": "Capitalizes on the audience’s familiarity with the many players and their complex backstories, but never advances the ball down the field, tenders no new thought or wrinkle to the franchise. It’s the difference between a diverting entertainment, and a riveting one."
    },
    {
      "critic": "Alonso Duralde",
      "publication": "TheWrap",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2014
      },
      "score": 67,
      "summary": "While there are fun moments and a continuation of the franchise's main idea — Professor X's peace, love and understanding vs. Magneto's fight the power — Days of Future Past ends up feeling more exhausting than exuberant."
    },
    {
      "critic": "Simon Abrams",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 63,
      "summary": "It's as visually indistinct and paint-by-numbers-plot-driven as most Marvel Comics-based projects, especially the gaggle of recent Avengers-related films."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 60,
      "summary": "The movie sometimes has the feel of an Olympic sprinter running in place. There’s so much energy expended to get to one spot. Constant searches beget more searches. It all gets exhausting."
    },
    {
      "critic": "Adam Lowes",
      "publication": "CineVue",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 5,
        "year": 2014
      },
      "score": 60,
      "summary": "Impressive for the most part without being awe-inspiring, the film's two timelines converge in a much more satisfying and thrilling ways towards the end, where the emotional stakes are considerably upped."
    },
    {
      "critic": "Steve Rose",
      "publication": "The Guardian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2014
      },
      "score": 60,
      "summary": "Non-devotees might well give up, but director Bryan Singer always has a neat special effect, a well-timed gag or an action set piece around the corner, whipping up the action towards a symphonic climax."
    },
    {
      "critic": "Chris Cabin",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2014
      },
      "score": 50,
      "summary": "It only conveys the awesome strangeness of its characters and their universe when director Brian Singer breaks away from the perpetual build-up of the film's unwieldy plot."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 5,
        "year": 2014
      },
      "score": 50,
      "summary": "Future Past starts fast and never slows down. There's not a line of dialogue that isn't exposition... What fun there is slips in through director Bryan Singer's visuals."
    },
    {
      "critic": "Robbie Collin",
      "publication": "The Telegraph",
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 5,
        "year": 2014
      },
      "score": 40,
      "summary": "The film squanders both of its casts, reeling from one fumbled set-piece to the next. It seems to have been constructed in a stupor, and you watch in a daze of future past."
    }
  ],
  "user_reviews": [
    {
      "neg_reactions": 3,
      "pos_reactions": 17,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "With such abundance of talents, it's a surprise their powers are not throwing award statues at each other. An all-star ensemble delivers one of the better and more captivating superhero movie in recent time, despite the use of a rather mystifying time travel plot. They do a remarkable job of keeping the audience invested to the characters, each with brimming personality to ensure there's never a dull moment. Visually, the movie is captivating, its contrast tone bridges the colorful 70s and severely bleak future impeccably. It also appropriately utilizes good humor throughout the seemingly melancholy plot.",
      "total_reactions": 20,
      "user": "quincytheodore"
    },
    {
      "neg_reactions": 23,
      "pos_reactions": 70,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "This is the best X-Men movie so far, the story is great, the cast is incredible, the action scenes are amazing.  This movie exceeded my expectations and I'm sure it will surprise you from the beginning to the end...  and, I have a new favorite movie now...",
      "total_reactions": 93,
      "user": "victorhjkl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "As a huge x-men fan growing up, I liked this movie a lot; however, I didn't think it was AS great as people are proclaiming it to be.  It's a good story, but it could be difficult for younger viewers to follow.  Also, the movie does deviate from the source material quote a bit, but that's not a big deal.",
      "total_reactions": 4,
      "user": "Dkay7777777"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "I am not all that familiar with X-Men, but this movie was AWESOME! I really liked the time element to it and the best part of the movie is when young Xavier meets old Xavier through Wolverine's head. The action was great, the ending had sort of an Inception feel to it, with multiple climaxes going on at once. My only gripe was that they tried to tie in the Kennedy assassination and the Cuban Missile Crisis into X-Men lore. I found that to be a little cheesy. The sentinels were awesome to watch, and the movie is polished, fun, and entertaining. 9/10",
      "total_reactions": 3,
      "user": "ShMaLeB"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "DoFP was an amazing movie. It will definitely be put down as one of the best super hero movies. By far better than all other X-Men movies including First Class. This movie is a must see in theatres. But, I recommend catching up on past X-Men movies if you haven't or else the plot could be confusing. DoFP was exciting, funny at the right moments, and had the right amount of action all super hero movies should have. Go see it in theatres before it's to late! I know I'm going back!",
      "total_reactions": 3,
      "user": "alejandro77131"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "By far the best X-Men movie with smart plot, genius story lines to tie up loose ends!  Love, love, love it!  And of course,  Mystic, was AMAZING!  Biting my nails and covering my eyes with suspenseful thrill!  Fun, fun!",
      "total_reactions": 3,
      "user": "lobess"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "Fantastic film, I really enjoyed First Class and was eager to see the sequel as soon as it ended. I'm not a huge X-Men fan, and haven't really followed it that much in terms of comics and its previous films. I have seen X-men 1, 2 and 3. But I haven't seen the Wolverine films.",
      "total_reactions": 2,
      "user": "Dalek"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "The Great: My favorite part of the film is the speed mutant. It was just so cool to watch him in action. But if he had stuck around for the rest of the film, it would be too easy.",
      "total_reactions": 2,
      "user": "Nathonas"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "X-Men: Days of Future Past is the best X-Men movie to date, and it totally broke my expectations!",
      "total_reactions": 2,
      "user": "TheApplegnome"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "This was a good movie. The Sentinels were perfect. The only reason that the movie wasn't perfect was because the plot was extremely similar to Terminator 2. It wasn't a straight on copy, but anyone who has seen Terminator 2 before seeing this will know that they're very similar.",
      "total_reactions": 2,
      "user": "chw"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "The Best X-MEN Movie !!!",
      "total_reactions": 2,
      "user": "f3lipz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "Marvel, man. They have been on a roll! They are pumping out movies nonstop, and in return, money is raining on their heads. Heck, they're now the highest grossing movie franchise EVER now! However, all this   doesn't mean that they rush their movies, nor do they act like they just want money for their movies. They put such care and attention into their films for all their devoted fans. Guess what? X-Men Days of Future Past is just like the other Marvel films in terms of quality, if not better! At the core of every Marvel movie, their true genre is action. One-on-one fight scenes with hero and villain, countless numbers of structures falling down, explosions (not to a Michael Bay degree though), it's awesome action. So of course, DoFP has amazing action with all the X-Men. I loved seeing their mutant powers come to life and then watching in awe as they kicked ass. Speaking of the characters and their powers, all of them are truly brought to life. While the acting is nothing revolutionary, everybody still does a fine job. I especially liked Michael Fassbender's performance as Magneto. He really acts like a menace sometimes (which he will do more than often in the movie), and there's not a better pick for a character that's supposed to be cruel than him. The title of the movie gives you some hints about the storyline, right? Well, what happens is that the world is getting eaten up by the Sentinels, and they are still trying to kill every mutant they can find. The X-Men soon figure out someone must go into the past with Kitty's powers to change what happened. I will not lie, you will have to pay attention most of the time. It wasn't a problem for me, though. While it's not the most original Marvel storyline you've ever heard, it's still interesting enough to keep you entertained. In terms of flaws, I really couldn't detect any. Does that mean it's a 10 out of 10 masterpiece (12 Years a Slave is considered that score imo)? No. Yet still, DoFP is still gonna be one of best Marvel movies you've seen. All these positives really add up into being a great time at the movies. It's worth it. GO SEE IT!",
      "total_reactions": 2,
      "user": "SimpleReviewz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "Uh 10 out of 10. I loved it so much. Would see again. But not immediately. As the theatre manager got mad at me for **** on this girl's chest when she said she didn't like Wolverine's bare ass.",
      "total_reactions": 2,
      "user": "exmordis"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "Brilliant. The masterpiece of the X-Men saga. Clever, funny and captivating. A message to Disney: Be inspired by that movie for the next movies... REALLY. Only one negative point: the absence of Anna Paquin.",
      "total_reactions": 2,
      "user": "BastienBruneau"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "The movie is incredibly sexy especially with Hugh Jackman and Jeniffer Lawrence showing off their bodies in ways kids wouldn't understand. If you think about the plot... Don't even start thinking about it. It's mindblowing since it used the element of time. The movie has a good mix of drama and action, just what I would expect from Bryan Singer, the director of the Xmen movies. For Marvel fans out there this movie is a ****",
      "total_reactions": 2,
      "user": "KaleBishop"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "This is the best X-Men movie. Great history to reboot the franchise. Amazing Action Scenes, great history.... great characters. My favorite X-Men movie ever.",
      "total_reactions": 2,
      "user": "fulvio108"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "The best superhero movie I've seen; a true masterwork. This is one of the best movies I've ever seen. It is incredibly well written, and acted. The ideas are fascinating and thought provoking. It is, believe it or not, a rather deep movie. It is one of the few 'deep' movies to give a very positive and truly constructive message, but in a way that is believable and heartfelt.",
      "total_reactions": 1,
      "user": "DarthPreamp"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "I would have given a 11 for this, but since the score goes up to 10, that's what I went with. I ony can describe this film in one word: Terrific. I was never really a huge X-Men fan, but because the acting, story and pacing were all well done, it might make me watch the ones that I haven't watched, then re-watch the whole series ready for Apocalypse in 2016.",
      "total_reactions": 1,
      "user": "benoski"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "I was pleasantly surprised with this movie. Very entertaining, wonderfully done and was a great way to mix together the two cast. Love it and loved the ending.",
      "total_reactions": 1,
      "user": "TheChaser1985"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "The X-Men movies have been a mixed bag in terms of quality but, for me at least, Days of Future Past is the best of the bunch. The time travel elements make as little sense as they do in any other movie but, thanks to the fantastic cast and superb action sequences, that doesn't stop proceedings from being thoroughly entertaining from start to finish. A must see for X-Men and comic book fans.",
      "total_reactions": 1,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "Marvel is really on top of their film game, with a great Captain America, a decent Spiderman, and now a truly excellent X-Men, all in the same few months.  And if you think about it, they are veritably ruling the film world.  Look at the ensemble of actors in this movie.  Where other than a Robert Altman movie are you going to find a cast of people together like Ian McKellan, Hugh Jackman, Halle Berry, Jennifer Lawrence, James McAvoy, Michael Fassbender, Ellen Page - the list goes on and on.  What's more remarkable is that this cast works deftly together in a film that could have been a sloppy disaster.  Time-travel movies when done right are some of the most intriguing movies ever - but if done wrong, they are excruciating.  Luckily, Days of Future Past gets it all right, and the only drawback is all the expository, supporting dialogue the audience must therefore endure along the way in order to understand it.  The bad guys in this movie are truly bad.  If the Sentinels show up, they are going to kill you, and this is established right away in one of the most exciting superhero/villain fight scenes in any comic book movie to date.  Seeing Colossus become full metal at the same time Sunspot flames on at the same time Iceman (finally) goes and stays full Iceman - a very cool moment.  Unfortunately even these powerhouses are no match for the Sentinels.  The only option is for newly-introduced (but now regular X-Man) Blink to keep them moving around until Shadowcat (with a future developed time/spirit manipulation power) can send newly-introduced Bishop just far enough into the past to warn the team that the Sentinels are approaching - so they can not be there when the Sents arrive.  This is layer one.  Layer two then is this first group combining efforts with the other group (Storm, Wolverine, Prof. X, Magneto) to send someone way back in time to before the Sentinels were even created.  This task falls to Wolverine and off he goes into the second layer (the 1970s, pre-Sentinels) in an effort to stop Mystique from.... wow.  The more I write the more I realize how convoluted this plot is.  It's like trying to explain to a non-viewer what's going on in Game of Thrones.  Pretty soon you just throw your hands up and say, \"You know what?  Just watch it!\"  And so that's what I'll do.  What works in this film is the excellent acting, the dark plot, the nearly-full roster of Superheroes, and the best scene in an X-Men movie since Nightcrawler's debut in X2 (hint:  Quicksilver, and anyone dealing with a Quicksilver or Flash-type character in the future must now contend with this scene setting a certain bar for excellence).  There are a few disappointments.  Anna Paquin will show up as Rogue for a second at the end, and I understand her deleted scene(s) will make it onto a DVD/Bluray version.  But for this primary showing, she's notably and confusingly completely absent.  The action scenes in this movie range from the terrifying Sentinel attacks to the now-typical \"huge Magneto scene\" - this time with him moving an entire sports stadium, to a lot of smaller scenes spread throughout - and they all work.  The special effects are fantastic and nothing feels gratuitous (except when they are going for 100% gratuitous, as in the Quicksilver scene).  The story holds together and the dialogue, while mostly expository, is good.  It's my personal favorite of the series so far (you might be surprised to know that The Last Stand was my favorite until now - typically the one everyone hates - but I'm a sucker for new heroes and villains showing up, and X3 brought a lot of new faces into the series - even if Juggernaut was a huge letdown - the Phoenix climax was epic).  Days of Future Past ups the ante on everything and makes me hungry for the next installment.  I think they're being smart with this series - phasing some actors out and others in - because this bodes well for this being a series with a real lifespan well beyond where we're at now.  If you're new to the series, by all means don't start with this one.  Start at the beginning.  But if you're already an X-Fan, you're most likely going to love this movie.",
      "total_reactions": 1,
      "user": "Mudget"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "I love science fiction and I hate superheroes, but I credit the X-Men series with giving me an appreciation for them. X-Men has showed me that in the proper context, with some great writers, superheroes movies don't have to be the lowest form of sci-fi entertainment. Days of Future Past seemed to confuse some people, as it's not part of the trilogy and therefore it's timeline is off. The ending of the film also creates a paradox, which eliminates certain mistakes made in the other films. In layman's terms, some of the things that happen in the other X-Men movies, never happen, because of Days of Future Past. In an undetermined era, sometime between the end of the original film and Last Stand, a new enemy has been targeting mutants. These machines, meant to eliminate the mutants have malfunctioned and are now targeting humans as well. The machines are made with mutant DNA and therefore have the combined forces of all the mutants it's come in contact with, making them unstoppable. The only chance the X-Men have is for one of them to go back in time and stop the machines from ever being built. Wolverine is the only one with a mind strong enough to survive the trip and is sent back to the 1970s, where he meets the cast of X-Men: First Class. While difficult for non-sci-fi aficionados to understand, this film was not only extremely well written, but serves dual purposes for the series. First, it brings both casts together in an extreme fashion and it's a tremendous gift for the fans. Second, it allows the writers to undo mistakes from The Last Stand, which was at the time, set to be the final X-Men film. The ending to Days of Future Past, effectively explain that everything that happened in Last Stand, never happened, as it was part of an alternate timeline. This allows the writers to bring back characters like Prof. X (who is seen killed in that film) for possible future films. It really was an ingenious move for the franchises future, but it also allowed fans to experience the \"old timers\" and the \"new class\" working together, in a huge, diverse, and very impressive cast. Seldom are superheroes films so complicated or as well written as Days of Future Past. The writing is out of this world, the cast is full of stars, and the special effects were absolutely amazing. Love it or hate it, superheroes are part of the science fiction genre, but Days of Future Past was simply incredible and for that, it's our latest must see movie!",
      "total_reactions": 1,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "Even better than its already impressive predecessor, Days of Future Past is definitely Singer in top form - whether its the deft handling of the ensemble cast, sleek visuals or inherently humane story. Definitely the most fun I've had at the movies in a long, long time.",
      "total_reactions": 1,
      "user": "jack977"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "I was impressed considering these type of movies are not up my alley. The action was consistently engaging and innovative. The story doesn't get weirdly obscure like other similar movies.",
      "total_reactions": 1,
      "user": "Trev29"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "X-Men: Days of Future Past is the best X-Men movie ever. It's big, original and has purpose. It clears the past mistakes of the franchise by promising us a brighter future. The broad cast is as good as they've always been. Unlike, this year's Godzilla, marketing of this movie promised a great movie and it matched its expectations.",
      "total_reactions": 1,
      "user": "Albert13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2015
      },
      "score": 9,
      "text": "What I like most about this is how they used the other movies in it. It`s one of the things I like best about these X-men/super hero movies.This was an interesting movie from the beginning to the end.",
      "total_reactions": 1,
      "user": "oblique15"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "Stellar cast! Very interesting plot, though I wonder if they'll be continuing with this changed timeline or if this was a one-off. As is the norm nowadays, the special effects and visuals are amazing. Turned out better than I anticipated. A good X-Men movie.",
      "total_reactions": 1,
      "user": "Toffenuff"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2014
      },
      "score": 10,
      "text": "This movie was made out of pure excellence. The movie is by far one of the best x-men movies in the franchise. Bryan really did an amazing job with this movie. The acting is really great but my one complaint is that Ian McKellen didn't get much too say in this movie, just a few sentences. However looking past that I don't see more mistakes with it. I am probably gonna re-watch this movie again soon. I recommend this movie to anyone even if your not a huge X-men fan.",
      "total_reactions": 1,
      "user": "Seyyoshi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "great movie with fantastic plot and innovation of storytelling, also the act of Jennifer Jackman and James are amazing, and the graphic is much better than previous, awesome Marvel movie.",
      "total_reactions": 1,
      "user": "tonylionedo"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "Great movie in almost every aspect they did!",
      "total_reactions": 1,
      "user": "Inlikeflynn"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "Great movie, decent story, good acting all around. Was very fun and entertaining. Would be nice if the next one has humans and mutants united fighting some other threat because as much as I liked it this human vs mutant struggle is getting stale.",
      "total_reactions": 1,
      "user": "Tessara_Vejgan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "I'll be the first to admit, I'm not a big fan of the X-Men series. This film though is an exception. It has an incredible cast of actors, from up-and-comers like Omar Sy and James McAvoy to veterans like Patrick Stewart or Sir Ian McKellen. The film also a great balance between political intrigue and fun superhero action. That is why I believe this is not only the best superhero film of all time, but also one of the best political thrillers of all time. I give Days Of Future Past a 9 out of 10 stars.",
      "total_reactions": 1,
      "user": "jakenelson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "If you've seen (most of) the other X-men movies, go see this. Lots of action, highly entertaining, great cast, and an exciting interweaving of franchise wide story lines. Of course, this is a broadly appealing X-men movie through and through -- don't expect any deviations from the usual feel and relatively generic script. It's a fun superhero flick but it's no Nolan's Batman.",
      "total_reactions": 1,
      "user": "funkymoose"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "I am an avid watcher of all the X-Men films. I grew up watching the first three and my love for them has retained through to my twenties. Without being too verbose, the film has a stunning cast who deliver with every scene. I enjoyed the story immensely; from the dialogue to the gripping action scenes. Definitely my favourite film in the franchise. I've seen it three times in the cinema and have no doubt I'll see it a fourth! A wonderful, exhilarating watch. Go and see it! Now!",
      "total_reactions": 1,
      "user": "Alex_S"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "Easily surpasses First Class and several of the other X-Men sequels and spinoffs to become one of the best entries yet! The whole cast from both the past and the present settings all gather together and no one disappoints to say the least. The action is better than ever and the story is engaging. The only thing I was a little bit lost on was the post-credits scene. Overall, I couldn't have asked for a better X-Men movie!",
      "total_reactions": 1,
      "user": "moviemitch96"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "This is the best X-men movie so far, action was great the story was ok, it felt a bit slow at times though. It brings back Professor X from the dead with no explanation, but you cant go wrong with Jackman as Wolverine. 7/10",
      "total_reactions": 1,
      "user": "fusion_13"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "Eventhough there's a bit poor and unsatisfactory on its visual effects, but with a fascinating concept. a success of combining part of previous X-Men's franchise and long list of star, X-Men : Days of Future Past easily becomes one of the best film in 2014 so far (but not the best).",
      "total_reactions": 1,
      "user": "ugisupriatna"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "Days of Future Past is excellent. Yes, you can have those issues important things that fail to explain, but it's a very good film, how good are the settings, situations, psychology of the characters, that entertains you and leaves you amazed. It is a very entertaining movie, for me is a little better than First Class ... This film is the best so far of Superheroes in the remainder of the year, yes, it's even better than Captain America 2.",
      "total_reactions": 1,
      "user": "FranMan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "--If you liked this review, please read my other ones and mark this review as helpful--",
      "total_reactions": 1,
      "user": "AGarcia732"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "X-Men: Days of Future Past is a terrific example of how a superhero movie SHOULD be made. From its terrific dialogue to its amazingly charismatic cast members, DOFP is one of the very best comic book movies ever created.",
      "total_reactions": 1,
      "user": "TimeOfTheChimps"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "Full review @ http://www.idiotbox.co.uk/x-men-days-of-future-past-review-60051/",
      "total_reactions": 1,
      "user": "Idiotbox_uk"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "This is the best X-men movie till now, it takes a great and entertaining turn, with an interesting mind blender plot, that will make you be at the edge of your seat until the movie finishes.",
      "total_reactions": 1,
      "user": "RamonGuerrero"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "X-Men: Days of Future Past resulta ser una película de ciencia ficción bastante apocalíptica que te atrapa y te puede llenar de intriga a medida que avanza.",
      "total_reactions": 1,
      "user": "Cherryxld"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2014
      },
      "score": 6,
      "text": "If you read my review for Thor: The Dark World, it has the same good stuff. It wasn't confusing. It was too long. The latest x-men movie is a not so much movie. Skip it or not. replay value:Moderate.",
      "total_reactions": 1,
      "user": "IMAX500"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "this movie has great story great cast and great action everthing is right with the movie so i will wait to see it in blu-ray 1080p cant w8 D x-men day of future past",
      "total_reactions": 1,
      "user": "FranKenweenie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "Yet another satisfyingly paced movie to entertain me this year! \"X-Men: Days of Future Past\" is the best X-Men movie ever thanks to exciting action sequences and a well written story.",
      "total_reactions": 1,
      "user": "diogomendes"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "Yes, the best X-men movie yet. Everything about this movie was great. I saw it in a sold out theater so I had to sit really close to the screen but I still really enjoyed it. The action scenes were amazing with some great special effects. The storyline was also great it got confusing near the very end which is awesome leading into the next movie. The finale scene of the movie and the after credit scene were both really good and it makes me excited and happy for the next X-men movie in the great franchise.",
      "total_reactions": 1,
      "user": "Viper8787"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "I want to say before I write this review that I loved X-Men First Class and I enjoyed X-Men the Last Stand, so this movie is something I've been hyped for, since it was announced.",
      "total_reactions": 1,
      "user": "PandaFromHell05"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "It was a great film, the story line was a little confusing towards the end in my opinion, but overall a really good film, the action scenes were top notch, and they couldn't of been any better. i did feel they left some things unexplained, (once again in my opinion). if they explained things a bit more then it would of gotten a 10 from me, but overall still a really good film, go and see it.",
      "total_reactions": 1,
      "user": "TheL0neW0lf"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "This X-men movie is the best in the franchise, and I can't wait to see the next installment! The characters are many, and so nice and well written, the story is engrossing and complex, the special effects are gorgeous, especially some of the future X-men powers, and the ending is awesome!",
      "total_reactions": 1,
      "user": "Daxtreme"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 5,
        "year": 2015
      },
      "score": 8,
      "text": "The best film of the X Men I've ever seen, very interesting, although the main protagonist ends up being the Wolverine, you still have other important characters and, as Professor Xavier and Magneto, Wolverine but still have an amount slightly higher .",
      "total_reactions": 1,
      "user": "SpiderPlayer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "A rich movie that was astonishing and exciting almost every second, the diversity of characters and actors were gladly received. i love how this movie closes discrepancies between the previous movies and at the time is like an spin off. Great dialogue, but im not giving a 10 because where a movie shines its not if it had the best cgi or effects, but in the plot, the history twist very bad and may seem confuse at first, but don't get me wrong i'll go to watch it again.",
      "total_reactions": 1,
      "user": "Bullseyed"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "Just went to see this on Friday and I have to say this is by far the best X-men movie made so far.  Despite there are some loopholes in the storyline, like changing the past will change the future, you actually feel a sign of relief and grief at then end.  Acting are perfect for most of the characters though minor characters need to be shaped up a bit.  Both the old and young Magneto and Xavier did awesome job.  Overall, definitely recommend this over Cap. America or Spider-man",
      "total_reactions": 1,
      "user": "Decaymoss"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "An amazing move for fans of the series! Combines the X-Men we all love with a cool time traveling twist! I also loved all the little Easter eggs they put into the movie for fans of the comics! A must see movie!",
      "total_reactions": 1,
      "user": "I_Am_McLovin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "This X-Men movie took the elements of all the past movies, failures and successes, and delivered a truly enjoyable experience. While some parts of the movie were a tad repetitive I still enjoyed the movie very much. We finally were able to see all of the characters actually use their powers! Not filled with so much dialogue, but an even balance of action and story. Go see this movie if you're an action film lover...",
      "total_reactions": 1,
      "user": "DrakeBristow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "see here the best of them all this one is the most epic movie throughout the series download the movie from here http://goo.gl/nd32l4.",
      "total_reactions": 1,
      "user": "stelajohnson84"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "Metascore shows 84, you have got to be kidding me! This movie made over 90 million opening weekend. The plot - awesome, acting - awesome, special effects - awesome. In the words of Jeremy Johns (not sure about spelling) AWESOMETACULAR!",
      "total_reactions": 1,
      "user": "criticbynature"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "Esse filme simplesmente superou qualquer expectativa, foi muito mais do que o imaginado, simplesmente épico. Vejo uma trama totalmente mais envolvente do que a feita em \"Os Vingadores\", da rival Disney. Estava muito preocupado com essa produção e fiquei mais ainda quando foi anunciado o próximo filme \"Apocalipse\", porem já estou tranquilizado e estou ansioso para o ano de 2016 (além do novo filme dos x-men, terá grandes outros de super-heróis que iram estrear, como \"Batman x Superman: Down of Justice\", \"Captain American 3\" e outros mais!",
      "total_reactions": 1,
      "user": "rafabritto"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "I enjoyed this one just as much as X-Men: First Class. If you liked the first one, you won't be disappointed. All around great writing, directing, and acting.",
      "total_reactions": 1,
      "user": "penelohume"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "I really liked this film. The plot got me infested. I was into the characters. Wolverine was a great and had some awesome lines and fights. The Professor X older character was good I guess. The same can't be said for his younger self. He looks like one people who drives on he road for years and never cuts his hair. And I thought it's weird he has long hair in the past. Peter Dinklege was the best actor in the movie with him fitting the role nicely. The final fight was epic without spoiling it, I'll say it's awesome. Mystique was a good character for the first half, been the creative with her disguises and development. 2nd half she was a little lacking she was a little annoying as well but not enough to make her bad. The visual effects are so realistic. I honestly thought the moment with Wolverine time travel the effects were good there. Seeing this movie in Real 3D was interesting the 3D effects weren't milked like in Gravity or The Amazing Spider-Man 2. I went in to this movie excited which is strange for me sine I've never watched a X-Men movie (and I will watch them all soon) I was so surprised to that this movie win me over is great. I really loved this movie and if I would I would watch it again in theaters. I recommend this to any fan of X-Men.",
      "total_reactions": 1,
      "user": "JarradGhent"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "One of the best movies in the genre released this year. Possibly, one of the best in the series. This movie will not disappoint people who loves suspense, a great story line, and to have a whole lot of fun and enjoyment. Bryan Singer has done an amazing work in directing again, combining the action, the story, and the mix of emotions very effectively.",
      "total_reactions": 1,
      "user": "Aryut"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "Of all the X-Men movies this was by far the best. It does so well to bring a bridge between the X-Men trilogy and First Class that it seems almost as if the two are all one and the same (If that makes sense). It delivers all the things you can come to expect from an X-Men movie and it executes those moments nearly perfectly.",
      "total_reactions": 1,
      "user": "Critic0"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "Michael fassbender(magneto)...james mcavoy (professor) gives the emotional TOUCH...wolverine(hugh jackman) balances The story...mystique(jennifer lawrence) Keeps the story moving...Quicksilver PRISON BREAK 1 OF THE BEST SCENE IN THE MOVIE(THE MOST TALKED)....other mutants impress us with their HEROIC fights...1st half is full of fights n action...2nd half drama...music n vfx is big plus.... worth the check...Best x-men part so far.. SATISFIED very much... must watch movie for x-men fans.. DIR.Bryan Singer Had done a great job..he has lead x-men to a new dimension...erasing the previous parts n its flaws making this franchise nearly flawless.....as the events are changed(the past)....and bryan made the audience Lead to high expectations fr X-MEN:APOCALYPSE..will he deliver????",
      "total_reactions": 1,
      "user": "Deiveegarajan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "This is the best X-Men Movie and the best comic book movie in this year. Incredible Action scenes, good acting, dialogues. The Story is very good, interesting, thrilling.",
      "total_reactions": 1,
      "user": "XenoWorm"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "X-Men: Days Of Future Past is vibrant and entertaining movie, The effects are incredible and  X-Men: Days Of Future Past has found the right balance, i'm excited for X-Men: Apocalypse (2016).",
      "total_reactions": 1,
      "user": "R18"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "My favorite films of this summer so far. Dawn of the Planet of the Apes and,  X-Men: Days of Future Past, and lets see if Guardians of the Galaxy is gonna be a good movie, i'm excited to see Guardians of the Galaxy this August.",
      "total_reactions": 1,
      "user": "Frog-1987"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "This movie and X-Men 2  are my my favorite movies Its better then  X-Men 3,   this movie was AWESOME!! SUPERB!! , the story and great acting easily the best X-Men film since X2.",
      "total_reactions": 1,
      "user": "GOTG_2014"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "Movie of this year,  Interstellar . Dawn of the Planet of the Apes.  Guardians of the Galaxy.  X-Men: Days of Future Past,  Cant wait for Apocalypse. the cast is incredible in X-Men: Days of Future Past",
      "total_reactions": 1,
      "user": "yeah"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2014
      },
      "score": 9,
      "text": "Marvel appears to be at the top of their game after another installment of the X-Men series. This film may not only be the best of the series but perhaps the best Marvel film to date. Bryan Singer did a tremendous job returning to the series and manages to send the viewer back in forth to different time frames without any confusion. Hugh Jackman is fantastic as Wolverine as always, but I found that James McAvoy stole the show as the young Charles Xavier. Michael Fassenbender was extraordinary as well. Both of these men are great actors and are very underrated at this point in their careers. Days of Future Past is a must see for any Marvel fan. The world is now open to any possibility in the sequel Apocalypse. I'm looking forward to it.",
      "total_reactions": 1,
      "user": "ydnar4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2014
      },
      "score": 6,
      "text": "Really, \"Days of the Future Past\" is nothing new or that exiting. The film follows the same recycled plot (Humans vs. mutants) that all the \"X-Men\" movies do. I wouldn't say it's a bad movie, because you still get your summer popcorn fun from it, but I wouldn't brag about it either.",
      "total_reactions": 1,
      "user": "albertsss"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "I'm glad to return to the history of the trilogy. I like to see Storm back in action. Hugh Jackman is amazing as always. The finally made me cry for joy.",
      "total_reactions": 1,
      "user": "Franlavi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2014
      },
      "score": 9,
      "text": "This is, my a fair margin, the best x-men movie made yet. Combining all eras and casts (albeit not always equally), mixing heavy-hearted moments with an intensity and desire to see the unexpected that is rare noadays, this movie combines so many elements with an articulate finesse.",
      "total_reactions": 1,
      "user": "RockMetalDude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Well let's put it this way, X-Men: Days of Future Past is the best X-Men movie released to date. The cast was phenomenal with no issue of too many characters with lack of screen time. The concept tied the recurring theme of mutant apocalypse with an original story infused with historical events. With this story the franchise is open to a multitude of possibilities with the present timeline changed from that of the original X-Men series.",
      "total_reactions": 1,
      "user": "TheFilmFanatic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "X-Men Days of future past is the best X-Men Movies so far.Bryan Singers is back to play with his toys and make a good film out of it tat many of us enjoy watching it.X-Men Days Of Future Past is a great movie to watch.",
      "total_reactions": 1,
      "user": "JohnKristofer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2015
      },
      "score": 9,
      "text": "Bryan Singer returns to treat audiences to a tremendous film. X-Men: Days of Future Past presents audiences with one of the best comic book films ever made. From the stunning soundtrack, to the brilliant character development all round, to the masterfully conducted action sequences, Days of Future Past acts as the best X-Men film yet. The interplay between the characters, particularly between James McAvoy's Professor X and Michael Fassbender's Magneto, is gripping throughout. Whilst the stakes are risen, the film never falls into the trap that many comic book films nowadays fall into, that is that the whole world is under immediate threat. Rather, Singer creates a story that hits individuals on a personal level, creating one of the best films of 2014.",
      "total_reactions": 1,
      "user": "PeterAlexander"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2016
      },
      "score": 10,
      "text": "Who: Hugh Jackman, Katniss, and a ton of other cool X-Men unlike that lame First Class BS. The coolest mutant in that movie was a dude who shouted at water so he could fly.",
      "total_reactions": 1,
      "user": "RvwFromUpHere"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 3,
        "year": 2016
      },
      "score": 9,
      "text": "X-Men: Days of Future Past doesn't feel like a superhero movie, at least not in a traditional sense. There are action scenes but many are suffused with a sense of futility. Battles turn into massacres with the \"good guys\" on the wrong side of the carnage. A whiff of the apocalypse hangs in the air, ready to descend and blot out everything. Not since The Dark Knight Rises has a movie featuring familiar heroic figures taken such a grim and unconventional path. To reboot the X-Men franchise, director Bryan Singer, who first gave these characters screen life fourteen years ago, has crafted a continuity-lover's nightmare.",
      "total_reactions": 1,
      "user": "Cinemassacre94"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "Only the Dark Knight surpasses this film in the genre.  From beginning to the scene after the credits (it is after the full credits, by the way) Days of Future Past does not disappoint as an epic and satisfying conclusion to the earlier films, while setting up lots of new drama and intrigue for the next films.  Almost all of the performances were completely spot on with particularly good performances from Evan Peters (Quicksilver), Fassbender (Magneto) and both versions of Charles Xavier.  In addition, the action was well orchestrated and creative with more than enough drama and power behind it.",
      "total_reactions": 12,
      "user": "Snoracks"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "Despite its weak human villain (Trask), this move is complex, quickly paced & fun and X-Men: Days of Future Past ranks amongst the best of the X-Men franchise. 8.5/10",
      "total_reactions": 6,
      "user": "eagleeyeviking"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 5,
      "text": "If this were not an X-Men movie then it probably deserves a 7 or 8 but the problem is that in the title, it says X-Men. Thus when I review this, I assume it has relations to previous X-Men titles and since that was the reason I went to see this film, the movie fails. Now the question is how do I rate it? Do I rate it as a stand alone movie? Do I rate it as a horrible sequel the previous X-Men films? If someone wanted to write a movie like this, why couldn't they create a new franchise? Why did they need to milk the X-Men name for a few more viewers and take a chance at destroying the franchise (this is one of two reasons why comics died in the 90s)? There was no loyalty to the fans and the companies made it obvious that all they wanted was money when the fans wanted continuity and a good story. This is dishonest in my opinion so I am going to review it as an X-Men film.",
      "total_reactions": 10,
      "user": "marc5477"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "I have nothing more to say than pure awesomeness! it was definitely the best movie i 've seen this year. I might even say it was the best marvel movie. the actors were great and i loved that it combined the cast from the trilogy and from the first class. some might say the plot was a bit confusing but i think that it was what it made this movie special. i couldn't ask for anything better from x-men. i highly recommend it. if you love fantasy movies don't even think about it just watch it!",
      "total_reactions": 5,
      "user": "markal"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "One of the better comic book/super-hero movies this millennium at the least. Brilliantly ambitious and innovative plot line. Had me skeptical at first considering the 4 previous X-Men plus the 2 Wolverine movies had their own plot elements that had to be accounted for, but they were incorporated spectacularly. Great action scenes, well rendered CGI while not being too dominating and disenfranchising. Great script and as per usual when you have Ian McKellan and Patrick Stewart, phenomenal acting.",
      "total_reactions": 14,
      "user": "creed111"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "The writers of this very exciting film were clearly BIG fans of the original Matrix, and, by extension, Plato's Cave.  Beyond the obvious use of the name Sentinels, the future sequences were very similar to the out-of-the-matrix mothership, and the past sequences/locations were similar to the inside-the-matrix sequences.  Not literally, but the sense of urgency and juxtaposition.  See it and decide for yourself.   Beyond that comparison, the acting in this film is superb.  Best superhero flick of the summer - not a tough task.",
      "total_reactions": 4,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "In every level this movie has been the most complete marvel movie ever if not the greatest: The scenario is saturated with events that does not seem to distract you away from the main plot, we have a justified and well portrayed villain (magneto) which is non-existant in the marvel universe (except loki who might and probably should be considered as an anti hero after thor 2). I also do not know any other marvel movie that keeps this many characters and does not give you the feeling of the movie is overcrowded with too many shallow characters. The movie is emotional; not in a very dramatic way but it is able capture its thematic emotion: \"Hope\" because you get to feel some of the characters' feelings of desperation and their path of self destruction, you also get to see that this may fail no matter what you do but at the end hope wins and you get to experience this effectively due to great performances of the main characters.",
      "total_reactions": 4,
      "user": "Gurolge"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "Best X-men yet. An intriguing plot, likable characters, awesome action and a small dose of humor make this the best flick of the summer so far. The acting was terrific, with great performances from Michael Fassbender, James McAvoy, Hugh Jackman, Peter Dinklage and Evan Peters. Speaking of Peters, Quicksilver was a big surprise and the highlight of the movie, eliminating all earlier complaints about his design. DOFP leaves a tough act to follow for the rest of the summer. Must-Watch",
      "total_reactions": 4,
      "user": "AccidentalSM"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "The perfect summer blockbuster and the best x-men movie yet. I loved this movie and it is my favourite movie of the year so far. ABSOLUTELY PERFECT. YES IT IS THAT GOOD. 9.610.",
      "total_reactions": 14,
      "user": "MJKPSTAN"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "I'm gonna start by saying that I'm not a huge X men fan but I am a big fan of Wolverine and Jennifer Lawrence's take on Raven, I've seen every X men movie now and I honestly thought this series wouldn't reach a level that would go higher then X2... but man was I wrong, this movie was excellent in every sense of the word, the pacing was perfect, there was a lot of comedic moments that I didn't expect, I will say that there's a sequence with Quick silver that's worth the ticket price alone, what surprised me the most however is that out of all X men / Wolverine movies this movie by far the least amount of action, proving that these Super hero movies don't need to be filled with wall to wall action to be an excellent Super hero movie, this wasn't just a good comic movie, it was an excellent movie... I've heard this said by a few reviewers but until I saw it I wasn't going to comment on it...\"If this movie doesn't get a best picture nomination I will be appalled\" I agree with that statement, giving this movie a 10 feels like an insult but since that the highest the scale goes it's a 10.",
      "total_reactions": 7,
      "user": "TheMarine316"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 14,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "Best X-men Movie Ever. It has everything. Just watch it. Great characters and the most intriguing plot. One of the best films of this year and surely the best Marvel film. Watch it !",
      "total_reactions": 20,
      "user": "Kiva"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "No need to do pros/cons for this one I loved Days of Future Past! It is the perfect X-Men movie! Almost as good as First Class. Everyone in this movie put on a great performance, the action/set pieces were great, the story was done very well and that's saying something because it is a time travel movie, and a great underlying message of hope. Bryan Singer did a great job in his return back to the franchise, not sure if he'll ever do one again now, but if he does I'm eagerly awaiting the next instalment.",
      "total_reactions": 10,
      "user": "DownByTheRiver"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "This is the X-men movie that we've wanted since the beginning. The cast is absolutely perfect and the balance between the original cast and the first class cast is awesome. Intense action and emotional roller coaster. This movie basically rewrote all the wrongs of the first 3 films in a very tactful way. Can't wait until the next one.",
      "total_reactions": 12,
      "user": "Renwicke"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "X-Men: Days of Future Past is a very emotionally heavy movie, and I couldn't resist shedding a tear or two as I sat on the edge of my seat, wondering what would happen next, even though I read the comic before I went to the theatre.",
      "total_reactions": 12,
      "user": "Loganis"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "This was a great movie overall, the setpieces and action scenes were very well done, the plot was well adapted from those comics it drew upon for inspiration, and it leaves off with a couple ideas left in my head as to where the series might go next without unbearable cliffhangers.",
      "total_reactions": 6,
      "user": "TheTourist"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "It isn’t just the Xs and Os that make the film special; it’s also the film’s ambition, which cannot be understated.  This film is being released in a post-Avengers world, where culmination is king (see DC/WB’s recent Justice League-related moves as evidence), and the X-Men franchise comes into this picture as considerably fractured.  The original “modern day” team – Wolverine, Professor X, Cyclops, Storm, etc. – petered out with the third entry, only Wolverine has had any success as a stand-alone spinoff, and the First Class “prequel” was immediately hailed as the best of the entire lot, leaving the original to be forgotten.  Rather than reboot the whole shebang or focus on a specific First Class sequel, Singer instead doubles-down and incorporates old and new.  Granted, he mitigates some risk by keeping the focus on only the best characters from the two worlds, but his faith in incorporating anyone from the old world other than Wolverine, and his willingness to cut bait on some of the lesser characters from the new world, speaks to his confidence as a filmmaker.",
      "total_reactions": 6,
      "user": "ScribeHard"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "With two teams joining together in a truly epic way, id say this is the best X-Men yet.  It surprises me that the bar is still set at a reasonably reachable level.  *SPOILER*  Apocalypse will give Ultron & ALL OF DC a run for its money.  The perfect set up for people to get interested in the next installment",
      "total_reactions": 6,
      "user": "Skittleballs"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 6,
        "year": 2016
      },
      "score": 8,
      "text": "X-Men Days of Future Past Is a great movie and a great entry for the X-Men Franchise.The movie has a great plot and a great action sequences.The characters are entertaining and has a great chemistry ,the old and the new cast are fantastic in this film but the old cast are just their helping to stop the robots that can execute mutants but at least they are there.Performances are excellent in this movie.",
      "total_reactions": 6,
      "user": "SeanVincent"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2015
      },
      "score": 8,
      "text": "\"X-Men: Days of Future Past\" does tend to exaggerate some of its action sequences like it did in \"X-Men: First Class\" as well as throwing in some questionable ex machines once in a while, but overall in my opinion this movie is the finest X-Men movie to date, as the stellar cast, a tricky but clever script, and the determination to refresh the movie series to its core really makes \"X-Men: Days of Future Past\" a joy to watch.",
      "total_reactions": 3,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "Great movie!!!! For the first time in a long time the odds really seem stacked against the heroes. Easily one of my favorite superhero movies to date. Quicksilver also makes an appearance and even though it is brief it was amazing an I want to see more. Overall XMDFP is an amazing movie!!",
      "total_reactions": 3,
      "user": "xunderwoodx"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "From the very beginning, “X-Men: Days of Future Past” had me hooked. It tells an endearing story of the struggles of survival for these mutants as they are picked off one by one by the monstrous and vicious Sentinels. The X-Men have to work together with their past selves, in order to secure their future. It is a fun and highly well told story that pays of not only in the action, but also emotionally.",
      "total_reactions": 3,
      "user": "AwesomeReviewer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "This is probably the best X-men film to date. Finally the X-men franchise is living up to its potential. The plot is complex. Characters have agendas and motives that overlap or conflict at times and are authentic. It is an ensemble film where key characters are dynamic. At last what X-men should be.",
      "total_reactions": 3,
      "user": "Gamed2long"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "Easily the best \"X-Men\" film since Singer's original attempts, \"X-Men: Days Of Future Past\" features a challengingly novel narrative structure, intensely engaging set pieces, and a bevy of memorable moments of pathos. And, although the film leaves many questions and thread left to be resolved, it still represents a magnificently satisfying return to form for one of cinema's first superhero franchises.",
      "total_reactions": 3,
      "user": "Compi24"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "Being the oldest superhero franchise,the xmen series had a few flaws in some of its previous films but Singer was able to bring back the X-men grove and earn redemption in the latest instalment of the series.Totally satisfying and immensely Awesome",
      "total_reactions": 3,
      "user": "Algorithem"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "Brian Singer brings X-Men back to the glory of when it was fully under his helm. This is taken from one of the better X-Men story lines. It's not the greatest action film, nor the greatest sic-fi film, nor the greatest comic book film. But' it's still excellent in all three categories.",
      "total_reactions": 3,
      "user": "AtariBaby"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "With a clever plot and a brilliant cast and we'll laid sequences x men days of future past is one of the best instalments in the franchise the actors are on there game they all know there role like the back of there hand even so after 14 years for some put they keep it fresh you also get more Jennifer Lawrence as mystique and a very unexpected ending x men fans will enjoy.",
      "total_reactions": 3,
      "user": "travellyn"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "The biggest problem for me is probably because I came to see the movie with such high expectation that it was going to blow my mind and replace X2: X-Men United as my favorite installment of the franchise. The movie is still decent, and I love the story telling because it's pretty solid. However, while the scene from the future is very exciting with all the mutant fights, the past delivers too much of the drama and less the action. My favorite thing of Days of Future Past is, just like everyone else, the fresh portrayal of Quiksilver by Evan Peters. He's a very potential star and I'll still be waiting very enthusiastically for Apocalypse. Though I do have to say it has failed to hold its position on my favorite summer movie this year.",
      "total_reactions": 3,
      "user": "raviopatra"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "x-men days of future past is an amazing addition to a great series,director Bryan Singer returns as the triumphant director of X1 and X2,and what we get is an inrcredibly human,terrificly acted and brilliantly shot story,that just confuses quite a lot for the people that have seen all previous films including the prequels.",
      "total_reactions": 3,
      "user": "thebeast007"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "actually, this movie was quite different then before, this movie has breathtaking graphic and the story line is not bad enough, the acting of actor and actress was good and marvelous, the action is very good too thought, this movie was the best of the year for me, I like this",
      "total_reactions": 3,
      "user": "rafi_haha18"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "Director - Bryan Singer",
      "total_reactions": 3,
      "user": "Silverscreensno"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "Just got back from watching X-Men: DOFP. Very entertaining with some great (and not so great) effects; but with some very sincere moments of character development, specially with Prof. X. All the acting was top-notch as you would expect. However, there were some (major) characters who hardly got a word in at all. One major character was just seen in the hallway at the end and another (future-version) major character wasn't seen at all (If Magneto got his power back after X-Men: Last Stand, didn't she?). Characters we did get to see and actually have some lines, were great. New characters (for the movie series) were awesome: Quicksilver!",
      "total_reactions": 3,
      "user": "BECMeta"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "A thoughtful, well-crafted, highly metaphorical action adventure film that doesn't rely on special effects alone to carry its story. An excellent ensemble cast, terrific visuals and ample wit make this a crowd-pleasing blockbuster that provides plenty of food for thought as well.",
      "total_reactions": 3,
      "user": "Brent_Marchant"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "In order to garner full value of this movie, it is critical one has seen the prior X-men movies. Initially, I did not have high expectations for, yet another sequel. I thought, how could they possibly improve on the prior films? Well, they did it... The story, plot and special effects are exceptional. This movie not only plays on the various attributes of the favorite X-men characters, but adds a few new wrinkles to the saga, as well as, provides sub-textual life lessons. This is a must see movie and I highly recommend the 3D version. I reserve the rating of 10 for those few \"epic\" films, therefore; I rate this particular movie a 9 and save the rating of 10 for the entire series. Go see this movie...",
      "total_reactions": 3,
      "user": "TBrianBryan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "I watched the movie with a bad expectation about it, but that Xmovie surprised me, was not that tiring sequence as Xmen3 or XmenOriginsWolverine. It flows as well as drawings and comics. Regarding the storyline, is at the level of Captain America 2.",
      "total_reactions": 3,
      "user": "PVFOX"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "Easily the greatest X-Men movie ever created in the history of ever.  It blew minds. Go see it. Literally the best one released so far. Honestly, this is probably the best that super-hero movies are ever going to get to. The last superhero movie that I saw that I thought was this good was Spiderman 2 with Tobey Maguire (and can't forget that Willem Dafoe cameo) and X-Men blows that movie out of the water. I've seen it four times already, and I'm ready for a fifth. Seriously, no movie has had me this engaged. Michael Fassbender as Magneto and Patrick Stewart as Professer X had the greatest bromance since Brokeback Mountain, and it had me sobbing in the theatre, along with those next to me. You can't remember a greater post-credits clip than the one schwarma scene in the Avengers, and this movie annihilates that one. You gotta wait till the end of the credits. Words cannot express how much this movie means to me, and how much it has affected me in the days after I experienced the beauty that is X-Men: Days of Future Past. Go see it, and don't forget the Kleenex and Vaseline.",
      "total_reactions": 3,
      "user": "black04031965"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2014
      },
      "score": 5,
      "text": "If you love xmen. See it. If you love good story... Don't expect much.",
      "total_reactions": 3,
      "user": "natetheartist"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "I have a personal dislike for marvel. I feel that as if most of their movies are meant for kids.However, X-Men : Days of future past was able to bring in such a good story ark and character development that the most common issue I have with Marvel flushed down the toilet. It proved to be a great movie that not only is the best X-Men movie but also one the best marvel movies ever put on the big screen.",
      "total_reactions": 3,
      "user": "DanielT159"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "Nice movie , I didn't expect it to be that good! Highly recommend it someone who hasn't watched it yet! The cast is amazing and it will keep your eyes wide open from beginning!",
      "total_reactions": 3,
      "user": "chips6529"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "The actors  are superb in this X-Men installment. The movie was well paced with no lulls. Interjecting the characters into a sort of alternate history created an environment ripe with ways to entertain the viewer. The story is nothing short of captivating. This is possibly the best of the X-Men movies.",
      "total_reactions": 3,
      "user": "Wiley_Jenkins"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "Coming from a longtime fan of the comics, this was a GOOD movie.  It was probably the most anticipated of the X-Men movies I have seen lately.  I was disappointed at how they deviated from the original story ark that the movie was based on, but I do understand that they are trying to connect the original X-Men movies with the newer X-Men: First Class team.",
      "total_reactions": 3,
      "user": "NINliar12"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 5,
      "text": "Terrible jumbled mess of a film that walks all over itself and then again.",
      "total_reactions": 11,
      "user": "19x"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "Director Bryan Singer make another masterpiece, the story is amazing",
      "total_reactions": 11,
      "user": "JanakVerma"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "The best X-Men film so far. Easily.",
      "total_reactions": 16,
      "user": "QwertyPJM"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "Without a doubt the penultimate X-Men movie in this universe. The new characters it introduces are a joy to watch especially Quicksilver who steals every scene he's in. I think a lot of moviegoers will consider his scenes in the movie as their favorites. My only criticism of the film,and it's a minor one,is that the ending was a little too neat but that can happen when time-travel is the major conceit.",
      "total_reactions": 8,
      "user": "homerbaldman"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "This is one of the best superhero movies ever made and is easily the best X-Men movie to date. It puts the X-Men franchise back on track. This year has been great so far with this and Winter Soldier being amazing.",
      "total_reactions": 5,
      "user": "BladeStrike"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "This film did one thing and one thing only: amaze me. Everything in this movie was done to near perfection. Action sequences were unbelievable, the cast (Jackman, Lawrence, and McAvoy) spectacular, and best of all, the fantastic storytelling by Bryan Singer. This is not only the best X-Men movie, but possibly Marvel's best yet.",
      "total_reactions": 5,
      "user": "Mattyice"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "About 3 years ago, Mathew Vaughn tried a whole new level of Xmen with Xmen First Class, and despite being too long, it was brilliant. But now, in 2014, director of Superman Returns- Bryan Singer comes with another level of high class, well acted Xmen, with good results. The first think I want to say is that Days of Future Last isn't your typical action fulled, popcorn movie. If you like the comics or are familier with the characters and storylines, it's good to go for you. Some movies are so gripping and they stay so true to their comics and origins- DOFP is that type of movie. The Xmen send Wolverine played by Hugh Jackman in the past to stop the war that came in the future. Hugh Jackman was really good in this movie. Patrick Stewart and Ian McKellen were the highlights. Jennifer Lawrence and Halle Berry were there but they were normal fare. This is the most absorbing and greatest Xmen movie ever know in recent years, it deserves the hype, and sure as damn deserves this much pride. This is what Tarantino did to Pulp Fiction, what Nolan did to The Dark Knight, what Kubrick did to Clockwork Orange. This is real cinema. I think I have never watched a movie so exciting and refreshing. You walk out of the theatre felling a sense of joy or spotting those Easter eggs with your friends and family. That is why movies are made. And DOFP is just that and even more. Why wait? Devour this excellent piece of filmmaking.",
      "total_reactions": 5,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "Not only is this one of the best movies of the year so far, it's one of the best superhero movies I've ever witnessed. The combination of both \"First Class\" and the original X-Men cast worked out so perfectly! The time-travel aspect and story arc worked out so well. Plus, James Mcavoy's performance as younger Professor X was the best part of the movie. Even Quicksilver was one of the best parts of the movie. Overall, everything meshed incredibly well and every character (for the most part) had their moments and were at their dynamic best! I don't care what others think, this is the best one in the series. This is truly worthy of an A+! Go see it!",
      "total_reactions": 5,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "i loved the movie he brings all the feels from the hq and the quicksilver scenes were awesome and the age of apocalypse scene in the end was very cool and the E for Extinction speech reference was an incridable easter egg",
      "total_reactions": 5,
      "user": "radamanthys"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "Such an incredible film. X-Men: First Class and X-Men: Days of Future Past are like complete reboots in the X-Men series. Totally diminishes the first three movies of the franchise: X-Men, X2 and X-Men: The Last Stand like it never existed. What was great about X-Men:Days of Future Past is the incredible script and the compelling  characters. The actors gave so much life to the characters they portray. An audience can feel their pain, anguish and longing to be accepted. James McCavoy, Michael Fassbender and Jennifer Lawrence are top of their game. Their performance was outstanding and deserves so much recognition. A 10 out of 10. Best movie of the year thus far and Best Summer Movie of the year!",
      "total_reactions": 7,
      "user": "francisrgo"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "In my opinion, the film may have had its mistakes on the continuity of the franchise, but that does not change the essence and the fact that X-Men Days of Future Past is a film that brings to us a reflective thought about what our choices defines a new future. It is a film of Super Heroes.",
      "total_reactions": 9,
      "user": "LucasAmancio"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "Easily the best X-men movie yet. It blends the original series of films very well with first class film. Bringing the two casts together to pretty much reboot the franchise. Don't forgot to stay after the credits for an epic easter egg of what is to come!",
      "total_reactions": 9,
      "user": "Nathanielsrkod"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2014
      },
      "score": 3,
      "text": "This movie was all over the place. It felt like a ginormous retcon that only ended at the same place we started all those years ago.....except Wolverine has a bit of grey in his hair while everyone else somehow looks exactly the same as they did in the first movie.",
      "total_reactions": 11,
      "user": "Bertoflyingfox"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 7,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "This film was a juggling act of immense proportion. And it all played out beautifully. Less a reboot and more a healing, this is in any case the beginning of the future for the cinematic X-men universe. It's impressive that any sort of moving narrative was pulled out of what was trying to be accomplished, there are so many moving parts and so much to address that it might be a headache for anyone unfamiliar with the franchise. But there is almost a bounty of narrative to be had and some extremely touching interactions of not only characters, but incarnations of selves. Nothing feels squandered or easily earned here, and so many wrongs have been righted. It's miraculous and perplexing at the same time, as the film concludes as a meta-feat: they were fighting for an alternate future by remaking history and well, they were also fighting for a better X-men franchise by rewriting past failures. I walked out of the theater feeling like part of me had actually been saved, and that my love and hope for this franchise, this world, had been rewarded. This is the best X-men film yet, and it does not neglect what came before but uses all of it. And there is only hope in the future.",
      "total_reactions": 14,
      "user": "trashmyego"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "cant stand singers xmen.  I didnt even really think first class was that good.  I feel its one of the worst of the marvel cannon of movies.  The best moments are in the trailer and there is maybe one or two scenes that are good.  Time to reboot Xmen and start from scratch.",
      "total_reactions": 10,
      "user": "JamesCannon"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "This is easily the best X-Men movie in its entire series. I have been a huge X-Men fan for decades and the story stayed mostly very close to the comic books. Maybe even closer than any other Marvel movie ever made. This competes with Avengers 1 & Winter Soldier for the best comic movie ever. Well worth the 247 million Fox spent making it. The ending was perfect and looks like X-Men Apocalypse will be extremely close to the comic story.",
      "total_reactions": 8,
      "user": "Neelyry"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "A fantastic film the puts the X-Men back on the right path.  After X3 this franchise hit a major speed bump, but following First Class director Bryan Singer continues that films momentum.  A",
      "total_reactions": 8,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "The film contains every sequence you need to know. From the past to future, also, it shows us that if we liked the other X-Men movies, this will be the most loved one. Bryan Singer fixed all the mistakes that the franchise has ever had. I highly recommend X-Men: Days of Future Past; not because it is a superhero movie but because it has a good script and great performances. This movie exceed all my expectations. Can't wait for X-Men: Apocalypse.",
      "total_reactions": 8,
      "user": "PhoeboBuffay"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "This film is by far the strongest in the X-Men series. It captures the heart and emotions not focused on in the other films and aims to tie continuity together in between the sequels and spin-offs of the series. Though a lot of characters in this film seem to be used as special-effects-mutant-power-grunt-men, it mostly works, with Fan Bingbing’s Blink and Evan Peter’s Quicksilver being the strongest. The anchoring characters are the ones in the past, and the future ones used more as segues for action rather than character development and this also creates an interesting dynamic and balance to the enormous cast.",
      "total_reactions": 8,
      "user": "marcmyworks"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "Luckily, the X-men movies stay on a roll with First Class, The Wolverine and now this. The movie did an excellent job of balancing the story lines and the acting was top notch. Glad to see the X-men franchise is back on track!",
      "total_reactions": 6,
      "user": "Rob7309"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "My favorite x men movie as of right now the action was great and the characters I sincerely cared for there was a lady played by Ellen Page and I don't know what her name was unfortunately but I liked her and I felt bad when she got hurt wolverine was awesome because well he's wolverine magneto was amazing and well pretty Much every other character was to there was a surprising amount of emotion in this movie so prepare your tear ducts and the question is would I put this up there with Avengers , the dark knight rises and whatnot yes I would and beyond an easy 10/10 five out of five and a bad a** seal of approval",
      "total_reactions": 6,
      "user": "Arendelleawesom"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "I guess they learned from that X-Men: First Class fiasco that when people go to an X-Men movie want to see some popular X-Men characters and not the C-List X-Men.  The reason this movie was good was because it wasn't X-Men: First Class, there were actually popular X-Men in this movie. X-Men: First Class was so horrible.",
      "total_reactions": 6,
      "user": "mhenderson8"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "This is an excellent X-Men film that continues the rise of quality that came with First Class.  Days of Future Past is definitely worth the watch in theaters, but fans of its typical action pacing will want to understand that this movie progresses a bit slower and utilizes action without dragging it out mercilessly.  It is definitely one of my favorites, if not my favorite, X-Men movie to date and makes me think there's still plenty left in the tank for this Marvel series adaptation.",
      "total_reactions": 4,
      "user": "SchroederRock"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2014
      },
      "score": 5,
      "text": "X-Men: Days of Future Past won't be remembered for being a bad film, it simply won't be remembered period. The movie doesn't offer much of anything that you can hate or love about it. Dull dialogue, no action and performances that were mediocre at best. It holds the title as the most forgettable movie this year.",
      "total_reactions": 4,
      "user": "csw12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "Before I say any thing else, this movie is innovative on its chronological story-telling by doing something the source material has done, but no movie I can think of has ever tried: It's a good movie that undoes a bad movie! Walking into this film, I knew the time-travel aspect could enable the franchise to do more things and subtract installations that knee-capped it (Last Stand, Origins: Wolverine). Now onto the film ignoring that novelty; this film's story is bleak and it is really not afraid to express that. Some scenes feel like Dark Souls, but with weight. The story is that Wolverine is sent back via Kitty Pryde's powers to the early 70's to unite a depressed Charlies Xavier and incarcerated Erik Lensher to undo Mystique's act which pretty much dooms everyone. Also, Logan has to cope with the inconvenience that since he's sent back before the Weapon X project, he only has his bone claws. That's as much plot as I want to give away. Because the movie is running off of virtually two ensemble casts, any one with any dialogue of significance being a damn good actor. What's awesome is that even though the bulk of the film takes place in the past, Bryan Singer's trademarks of it being an X-men film are more prominent than Matthew Vaughn, First Class's director and this one's co-writer: It's theme is a reprise of X2's theme accompanied by a creative CG intro with a monologue by Patrick Stewart. It's focus when not on action, is just smart dialogue (this is an executive producer of House we're talking about here). The only two pieces of advice I give to those going seeing is to see X-men, X2, Last Stand (if you see the bad one before this, you'll appreciate what this film does), and First Class and prepare for a comic-book film darker than Captain America: The Winter Soldier.",
      "total_reactions": 4,
      "user": "Xskills"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "X-Men: Days Of Future past is the best X-men film to date, completely destroying the crowned king X2. The film is full of emotion, action and intensity, Brian Singer is an amazing director, this truly is one of his finest films and really captures how much he cares for the X-Men franchise. Just an absolute master-peace of a film, i could recommend this to anybody, even those that dislike superhero films because to me X-men isn't really about being a hero, its about trying to survive, trying to beat those that look down upon you in positive or negative ways and finding hope in hopeless situations which truly is the main theme for this film, finding Hope when all seems lost.",
      "total_reactions": 4,
      "user": "ReubenIsAGod"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "Nice to see Bryan Singer back at the X-Men helm. He's clearly been missed since his departure.",
      "total_reactions": 4,
      "user": "Rox22"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "The best X-Men movie and the best Superhero movie in general, successfully puts this franchise back on the right track without it feeling cheap or fake.",
      "total_reactions": 4,
      "user": "ParkerFarron"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "Bryan Singer's return to the franchise created some major hype, and the results? X-Men: Days of Future Past exceeds expectations and dazzles throughout; from the opening sequence featuring old and new mutants allying against some Sentenals -- who, minor SPOILER alert, are winning -- to one of the funniest scenes in X-Men history, featuring Quicksilver and some slow-motion badassery. And for the ladies, there's even some minor man candy, in which Hugh Jackman is seen again flaunting his 40-something-year-old body in a short nude sequence.",
      "total_reactions": 4,
      "user": "asjklasjklas"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2014
      },
      "score": 6,
      "text": "Could mythbusters tell me if its possible to build a plastic gun in 1973 let alone giant robots with harrier jump engines in their chests? A short guy as a scientist, all the bad scientist are ex Nazi germans. The future Sentinels were too strong, I liked the TV version better. The best mutant was the 'flash' yet he was dumped? Awesome scene with Magneto but that was about it for awesome, the future attack was too confusing. I enjoyed this movie to the point where my brain was detached from all sense of reality but after that I didn't like it.",
      "total_reactions": 4,
      "user": "dougaussie"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "\"So many battles waged over the years... and yet, none like this. Are we destined to destroy each other, or can we change each other and unite? Is the future truly set?\"",
      "total_reactions": 4,
      "user": "DuckNation"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "One word, AMAZING. It is the best X-men movie to date. After the nightmare that was X-men 3, and X-men Origins, the past three X-men films have been much better, and this movie is the best one. With a lot of the original cast returning, this movie rights the wrongs of the franchise. it has a great story, and some amazing acting for a superhero movie, particularly by Fassbender and McAvoy. This movie definitely brings back the good vibes that came with the first X-men movie, if you are a fan of superhero movies, or you just love a good summer blockbuster, this movie is a must see.",
      "total_reactions": 4,
      "user": "AlexArvin11"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "NOW THIS IS A SUPERHERO MOVIE!!! This movie is brilliant, it even fixed the crappy X3 stuff, the story, acting, effects, even the soundtrack was amazing! Hands down the best superhero/comic movie ever! Take that The Amazing Spiderman 2 and your crap movie! This one is a MUST SEE!",
      "total_reactions": 4,
      "user": "himynameisart"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "As a fan of the series and watching all the previous xmen/wolverine movies i enjoyed this one alot. with a non  linear plot line the directer did a great job of not making this confusing. i thought the emotion and passion was very sdtrong in the movie and it was a gripping movie. i loved how the story weaved from past to present and used both cast of actors from first class and the original movies. this wasn't simply a mutant mash-up and the plot was well mad eand as a fan of the series i think it held true to X-men and im pumped for the next one to come out!",
      "total_reactions": 4,
      "user": "nonchalantgamer"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "Director Brian Singer takes all the best elements of the X-Men franchise to create satisfying installment that fans and moviegoers will enjoy. A perfect film to start off the summer, in my opinion.",
      "total_reactions": 4,
      "user": "lkaliba"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "This X-men movie is the best one for its: understandable character development, spectacular action, powerful dialogue, subtle fanservice, and respect to the source material.",
      "total_reactions": 4,
      "user": "CybercoreCEO"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "PROS:",
      "total_reactions": 4,
      "user": "erty_werty"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "the best x men movie made so far, this will delight you in so many ways. the outstanding ensemble with great action sequences, to a nearly flawless story (you unfortunately cant deny the confusion the x men time frame has created), and the exciting score- this film is simply awesome!! after the devastating x-men: the last stand, you will be glad to find Bryan Singer as the ultimate director and storyteller.",
      "total_reactions": 4,
      "user": "arsheesh"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "Now this is what I'm talking about. This is definitley my favorite X-Men movie. And since X2 was my favorite comic book movie, this is now my favorite comic book movie. This is an absolute must see. Great plot, great acting, actual strong emotion and one of the best final battles I've ever seen. Go see it!",
      "total_reactions": 4,
      "user": "moviebuffmike"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "Best Xmen movie since Xmen 2. I feel like this movie has given the franchise a well need jump start. Jackman and Jennifer Lawrence are great, but the Quicksilver scene steals the show",
      "total_reactions": 4,
      "user": "django_unchangd"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "One of the best X-Men movie I have ever seen. I was hoping to see a little bit more about the future part. Special effects were amazing, actors were amazing, story was amazing and the sentinels were just so bad ass. Great movie, to be seen right away.",
      "total_reactions": 4,
      "user": "lebk2440"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "Let's see, there are monsters in the present day that are destroying things, so we need to go back in time to change a sequence of events to save the world.  Sound familiar?  It's the plot of Terminator from 30 years ago.  Also the plot of this movie.  I hate time travel movies because they make no sense so I probably would have avoided this movie had I known.  They also use the dreaded Countdown technique where everything comes down to the last second, another overused movie technique in the last several years.  However, I'm still giving it a pass because the special effects are great and the actors seem like they care, and the 3D was excellent.",
      "total_reactions": 2,
      "user": "Bikerjames"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "By far the most compelling entry in the X-Men movie series so far. The focus is less on action and focuses more on the plot and characters. I have to say it's nice to see some X-Men other than Wolverine get some time in the spotlight. There's a grand spectacle to it all and plenty of dazzling special effects.",
      "total_reactions": 2,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 9,
        "year": 2014
      },
      "score": 3,
      "text": "Really nothing special.  I watched this on the basis of the User Reviews here and was sorely disappointed.  Terrible dialogue.  Predictable story line.  All of the big names (except Hugh Jackman) either sleep-walked through this film or overdid it.",
      "total_reactions": 2,
      "user": "PoundedChicken"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "It was good, had some fun moments, got a bit creative with some of the character's abilities.  A few gripes of course.  Most of the characters were under used, technology was a bit inconsistent, and at least one of the characters spontaneously gained time travel (ish) powers.  But all in all I have to give it a recommend.",
      "total_reactions": 2,
      "user": "Yerczeys"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "BakaHaram, that is simply the worst review i've ever read",
      "total_reactions": 2,
      "user": "vcca15"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "Terrific movie. One of the best superhero movies I've seen. The cast was excellent and the story was good. That acting was terrific and it has one of my favorite scenes in a superhero movie. I know why they changed the story to suit Wolverines needs as the \"main character\" for the X-men movies but I would have liked to see them keep the old DoFP storyline intact. However, this movie did make up for the change in story pretty well and I give them credit for what they did. This is easily the best X-men movie they've made and probably the best superhero movie I've ever seen. Can't recommend it enough.",
      "total_reactions": 2,
      "user": "Kenmei"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2014
      },
      "score": 4,
      "text": "A film in which the retcon of the retcon of the retcon of the retcon is retconed, sees Adam Jenson straying outside his Deus Ex beginnings and accidentally getting Wolverine's powers, before being sent back in time, in mind only, by a mutant who has no relevant mutation to perform this task, so one must question the quality of her work, I suppose.",
      "total_reactions": 2,
      "user": "Howard"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "Best comic book movie ever made.  Bryan Singer has fully redeemed himself.  Can't wait for the next movie.   Please bring in Rogue, Gambit, Morph and Cyclops in the next film.",
      "total_reactions": 2,
      "user": "howiboy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "When I first heard Bryan Singer was coming back to direct the next X-Men movie, I instantly was overwhelmed with excitement. The franchise: to say the least, has struggled without his guidance. Many saw X-Men: The Last Stand as a disappointing end to the original trilogy, it was clear to many that 20th Century Fox didn’t know who to bring in to fill Singer’s shoes. Then X-Men Origins: Wolverine happened, and it seemed like the franchise would never return to the former glory it was at X-2. Then X-Men: First Class was released 2 years later, telling the origins of Professor X, Magneto and Mystique from the original trilogy, as well as introducing its own set of characters. While it impressed fans and critics, giving audiences hope that the franchise was returning to its former glory, many were confused towards the canon it had with the original trilogy, Wolverine had a cameo halfway through the film, making fans wonder how this movie and the others were linked.",
      "total_reactions": 2,
      "user": "Shanester16"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "amazing !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "total_reactions": 2,
      "user": "killian13"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "This was good! The setting, 1973 is very strong and well done, and the cast have a real commitment to these films that just shines through everything. A clutch of excellent actors, every performance stands out.",
      "total_reactions": 2,
      "user": "SoakerCity"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "BEST X MEN MOVIE SO FAR..............GREAT ACTING ESPECIALLY BY JAMES McAvoy AND HUGH JACKMEN......GOOD CREDITS AND EXCELLENT APPEARANCES.......MUST SEEE",
      "total_reactions": 2,
      "user": "Amaljos"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "X-Men: Days of Future Past is the best X-Men and one of the best Marvel movies. A perfect Blockbuster with amazing action scenes and very good performances.",
      "total_reactions": 2,
      "user": "Luisz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "I'm a big fan of Wolverine, so I was happy to see Hugh Jackman taking part. This film was comical and the story was easy to understand. But it didn't include many fighting or action scenes as I would have liked and as most people would probably expect from a super hero movie.",
      "total_reactions": 2,
      "user": "TigrisVsLeo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "Best X-men Movie Ever. It has everything. Just watch it. Great characters and the most intriguing plot. One of the best films of this year and surely the best Marvel film. Watch it !",
      "total_reactions": 2,
      "user": "lucasdante02"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "Best x-men movie so far. I was worried about there being so many x-men but it worked. The action scenes were great and the story line was pretty decent too.",
      "total_reactions": 2,
      "user": "aixiya"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "Here's an equation every director should remember: too much talking = boredom. If I would compare this film to inception, then I would rather watch inception, because inception provided a great balance between the action and dialogue. Don't get me wrong, the actors were fantastic. The story idea was great, and I understand that time traveling called for a lot of talking to keep the audience aware of what is going on. However, there was A LOT of potential for some great action to take place in between the talking, whereas the x-men failed to deliver. After watching it, I can't believe rottentomatoes has a 91% rating on it. I would rank Cap. Am. Winter soldier way better than this film, whereas amazing spidey 2 would be the only major superhero flick so far this year, to be worse than x-men.",
      "total_reactions": 2,
      "user": "jbravo"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "The movie was great. It was a pleasure to watch it. The cast is amazing and the plot is original and exciting.  The two  hours were absolutely entertaining.",
      "total_reactions": 2,
      "user": "Mithril"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "I am a big fan of superhero movies, but even i can admit that the market is getting very crowded, nonetheless this does not halt my anticipation for each super-powered movie that comes out. This movie once again heads back in time to see Michael Fassbender and James McAvoy take the helm once again as the feuding main duo in a drama filled performance that will leave you feeling for each character and their own internal struggles. I feel this X-Men film is the best so far, with a good balance of action and story to keep it from becoming the bore fest it easily could have been, my only real criticism is that we didn't get much development, if any at all from the future characters themselves, but in fairness that was not the point in this film. It is very enjoyable and a must see for fans of superhero movies and also has enough story and heart to interest those who are not a fan of the genre.",
      "total_reactions": 2,
      "user": "Filmwatcher123"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "Great story line and developed nicely. Maybe a little dragging but still the best story line of any X-Men movie so far. And as all of my family and friends and family have stated QUICKSILVER is worth the price of admission! Go see it!",
      "total_reactions": 2,
      "user": "kdhPLS4709"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2014
      },
      "score": 6,
      "text": "\"Days of the Future Past\" has the same old humans vs. mutants plot that pretty much all the \"X-Men\" movies have and that's a bit tedious. However, this film does have some interesting things going on in its conclusion, so maybe the next \"X-Men\" movie has a different story to tell.",
      "total_reactions": 2,
      "user": "Apartment64"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2014
      },
      "score": 5,
      "text": "I'm very sure, the first moment after I went out from the cinema, I enjoyed it. But, when people asked me how's the movie, I said, 'I'm not satisfied. What I expected was many actions from many x-men, not few x-men and few actions.' So, it's very sad.",
      "total_reactions": 2,
      "user": "RoraEst"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "Very good movie, Quicksilver ... is the coolest of this movie , My favorite X-Men movies are",
      "total_reactions": 2,
      "user": "Lena18"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "Insane variety of super interesting characters combined with well written story and you have one of the best comic book movie ever created! It's almost a perfect action movie with some week elements that wont bring it down",
      "total_reactions": 2,
      "user": "PeteStaiv"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "Despite its weak human villain (Trask), this move is complex, quickly paced & fun and X-Men: Days of Future Past ranks amongst the best of the X-Men franchise.",
      "total_reactions": 2,
      "user": "vikesh2206"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2014
      },
      "score": 3,
      "text": "Maybe because I was such a fan of the X-men as a kid, that a couple of the first bunch of X-men related movies entertained me.  I thought the first one was pretty well made, but as is usually the case, the ensuing sequels and spinoffs were all down hill from there.  Talk about a comic book movie taking itself so seriously!  So much brooding, despair, hopelessness and misery in this one!  Some more mutants who's powers seem to be mostly just looking weird?  Evolved?  This movie is worth the look for the 15 - 20% of the footage centered around action sequences and some new mutant power show offs.  Take that away and it is your basic soulless blockbuster series annuity.  Especially for the actors...lot's of them came back to life to collect residual income promised to them in Xmen;Days of past contract shortfalls.  I was actually hoping the sentinels finished off all the mutants for good...to spare homo sapiens another movie!  Fell asleep for a short portion, so I can't be sure, but it seemed like the sentinels delivered some of the most compelling lines of the whole script.",
      "total_reactions": 2,
      "user": "pedvie"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "I originally wanted to see this in the theater but never found the time to. I am glad I missed it. The X-Men series has become tragically awful, considering the great potential of the stories. Days of Future Past takes one of my favorite X-Men stories and distills it into farce.",
      "total_reactions": 2,
      "user": "phishyphishy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 3,
        "year": 2015
      },
      "score": 10,
      "text": "Bryan Singer returns in the director's chair for 'X-Men: Days of Future Past', and boy does his amazing talent show. This has got to be one of the best \"X-Men\" movies I have seen since 'X2: X-Men United' (2003).",
      "total_reactions": 2,
      "user": "MrMovieBuff"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "INTENSE ! !   2 minutes into the movie the action starts. I must warn you, dont blink or you might miss something. You really have to stay focused because there is a lot to take in. Time travel is a little bit hard to follow but the point is made clear. Besides that, WOW, Jennifer Lawrence is amazing along with the rest of the cast. Did I mention Jennifer Lawrence....lol  smoking hot when she transforms into a blue skin tight mutant is something to see. This weekend will be a busy one at the theatres. Block Buster for sure. I went to the Great Escape at the Harrisburg East Mall on the east shore. The east shore people for the most part dont know when to shut there FAT LIPS UP. On two occasions I had to stand up and tell a group of east shore people to shut the heck up, people are here to watch a movie, not to hear your fat lips flapping in the wind. I got clapped at for the one to have the balls to tell them to shut up. Then security came in and all was cool. And please you fat girls with cellulite, dont wear skin tight shorts or spandex, It makes people want to vomit, look in the mirror before you go out in public. The Regal Harrisburg 14 off of Progress Ave. and Caughey Drive is a great theater also but dont draw in the Harrisburg City crowd for the most part. I went to the midnite showing hoping the theater wouldn't have many people in it since it was Thursday night and I wouldn't have to deal with the type of people that show up at The Great Escape in the Harrisburg East Mall, which is a Regal theater also. But It had a good bit of people in it anyway. I still enjoyed the movie after the Security Guards came in. Yes, Security Guards to keep the A Holes in check. Go see this flick, you won't regret it. I love The Great Escape but not the near by people that show up on drugs and are disrespectful. Stay to the very very very end even when the lights come on and see if you can make sense of a 60 second clip. That one I can't figure out. If you can, please let me know. It was cool,  just made everyone scratch there heads, LOL....Hope you enjoy the movie as much as I did. Just ask management to pop in once and a while to tell the rude people to shut up or leave. If you experience the same issue I did. The Great Escape is 1 of 2 of my favorite movie theaters. They have a great staff. I live 5 minutes away from Camp Hill Cinama Center but drive 20 minutes to the Great Escape because number 1 as I stated the staff is great and number 2 the chairs are cosy and just has a great atmosphere not to mention the sound is great. Dont get me wrong, your not always going to have to deal with the A Holes like I did tonite, but if you do just get a staff member to come in and put them in there place or the best thing to do is ask  management or security staff to check in once in awhile, that way you dont miss any of the movie with your hard earned cash. If you were wondering what other theater is in my top 2 best theater list, It is The Regal off Progress Ave. and Caughey Drive as I mentioned in this review.",
      "total_reactions": 13,
      "user": "bigfoot6463"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "If you liked the other X-men movies, you will definitely like this one. It was a bit darker tone then the others. But good story, good character progression and good action. It did focus more on Xavier and Mystique. But in a good way. No spoilers, but the end credit scene was nothing really special and you have to wait until the very end of the credits to see it.",
      "total_reactions": 13,
      "user": "JPG127"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "Probably one of the most high-concept superhero films of recent years, Days Of Future Past is an exhilarating ride from start to finish. The innovative use of each mutant's powers make some of the action sequences utterly unique (the use of portals is particularly effective). There is a bit of an Inception feel to parts of the film flicking back between the past and the future. This is no criticism as far as I'm concerned. Even the 3D is pretty good, though not necessary.",
      "total_reactions": 11,
      "user": "Tremor2005"
    },
    {
      "neg_reactions": 8,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2014
      },
      "score": 3,
      "text": "This movie is just awful. I do not know why these directors keep making Wolverine the protagonist. I am sick of him already. The directors have so many other X-Men but Wolverine is the most popular and he is a cash cow. I guess it kind of makes sense with the plot in this one but still. He is bland and he hardly even fights. Mystique is alright in the film. She is basically there so Wolverine has something to do but it gets the job done. Magneto is complicated because you cannot tell what he is going to do. In one scene he is about to kill Mystique before she tries to kill the creator of the Sentinels but then later he tries to send a message to the world by trying to kill the very same person she was trying to kill. The best part of the movie is Quicksilver but he gets used for one or two scenes then the movie just drops him like his powers cannot help them in some other way, for instance, I don't know, finding Mystique! Also, Quicksilver mentions that his mom went out with a man who could control metal but then the subject never gets brought up again. I mean, come on! Why bring it up if you're not going to use it? Basically, mutants are being hunted, Wolverine is the only one who can save the day by going back in time and rounding up Charles and Magneto to team up but of course it is not going to be easy, even though Wolverine says that future is doomed if they don't work together. Magneto tries to do it his way because of angst and Charles is still upset that he took his girlfriend away. Big deal. There is also way too much talking and not enough action. Don't let the beginning of the movie fool you. There isn't going to be more action until near the end. I know that they are trying to set up the plot and go into some detail but jeez. I thought that Wolverine was going to do his taxes at some point. But I will say that Wolverine can hold his breath under water a really long time. And his body sure is tough enough to break metal right off even though it is pierced around his whole body...and well you get the idea. Maybe it is because it's a dream to him that it doesn't really affect him. Maybe... Also, I do not like how, at the end, Bryan Singer (The Director) basically says **** you to the first three X-Men movies and brought everyone back to life setting the movie up perfectly for a sequel. I guess Magneto isn't the main antagonist anymore? Or the fact that the future never happening maybe means that Magneto and Charles never get along. I don't know. That's up to the director of the next movie to decide. Wait, can't Charles just mind warp those future images into Magneto so that he remembers they are friends now? Oh well. Find out next week for the not so thrilling (not) conclusion!",
      "total_reactions": 14,
      "user": "Walt_Highwater"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "X-Men Days of Future Past is a miracle movie. It rectifies all the mishaps of the past installments, that includes Last Stand, and cleans it up in one swoop.  By having so many characters, you would have though that they will completely lost the plot, and suffered the same fate as many other franchise entries. But by focusing on the characters, Singer has made his best film since X-2.  Its a sequel and a reboot, mixed in together. One of the very best comic book film.",
      "total_reactions": 7,
      "user": "dharma"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "This is the best X-Men movie so far, the story is great, the cast is incredible, the action scenes are amazing. This movie exceeded my expectations and I'm sure it will surprise you from the beginning to the end.",
      "total_reactions": 7,
      "user": "denzilchristian"
    },
    {
      "neg_reactions": 7,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "So far this year has given us great super hero films. Until this point, Captain America: The Winter Soldier was my personal favorite of this year. But \"X-Men: Days of Future Past\" surprised takes that place. This easily has become one of the best super hero movies ever made. Simply speaking it is a beautifully crafted tale about hope that is supported until the end with deep and convincing characters, great interactions between them, engaging action scenes, strong themes and a time travel story that works. For every super hero fan, this is a much watch!",
      "total_reactions": 12,
      "user": "HomeCritic"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "The Best X-MEN Movie !!!",
      "total_reactions": 10,
      "user": "GustavoTalaini"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "I haven't had this much fun with a superhero movie since The Avengers. This movie is fantastic. The story was great and cohesive, the characters were well acted and awesome, the action was amazing and the ending of this movie is badass. To those who read comics, the post credit scene will be awesome for you guys to see. I highly reccomend X-Men Days Of Future Past.",
      "total_reactions": 10,
      "user": "guitarguy001"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "XM:DoFP is wonderful. It's not quite the story you remember from the comic books in the 80's, but the basic plot is there. Bolivar Trask has created a series of military robots known as the Sentinels, whose sole purpose is to hunt down and kill the mutant threat. Unfortunately, the Sentinels figure out that the threat is larger than that, and end up destroying all of human civilization. Wolverine must go back in time to stop the event that leads to the initial government funding of the Sentinels program.",
      "total_reactions": 5,
      "user": "cajun67"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2014
      },
      "score": 5,
      "text": "There are some pretty bad cinematography in this film, akin to low budget thai horror movie - you will know which scene i am refering to if you watch this film.",
      "total_reactions": 5,
      "user": "Mercent"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "Pretty much the best X-Men movie by far. The story is great, the connection between old and young x-men is decent. The cast is outstanding. The action scenes are awesome. Do not hesitate to go to the cinema and watch a 3D version. It is worth it!",
      "total_reactions": 8,
      "user": "StaticSpine"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "Wow, all my monies spend on watching previous X-Men and Wolverine movies have been erased with Days Of Future Past. Quicksilver was the best and I didn't miss the post-credit scene introducing Apocalypse.",
      "total_reactions": 8,
      "user": "franissavio"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2014
      },
      "score": 6,
      "text": "I thought this film was hugely overrated. After The Winter Solder I was really looking forward to this movie, but it really didn't deliver for me. For an action movie it was lacking a lot of action and the story didn't really hold my attention. I've seen a LOT of superhero films and I think the genre is getting stale, The Winter Solder was brilliant but this is just another superhero film that doesn't add anything to the tired genre. Edge of Tomorrow is a MUCH better film, I would recommend that ahead of this.",
      "total_reactions": 3,
      "user": "djnicey"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "I really like it. I was in my seat and the next thing you know it was over. My thoughts are, does this make all the other movies now obsolete? Does the time traveling that got us to this point now moot? I loved it either way and am glad that Jean and the Professor are back from the dead.",
      "total_reactions": 3,
      "user": "manwe7"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "Damn. This was disappointing. Lets just start off by saying this is a good movie, but not the fantastic film that I was led to believe by all the positive reviews. There are things that I loved, things that I hated, and things I found mind-boggling.",
      "total_reactions": 3,
      "user": "jlplatten"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "Most of the cast from First class returns 10 years later...This is the best part of the movie...",
      "total_reactions": 3,
      "user": "Gamer84"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "Probably the best X-men movie to date. If you're not really into the whole Marvel Universe, you might not get as much out of the movie as the really fans, because you'll be missing stuff. Good action, impressive CGI, if you're into Marvel, you shouldn't miss this movie.",
      "total_reactions": 3,
      "user": "JoeCool"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2014
      },
      "score": 6,
      "text": "This was so-so. One problem is that there are too many X-Men for any of them to receive anything but the most simplified broad brush backstory, so none of them feel like real people, so you don't really care that much what happens to them. One highlight is that the guy playing the role of Nixon was great, almost uncanny. Mystiques's makeup is not as good in the original X-Men. It looks much less natural and fake;  the filmmakers also seem too shy to show Mystique for more than a split second at a time. Also, now that we know there is a method for going back in time whenever it is convenient, all future drama (if there are more movies) is wiped out, because if someone dies, if anything else goes wrong, they can just send Wolverine back in time to fix it. Overall, a mildly disappointing entry.",
      "total_reactions": 3,
      "user": "NikolayG"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "BEST X-MEN FILM EVER MADE-, IN ALL WAY-THIS X MEN FILM ROCKED IT- IT HAS GOOD STORY,AWESOME ACTIONS N VISUAL EFFECTS,HUGE TALENTED CAST LIKE MY FAVORITE Hugh Jackman﻿ N Jennifer Lawrence﻿ - EVERYBODY DONE A GOOD STYLE WORK- I REALLY CLAPPED SO MUCH FOR QUICK SILVER- HE IS FASCINATING -",
      "total_reactions": 3,
      "user": "joyal"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "This is definitely one of the or maybe even the best X-Men movie in the franchise.It has everything a fan wants from an X-Men movie.Developed characters,good action scenes and tons of easter eggs from the other movies but my problem with this movie is that at the end it kind of slowed down and the action sequences were made well but they just werent exciting.Also I think Jennifer Lawrence was miscasted as Mystique.I personally liked Rebecca Romijn more.Also the editing during the fight in Paris was horrible and made me rage because instead of focusing more on the action in a normal 16:9 format Brian Singer wanted to make it feel real with the 1970 4:3 format bullsh*t.",
      "total_reactions": 3,
      "user": "Pazzo7"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2014
      },
      "score": 8,
      "text": "Bryan Singer sabe como hacer cine de buen entretenimiento, no se necesita de suecuencia de accion desenfrenada para contar una historia maravillosa pero que peca de alguno que otro agujero, las interpetraciones son soberbias, escenas bien rodadas como el escape del pentagono, sin duda mi favorita de la saga de los mutantes.",
      "total_reactions": 3,
      "user": "carloswalnuts"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2014
      },
      "score": 9,
      "text": "As someone who actually read the comic, I was a little pessimist about this film after I watched the trailers, but I was wrong. Maybe it doesn't follow the comic step by step, maybe it has some flaws, maybe they don't explain everything (like Kitty having Rachel's powers) I think it deserves an 8 but since I consider it the best X-men movie and erases the HORRIBLE mistakes done on \"The Last Stand\" I'll give it a +1. This is not another film where Wolverine is the main character in a Xmen movie, as we have seen in  X1, X2 (Which I like, both) and The Last Stand (Which I dislike... a lot) each character has their own magic in the time they appear, except maybe Storm who was a little absent in the film, but it probably was because of Berry's pregnancy.",
      "total_reactions": 3,
      "user": "ThePopCulturist"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 6,
        "year": 2014
      },
      "score": 2,
      "text": "I like Jennifer Lawrence, but as Mystique? Nay. Rebecca Romijn will always be Mystique. As for the rest of the movie, while it had some sweet spots, I felt the plot was convoluted and a fair bit unrealistic...even for a film based upon comic heroes.",
      "total_reactions": 3,
      "user": "MarcEsadrian"
    },
    {
      "neg_reactions": 17,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 4,
      "text": "I will preface this by saying i grew up watching the x-men on Saturdays in the 90s they were my favorite super heros. I liked pretty much all previous x men films except the 2nd Wolverine which was horrendous.  Days of future past is a  terrible movie. They are touting this as the best super hero movie ever  don't believe the hype!! Yes it has all the xmen in it but they dont do much at all. This feels more like a 3rd Wolverine movie with cameos by the x men. Quicksilver was great there is a great action sequence with him but he is used once then forgot about. This tries to be first class 2 Wolverine 3 and xmen 4 all in one and turns out to be a convoluted mess. With way too much dialog and not enough action. Save ur money and red box it",
      "total_reactions": 25,
      "user": "Tha_Lowkey_One"
    },
    {
      "neg_reactions": 10,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 5,
      "text": "This movie is average at best, the first problem that I noticed was lack of consistency with all the other x men movies, SPOILERS: theres no explanation a to why the sentinels werent mentioned before, why is the war detonated in the past since last stand had its \"war\" with no mention of a weapon like the sentinels against the mutants, next is the acting, what the hell happened to Michael Fassbender? Was he forced to act at gunpoint or what? He was lifeless.... the setpieces at times awesome, mostly involves the killing of some random mutant that we dont care about so there is that, next is the boring pace, the only redeeming thing is quicksilver and hes not around for long, what a shame... boring at times, bad acting, inconsistency, not as epic as avengers or man of steel and definitely not a thoughtful as captain america, it was really a let down for me despite the well intentioned fan service (Wolverine v Magneto) Hope this franchise returns to Marvel for theaters...",
      "total_reactions": 14,
      "user": "Sovereign"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2014
      },
      "score": 3,
      "text": "First of all i like all superhero movies and this is not different but i have to say this one is almost actionless like the wolverine. Two hours of talking is not what we expect from a  x-men movie, right ? Sentinels are boosted too much that the destroyer is a kitten compared to them, i remember sentinels as huge silly robots from the animated series which i was a big fan of when i was much younger not like these invincible m...f... Seeing x-men were no match for them and die in pathetic ways was really annoying. As always they didn't use storm as they should, she is a f... demigod and i hate to see her so fragile all the time. And of course we saw rogue for ten seconds, she is one of my favorites i don't get why can't we see her flying and kicking ass. I always want longer movies but can't get enough thrill even in a 2 hours of \"action\" , i hope producers will do more to fill entire movies in the future because this franchise doesn't seem to make progress anymore.",
      "total_reactions": 7,
      "user": "kaanozal"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "ehhhh, see it if you must.  i loved the first half of \"The Wolverine\", and enjoyed \"First Class\" enough to buy it.  This one is better than Wolverine, but worse than First Class.  It's entertaining for a while, but drags in the second half (like a lot of these comic book movies).  I think this movie might be better at home, sitting on your couch.  seriously.",
      "total_reactions": 4,
      "user": "CalvinCrack"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "simply put...the best most refreshing entry to the series. Fixes many plot holes from previous entries and puts the movie franchise in a better future. I think it's the movie of the half year...lets see where the other half takes us....if i were a betting man, I can place my money that this film will be the one beat.",
      "total_reactions": 4,
      "user": "victimblue"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "best X-MEN movie so far, and gets the hype for mutant apocalypse on the rails!! the most amazing thing about DOFP is that eliminate the whole mess that the last stand bring over the X-MEN movie universe",
      "total_reactions": 4,
      "user": "juantonio86"
    },
    {
      "neg_reactions": 26,
      "pos_reactions": 8,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2014
      },
      "score": 0,
      "text": "terrible terrible terrible terrible terrible terrible terrible terrible terrible terrible terrible terrible terrible terrible terrible terrible terrible",
      "total_reactions": 34,
      "user": "efk241"
    },
    {
      "neg_reactions": 47,
      "pos_reactions": 12,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 2,
      "text": "Don't understand all the praise for this dull, almost lifeless film. It gets a 2 from me because of an awesome sequence involving a mutant(Quicksilver) with super speed. It seems all the thought and energy were put into this scene, and it does pay off 200%. All the other actors seem to be showing up to pick up a paycheck, and moving along as fast as possible. I love Jennifer Lawrence, but she even seems to be going through the paces. What a disappointment :(",
      "total_reactions": 59,
      "user": "JohnnyC"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 10,
      "text": "oooooo la wea buena ctmmmmmm la cago qe me moje con la  wea nunca habia visto una wea tan buena pero tampoco tanto porqe la wea esqe me pica el pico xd",
      "total_reactions": 5,
      "user": "ROBERTOO"
    },
    {
      "neg_reactions": 5,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 8,
      "text": "A pretty good movie. Not exactly what I was hoping for as a follower of the X-Men lore, but it does what it tries to pretty well. And you don't need much knowledge of the previous movies to enjoy it.  The use of the Sentinels was kinda disappointing, but I was okay with that considering they weren't the main focus of the movie anyway, and they could have done much worse with the lore.",
      "total_reactions": 6,
      "user": "Rtheom"
    },
    {
      "neg_reactions": 52,
      "pos_reactions": 10,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 2,
      "text": "When does a ‘special effect’ stop being special? The first time Jennifer Lawrence as a blue lady, “X-MEN: DAY OF FUTURE PAST”,  turns into a male soldier it is a special effect and then when she turns into a beautiful woman it is special but the twentieth time she morphs into another person it isn’t special anymore.",
      "total_reactions": 62,
      "user": "GreatMartin"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2014
      },
      "score": 2,
      "text": "I'm at a total loss for the great reviews this film has received. Maybe I lack understanding as I never got into comic books. I did however enjoy X-Men and especially X2, but since then the ride has gotten a little bumpy. X3 was OK as was Origins. I quite liked First Class, but The Wolverine and Days Of Future Past have gone a long way towards sinking this franchise. I'm thinking if you agree with what I've said so far, you're more than likely to agree with what's to come.",
      "total_reactions": 7,
      "user": "Zingee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "X-Men: DOFP is an all around great movie. It successfully caters to both hardcore X-Men fans and casual moviegoers. In other words, you don't have to be an X-Men nerd to enjoy this film. Its more subdued than it's predecessors, you won't feel smothered by the special effects. Definitely worth watching!",
      "total_reactions": 1,
      "user": "LBC"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2014
      },
      "score": 6,
      "text": "This movie is great but there are a lot of problems with it. The story, cast and characters are all solid and the action sequences are really cool to watch. It grabs your attention from the moment it starts and keeps pulling you in as the plot progresses while at the same time developing and adding layers to characters we already know and giving intriguing introductions to some new ones for the next film. It looks great, it's acted brilliantly and is well directed. So why am I only giving it a 6? Four reasons:",
      "total_reactions": 3,
      "user": "LJHayes"
    },
    {
      "neg_reactions": 11,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2014
      },
      "score": 2,
      "text": "I also fell asleep during this movie.  It kept me entertained for about 10 minutes, but the rest was confusing and boring.  I don't recommend this movie.",
      "total_reactions": 11,
      "user": "EFYevan"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "Day of Future Past is a fantastic superhero movie in every way, shape and form... except for the gaping flaw that is its premise. Don't get me wrong, I understand that one must suspend their level of disbelief greatly in order to enjoy these films. Newsflash, I love superhero movies so clearly the suspension of disbelief isn't the issue. There is a difference between being willing to accept something as possible and there being a monumental plot hole, which was the case with this film.",
      "total_reactions": 1,
      "user": "Bruce722"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "After Matthew Vaughn’s X-MEN: FIRST CLASS (2011, 7/10) transposes the mutants’ universe into 1960s and allows some new blood to play their younger selves, X-MEN series has officially opened a new chapter. Three years later, the original helmer (X-MEN 2000, 7/10 and X2 2003, 7/10) Bryan Singer returns to the director chair to push a reset button to nullify all the damages done by Brett Ratner’s X-MEN: THE LAST STAND (2006, 7/10). In this latest episode, the story devises a time-travel mission to the past in order to save the entire world from the Sentinel apocalypse.",
      "total_reactions": 3,
      "user": "lasttimeisaw"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 4,
        "year": 2015
      },
      "score": 1,
      "text": "This is one of the dumbest movies I have ever seen. Everything about this movie falls flat, starting with the atrocious \"plot.\" Think of the worst sci-fi plot, and dumb it down more, and even that would probably work better than this story. The X-Men comic has had some pretty great writing over the years, but this movie ignores all of it. No character is true to the comics. There is no character growth. There is no human drama. There is no real dramatic structure. The dialogue sounds like it was written by a huge committee, thus it has no style or real content. All it has are lots and lots of effects. Lots. Really. But in the end, effects don't make a good movie, just a spectacle.",
      "total_reactions": 1,
      "user": "jigme"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "Movie inline with comic books and writers have finally fixed the damage done by X men last stand and last horrible wolverine movie.3D effects and acting and story is great.Can't wait to see the X men apocalypse movie.",
      "total_reactions": 2,
      "user": "Smee"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "This is the best X-Men movie so far. Hovewer, I cant put 10 mark on this. When the next sequel starts to use future-past travels that usually mean plot authors are out of ideas. I believe this is the last X-Men movie, if only they don't want to make next future-past movie what is even more stupid. Despite this fact movie itself is awesome. Great characters, great acting, definitely worth watching.",
      "total_reactions": 1,
      "user": "Violett"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2015
      },
      "score": 5,
      "text": "I was rather disappointed, I don't get where all of the hype is coming from. The plot was weak, I never really understood what was going on at points. The characters were underdeveloped, the action scenes were just lame and boring. Not even X-men can save the day with himself not being a part of anything in this movie, it's a mess. The whole time travel thing was just confusing and dumb, I was expecting a lot more out of the movie. When the credits started rolling, I was like\"that's it?\" Wow.",
      "total_reactions": 1,
      "user": "Gerrit210"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "I felt that for a superhero movie movie it took it's pace very slowly, although i dont think thats a bad thing. There are too many movies that i feel are ACTION, EXPLOSIONS, AND OMG, etc. But this movie is something thats trying to be a different, so it was a nice step outside the box for this movie, even though it wasnt far outside said box. It still felt like a breath of fresh air.",
      "total_reactions": 1,
      "user": "JOSHDILISI"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "A great movie. Although I don't like X-men franchise, which i always consider inferior to Sam Raimi's \"spider-man trilogy\", Days of Future Past absolutely satisfied me as a fantasy, action blockbuster and didn't make me regret having spent my money on buying ticket. Two worlds - one in the future and one in the past  collide as two parallel wars break out determining the fate of mutants. The film remained funny though, especially in the first half when Quick Silver attempted to help Magneto break out of prison.",
      "total_reactions": 3,
      "user": "PvtJackson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "It is clear that the X-Men Film Series took a downward spiral after Bryan Singer left the director’s chair for similar, yet less successful, endeavors. It wasn't until 2011 that Matthew Vaughn sparked some new life into the series, by telling a rousing origin story that almost felt like a reboot to the franchise. Re-enter Singer, who brings the best of both his films and Vaughn’s “X-Men: First Class” by; combining the dark, seedy plotting of his first two movies with energized period stylings of \"First Class\". All this is achieved, while blending the fantastic cast of both films via an inventive time traveling plot that surprisingly works on all levels. Based on the comic book story-line of the same name; Wolverine is sent to the past by Kitty Pride (since when could she do that) in an attempt to change history and prevent an event that results in the Sentinel program; a program that dooms both humans and mutants. Little (and sometimes noticeable) characterizations that contradicts the previous films does bother the geek inside me, and I’m sure many can agree; but I’m willing to forgive and forget this time around. By incorporating socio-political topics (typical of X-Men) with an intriguing sci-fi premise \"Days of Future Past\" does far more than just entertain. But what I liked most was the balance of characters on display and the performances behind them. Whether it’s James McAvoy’s world-weary younger Xavier, Michael Fassbender’s morally disturbed younger Magneto or their introspective older selves (Patrick Stewart and Ian McKellen, respectively); the cast members bask in whatever limelight the film affords them. Though I’m still not convinced of Jennifer Lawrence’s rendition of Mystique, I appreciate what the writers were doing with character’s arc. “Days of Future” is fast, smart; most of our characters are well developed and effectively reintroduced; even lesser characters get their fleeting moments to shine. The sparing action sequences were well staged; and one thing I always admired about Singer was his way of defining the characters' abilities through elaborately staged set pieces. Kudos to that Quicksilver slow-mo scene. The dystopian future and vintage period setting was brought to life by nice production designs and the visual effects dazzle unlike any other X-Men film. It’s up there as one of the finest X-Men films (second only to “X2: X-Men United”) and certainly one of the better superhero films in recent times. Entertainment is guaranteed!",
      "total_reactions": 1,
      "user": "Prodigy2014"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "The movie has a gripping story with enchanting visual effects. However, the story is quite convoluted, moving back and forth from the past and future. Still, it was a good piece of work that made the entire series more understandable.",
      "total_reactions": 1,
      "user": "Hoonsago"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "It is a movie packed with action and a little gruesome killings by the Sentinel. The graphics and the action seemed fresh, especially Blink with \"portal gun\" powers. The storyline and the plot ideas almost always keep you at grip. Love to see the composed and the responsible Professor as a drunkard for the first time. Young Magneto's character description, just like in all X-Men movies, was perfect. Needless to say, Quicksilver, even in a short role was the best!",
      "total_reactions": 4,
      "user": "sancharsharma"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 5,
        "year": 2014
      },
      "score": 7,
      "text": "I like the X-Men, and hate time travel movies.  Time travel was not an issue until the end.  Because the antagonist is not a living thing, there is not a sense of defeating the enemy, which always gives me happiness.  Quicksilver is a great comedic relief.  Everything was performed and CGI'd very well.",
      "total_reactions": 1,
      "user": "argalite"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2014
      },
      "score": 6,
      "text": "The months leading up to X-Men Days of Futures Past all I could say was that it looked like garbage. At one point, sometime after the atrocious Carl’s Jr. commercials, I assumed it would be somewhere around Spider-Man 3. There were a lot of reasons I felt so strongly about it, mainly that I feel the old cast should have been liquidated and re-casted. The trailers all made the movie appear to be unwatchable, but I was pleasantly surprised.",
      "total_reactions": 2,
      "user": "xShaunaOH"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "Definitely the BEST X-men movie put out so far! After the first 30-45 minutes of the movie i found myself rubbing my eyes, yawning and looking at my watch often. I swear I must 1 of 3 Black guys who think Halle Berry is the worst Storm ever. I mean damn the only thing the got right with Halle Berry playing Storm is that she is Black! I actually cheered when the Sentinels killed her. Its not too many things I can point that is wrong with this movie other than...1. Quicksilver looked corny as hell (but he was pretty dope) 2. Bishop was undersold. 3. The Sentinels didn't say anything...(in the comics and on the show they always said mutant detected) 4. THe Sentinels looked like the Destroyer from the first Thor movie. 5. Where the HELL was Scarlet  Witch (maybe they are saving her for the Avengers 3 movie where they will have Scarlet Witch and Quicksilver join the Avengers). There are more things i find wrong with this movie but I guess by now you get the point! Days of Future Past was by far the best X-men movie but I sincerely hope Fox gives up the rights to X-men or better yet at least collaborate with Marvel Studios on the next X-men movie, seeing as how the Movie will more than likely have Apocalypse (X-men The Age of Apocalypse) which might introduce Archangel. Somewhere along the along the lines I got side tracked...oh well back to Days of future past! Like I said before X-men Days of Future Past was not a horrible movie but damn it was not great neither.",
      "total_reactions": 1,
      "user": "SuperNintendro"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "I get those who prefer to say this movie was not perfect or lacked something, but the truth is Hollywood never putted its hands on a such rich and wide story. I mean, of course for this X-Men movie, with time travel it is to expect more. More encounters, more dilemmas about the quantum physics involved, I was expecting all that plus a more spread  participation between the characters. The elements are all there but, the thing is, maybe this time, as usually happens the plot was managed by suits, re-managed  by the suits bosses and so on. It is not a masterpiece, could be in the hand of a Kubrick, - any other name here would be a blasphemy but... - a Spielberg, a Zemeckis. I'd love to see, for one time some risk being taken. But, I guess Bryan Singer is the only guy not up to risks at this point. It's a shame, the story sure should be better explored.",
      "total_reactions": 1,
      "user": "lucianogeneroso"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2015
      },
      "score": 10,
      "text": "An incredible, outstanding, breathtaking sequel to X-men First Class! Bryan Singer has returned to the helm as director, and has used his director \"powers\" to make X-men 3 irrelevant and X-men Origins: The Wolverine all but a bad dream! This movie is pact with awesome action, incredible characters, crazy humor, and it did a great job bringing the Sentinels to life! A great way to set up the sequel X-men Apocalypse.",
      "total_reactions": 2,
      "user": "jacob4"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2014
      },
      "score": 6,
      "text": "Much like the other Marvel movies of the past 5 years - Quite entertaining, quite forgettable.  It's a good one to just kick back and relax and enjoy the ride.  As most time travel movies (yes, this movie's got a little bit of that) you have to suspend disbelief because if you think about it too long it won't make sense I promise.",
      "total_reactions": 2,
      "user": "adamjones"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "I'm a huge X-Men fan, and this movie had a lot of awesome mutants!  It was centered around Wolverine, but in terms of storyline was more about Magneto, Mystique, and Charles.  The best part of this movie was the scenes with Quicksilver.  I've never really seen a good depiction of a super speed character in a superhero movie, but this hit it on the spot.  The slow motion was used great in this movie, and all the effects were great!  The plot was good as well.  This movie was fantastic, and it was my second favorite X-Men movie, but it had some downfalls.  This movie had a lot of plot holes like Professor X being alive, Kitty's time traveling, and a bit more.  Those knocked it down from 9 to 8, but it still was crazy fun!",
      "total_reactions": 1,
      "user": "boesball"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "I never cared for the first three X-Men movies, in fact I think X-Men 2 is one of the most overrated movies ever. I did enjoy First Class, and it's follow up Days of Future past I found myself delighted with the plot and characters. This movie is proof that you don't need large and constant action sequences to make a powerful super hero film. The writing in this movie in fantastic, and the acting it's truly great. No surprise based on the all-star cast.",
      "total_reactions": 1,
      "user": "Rainwhole"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 11,
        "year": 2014
      },
      "score": 10,
      "text": "\"X-Men: Days of Future Past\" 10 Scale Rating: 9.5 (Epic) ...",
      "total_reactions": 2,
      "user": "DCEdmonds"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 11,
        "year": 2014
      },
      "score": 9,
      "text": "The greatest X-Men movie put to film. This is the most entertaining, enthralling and emotionally wrenching this franchise has ever out out. Easily one of the best films of the year and one of the best casts of the year. Not gonna lie, this movie had me tearing up at one point.",
      "total_reactions": 1,
      "user": "Movi3R3vi3wer"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2015
      },
      "score": 9,
      "text": "Grande filme, fecha a série de filmes anteriores dos X-Men e continua a nova série de filmes que se deu inicio com X-Men: First Class de 2011. Recomendo!!",
      "total_reactions": 1,
      "user": "BlaKDemonaZ"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 9,
      "text": "Bryan Singer is back and made an X-Men film that suprasses all that came before it. The action is exciting, the drama is emotional, the humor is gut-busting, the visuals are stunning; this is a superhero film that is definitely not worth missing.",
      "total_reactions": 1,
      "user": "WheelzFourReelz"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 12,
        "year": 2015
      },
      "score": 3,
      "text": "This review is being written in the past. You may end up reading this in 20 years. Hopefully, not because X-Men Days of Future Past is considered a classic but because humor never dies. Where to begin to talk about this movie is the question. Have you seen X-Men before? It’s all the same right. (dodges level 5 lightning bolts from hardcore nerd fans). What makes this film different or attempts to be different is the idea that time is just….You’ve seen Back to The Future right? Combine that with the X-Men universe and you get this film. Minus Doc Brown sadly.",
      "total_reactions": 1,
      "user": "Zebunker"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "The story of \" Days of Future Past \" left a great counterpart in the future will have to change the past to the present should be safe outside the fearsome clutches of Magneto , and also for the future changed and is finished better today if they left well lit .",
      "total_reactions": 1,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 11,
        "year": 2015
      },
      "score": 9,
      "text": "This movie will allow future X-Men films to either return to the story lines, from the comics, or play on a much bigger 'multi-time-line' theme. But, that is only what makes it partially good.",
      "total_reactions": 1,
      "user": "BeingNickDoh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "The use of visual effects and action sequences is so excessive that it threatens to bring the entire film down before it even gets started.  Thankfully the cast, particularly McAvoy, Fassbender and Lawrence, do a fine job of providing an emotional core to balance things out.  The result is a satisfying, if not spectacular, popcorn flick.",
      "total_reactions": 0,
      "user": "BKM"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2014
      },
      "score": 7,
      "text": "X-Men Days of Future Past is probably the most complex X-Men film yet. There are a lot of characters, plotlines, and relationships as the film tries to continue the story from both First Class and The Last Stand while tying these together. While the film did feel like a little too much at times everything felt necessary for the story and it was all balanced well. Brian Synger returns to give us one of the better films in the franchise with fun action, an engaging story, and great characters with lots of solid relationships. Fans of the three X-Men films that are considered good (1, 2, and First Class) will enjoy this movie as it is another solid entry and the ending will make diehard fans extremely happy. It may not be the best X-Men film, best superhero film, or best of the summer but considering how this franchise was struggling five years ago it’s a miracle its been able to bounce back without completely rebooting itself. While I wish the franchise would just end on this film as the ending does provide a nice sense of closure, especially for the future storyline, they are going to continue. If this franchise is destined to go on for a while, my only hope is that it we keep the ball in the air continuing to provide fun and entertaining films for many years to come.",
      "total_reactions": 0,
      "user": "Jacob"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "In my adolescents, much like every kid in my class, and more thereafter. Ask any kid growing up in the late 90s and early 2000s, when comic book movies were just starting to become a reality. Before “The Avengers”, before “Iron Man” and yes..even before “Spider-Man”..there was only a select squad of superheroes I knew..well not superheroes..mutants. Wolverine, Magneto, Professor X, Cyclops, Mystique..just to name a few. They were called The X-Men, and not only did they inspire me as a child, after seeing their latest adventure, they have inspired me as an adult now too. The film reunites long time fan boy favorite director Bryan Singer (X-Men and X2) with the best cast of characters anyone this side of earth could ever ask for. If we put, The Avengers up against the X-Men, hands down I put my money on the X-Men any day.",
      "total_reactions": 0,
      "user": "Forrestgump1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "Great script, brought to life by very fine acting performances. It boasts many exciting action scenes (particularly the slow-mo scene + the final battle happening in the two timelines simultaneously), and these scenes are expertly executed by the very talented director Bryan Singer.",
      "total_reactions": 0,
      "user": "adhamhany"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "There is so much good in this movie.  So much great in this movie.  But I might have to go on the record saying the Evan Peters Quicksilver storyline is the best  thing in the series.  Despite those stupid Carl's Jr. commercials.",
      "total_reactions": 0,
      "user": "jdolan74"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "X-Men Days of Future Past is a superior entry in the franchise. The plot is decent and the action is pretty great too. Most importantly, it's a lot of fun to see these characters bounce off of each other again. The downside is that the future cast is severely marginalized to the point where the old Magneto has almost no lines in the entire film. But still, this is a ton of fun.",
      "total_reactions": 0,
      "user": "Tokyochuchu"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 5,
        "year": 2016
      },
      "score": 9,
      "text": "Smooth and beautiful direction, editing almost perfect, dynamic and strong characters X-Men: Days of Future Past unites two casts and returns to a grand X-Men.",
      "total_reactions": 0,
      "user": "ATsushi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 7,
        "year": 2014
      },
      "score": 7,
      "text": "Clearly  a way for the franchise to do a reset on where its universe went. The only issue now is that the actors of the original characters are all getting older so it will never be the same... regardless the movie hit all the right notes but wasn't really fantastic in any way. The sentinels didn't really remind me at all of what I remember from the cartoons.",
      "total_reactions": 0,
      "user": "theoffice"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "This movie was pretty good, not fantastic, but still good enough to make X-Men fans happy. This is arguably one of the better X-Men movies (definitely better than than the Last Stand and Origins Wolverine) but still, not the best.",
      "total_reactions": 0,
      "user": "mrmonster"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2016
      },
      "score": 8,
      "text": "From a non-X-Men know it all's part of view, Days of Future Past is still a riveting thrill ride with a really cool retro setting playing part-host to an interesting story. Add some cool characters and great action - you have another great 2014 summer blockbuster.",
      "total_reactions": 0,
      "user": "Jack97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "Quiet complicated movie for the genre it belongs to, which is always to be thankful. The acting is very good for this type of movies standards, and they mix past and future nicely. However, the emotional touch does not become that effective as it seems it is meant to be, and it is also true that it does not bring anything new to the table. Overall it has brough the X Men franchise to an unexpected forefront again. Nothing memorable though.",
      "total_reactions": 0,
      "user": "sanyrub"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2016
      },
      "score": 7,
      "text": "X-men days of future past is the follow-up to first class, and is again, a very good movie. This film is viscerally relentless in spectacular fight scenes and moments of pure speculation on our characters which weaves beautifully and brutally into the chaotic future it so holds. However, I do not prefer this one over first class. That is unprecedented in my personal opinion. The main issue being in it's subtlety. There are a few sequences which seem to pile on explanation as 'would you believe I'm from the future?' with a comedic moment. Although in some scenarios, it is well done. A moment that works especially well is the one on one with Xavier and Xavier, and from a conclusive standpoint, it works artfully well. For me, X-men days of future past is not as fantastic as First Class, and in some ways lacks. But as a symbolic resolution, this is impressively fun and presents a relevant moral message that we can all follow, and even has the guts to make it conspicuous in it's development whilst proving that there are no true lefts or rights to each character, much like mutants, we are a complex mesh. A minority, and by showing each other the right way and instead of destroying each other, a peaceful end may come.",
      "total_reactions": 0,
      "user": "TrilobiteG"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "With an actual story and some effort with acting, it's an entertaining yet thoughtful film with all the necessary twists and turns an action movie should have.",
      "total_reactions": 0,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "X-Men: DOFP is by far the best X-Men movie of them all, and X2 is a pretty hard film to beat. It blends both generations of casts together perfectly, even though the original cast has very little screen time, except for Wolverine of course. It has the perfect amount of homages to the X-Men series and weave them into uncanny action and somewhat complex detailed plot.",
      "total_reactions": 0,
      "user": "8bitParadox"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "Once again, it’s time for another superhero movie – another superhero sequel to be precise. There have been a lot of these lately, but that seems to be the way of the world. Now, counting all spin-offs and prequels, we’re on the seventh X-Men movie, with an eighth confirmed to be on the way, continuing the franchise that started it all back in 2000. We’ve even got the original director Bryan Singer back in the chair, who previously abandoned the franchise to make the quickly forgotten Superman Returns (2006).",
      "total_reactions": 0,
      "user": "Jack_Sunshine"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "Grounded with stellar acting, believable characters, and sweeping special effects, Days of Future Past is the best entry of the X-Men franchise to date.",
      "total_reactions": 0,
      "user": "sammurphy66"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2014
      },
      "score": 9,
      "text": "This is one of the few superhero movies that really gets to me. The character development and emotions they portray really reflects onto the viewers, it would be farfetched to call this a masterpiece, but it's not short of one, nor is it your stereotypical superhero action movie.",
      "total_reactions": 0,
      "user": "epicluca"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2014
      },
      "score": 8,
      "text": "I did not really like  Bryan Singer's first two X Men movies.  This one I really did.  It really wiped out all other X Men films from a time line stand point (except the first First Class), which is cool if they want to forget all the other movies and start fresh.  Fun story.  Great CGI.  Humor.  I need to watch it again.  It might go a point higher.",
      "total_reactions": 0,
      "user": "MagicManRAW"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "Easily the best X-men film thanks to its focus on story development and setting up what looks to be a total rebirth of the series. From the word go I was utterly immersed in the story, at no point was I pining for more action or story development. Considering the amount of characters involved I expected some friction and complication but at no point did any of the chars get in each others way, the synergy was perfect.",
      "total_reactions": 0,
      "user": "ukonfire"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 1,
        "year": 2015
      },
      "score": 6,
      "text": "The plot is incoherent and conventional but particular scenes really stand out. It's well paced with good characterisation and good acting. The cinematography and visual effects are satisfactory. It's a solid film but it just doesn't bring anything new to the table.",
      "total_reactions": 0,
      "user": "AkashVijay"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "Not only the best X-Men movie yet but the best Mavel movie to date and the second best superhero movie, behind The Dark Knight. Yes, it's that good. I can't wait to see X-Men: Apocalypse.",
      "total_reactions": 0,
      "user": "israeldorneles"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "\"X-Men: Days of Future Past\" is a pretty good film, but I would have liked it a lot more if the central conflict would have been different from the overused mutants vs humans. However, what I did like a lot was the rich and masterful use of cinematography which provided some of the best moments in the film. The CGI was top notch as well and I am really surprised that it wasn't made for 3D. Also, a good thing was the ending which set the stage for exiting and new story lines.",
      "total_reactions": 0,
      "user": "YewSpell8314"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "Prior to watching this: I've seen all of the past X-Men films except for X-Men Wolverine. I have not read the comics but I have seen some of the cartoons.",
      "total_reactions": 0,
      "user": "43in2014"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "I saw clawns of bones,",
      "total_reactions": 0,
      "user": "DouglasRamsey"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 6,
        "year": 2014
      },
      "score": 7,
      "text": "The Movie is Good but not good enough. I know X-Men series is great one but this time they are waisted somehow. They waisted too much money but X-Men Wolverine is Best one in Series. I hope they will not waist their money next time.",
      "total_reactions": 0,
      "user": "ababa999"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 6,
        "year": 2014
      },
      "score": 9,
      "text": "Unlike some of the superhero movies, there is genuine emotion here. Its has some good action scenes and a fun plot but in the end its about the characters and their struggle. It makes for a compelling movie.",
      "total_reactions": 0,
      "user": "douglasnotdoug"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "Great movie overall and a great way to get the main X-Men movies back on track. After the monstrocity that was X Men: The Last Stand the movies were needing a way to get back on their feet and with Bryan Singer at the helm for First Class it was a decent movie and this outshined it in every single way possible. The plot was inspired, the movie was intense and the characters you genuinely felt sorry for when they died. Probably a bit too much Hugh Jackman in this movie again but otherwise it's a great balance of the older characters and the new ones. Seeing Xavier talking to his past self was a great scene and a good example of what the movie is capable of. The last scene was touching to no end with all of the characters that had died being brought back thanks to the past being changed.",
      "total_reactions": 0,
      "user": "KasaiWolf"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2014
      },
      "score": 10,
      "text": "I remember when I watched the X-Men cartoons, everything impress me, the animation, the characters, was really awesome, and with the time appeared the movies, some with excellent results (''X-Men: First Class'', ''X-2'', ''X-Men''), and the rest with, mmm... well you know the story. Now is the time of X-Men: Days of Future Past, and the result is incredible!",
      "total_reactions": 0,
      "user": "NateNixon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "after x-men the last stand was released I hated it but after watching x-men first class it looked like director Bryan singer was attempting to repair the series after the last stand how ever days of future past was a kick ass film with a amazing cast I can see the francise going on for years to come.",
      "total_reactions": 0,
      "user": "TheDanielGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 7,
        "year": 2014
      },
      "score": 8,
      "text": "Great action movie, one of the best X-Men movies for sure, very well edited and worth watching. But... so many answers not revealed!!! How did Professor Xavier come back to life? When the hell did you acquire a mutant with abilities of traveling to the past? If we can't build a sentinel robot which dances well nowadays how could we have built one that is the most destructive force on Earth in the 70's? However, you should watch it, it's worth it.",
      "total_reactions": 0,
      "user": "Fanaro009"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2014
      },
      "score": 7,
      "text": "I have avoided any real spoilers although some basic story ideas are revealed...",
      "total_reactions": 0,
      "user": "rodsager"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2014
      },
      "score": 8,
      "text": "This is the newest X-men movie and is pretty much a setup for the next one\" X-Men:Apocalypse\" It's directed by Bryan Singer the guy who brought us the first two X-Men movies but also Superman:Returns....But push that all aside and Days of Future past is still a very entertaining movie. Hugh Jackman gets to be the star again in this movie like most of the others, but at least he's not to bad at it. It's nice to see the use of characters in this movie to, seeing they are dealing with time travel and to sets of mutants it gives them lots to work it. The story is can seem very complex at times witch is a nice change but some may get lots in the time travel and who is who.",
      "total_reactions": 0,
      "user": "ToFewViews"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 8,
        "year": 2014
      },
      "score": 10,
      "text": "Days of Future Past is not only one of the best X-Men films, it's one of the best superhero films of all time. It knows exactly what do with it's characters and how to make their actors portray them perfectly. The action is top notch and the special effects are wonderful. I was a little bit nervous for this movie learning that Matthew Vaughn dropped out as director and was replaced by Bryan Singer after Singer directed the mediocre \"Superman Returns\" and \"Jack the Giant Slayer\" but Singer absolutely nailed it. Days of Future Past is a wonderful entry into the superhero genre.",
      "total_reactions": 0,
      "user": "Prodigy487"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "Awesome movie, awesome acting and cast, awesome effects and awesome story. I missed characters like \"Vampire\", \"Jean\" and \"Scott\", they just shows up in the end for less than one minute =( but it's alright, this is my favorite movie of 2014 so far.",
      "total_reactions": 0,
      "user": "Adson"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "it's a pretty good superhero movie with some excellent performances and a well told story based on one of the best comics marvel has produced. it did have it's less than brilliant moments and the pacing could have been better but i think it's probably the best x-men movie since X2. the only reason it doesn't score higher is that a lot of elements have completely screwed the x-men movies continuity even after the damage done by first class and the wolverine movies",
      "total_reactions": 0,
      "user": "NerdConsultant"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 10,
        "year": 2014
      },
      "score": 9,
      "text": "By no means am I a fan-boy of Marvel or X-Men, but there are no words to describe this movie. This amazing story and adventure is sure to convince you there is a hope for humanity and make you want to want to kiss babies. The hype is real folks, this **** will knock you off your feet.",
      "total_reactions": 0,
      "user": "cptfox"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "People keep saying this is the best X-Men movie so far!",
      "total_reactions": 0,
      "user": "wtfskilz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2015
      },
      "score": 10,
      "text": "Marvel movies, especially X-Men movies, are nice always and this is no exception.",
      "total_reactions": 0,
      "user": "hirak99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2014
      },
      "score": 10,
      "text": "A fantastic movie that blends the future and past of X-Men into an action-packed CGI extravaganza. This is good because the effects are great in this movie. This is the perfect X-men movie and is the strongest entry in the franchise. Even if you don't like superhero movies, go see it! 10/10 (Legendary)",
      "total_reactions": 0,
      "user": "Le__Xenomorph"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 1,
        "year": 2015
      },
      "score": 8,
      "text": "As far as X Men movies  go this is the best....so far. The storyline is exciting and it's fun to see all the different characters as their younger and older selves. I give it a 9 out of 10!",
      "total_reactions": 0,
      "user": "jlittle1404"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 1,
        "year": 2015
      },
      "score": 7,
      "text": "This movie has a rough rough beginning, working up to rickety middle to an unfinished end. I found this movie to a massive build up to a sequel. The \"Bad Guy\" was unimpressive and basically non-existent. The acting was good, the CGI was decent but the movie just ended up feeling like a stop-gap for the next series in the X-Men franchise. Catch it on FX, you're not missing out on much, especially if you adhere to any print canon.",
      "total_reactions": 0,
      "user": "blistered"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2015
      },
      "score": 8,
      "text": "The movie contains dynamic actions and shocking moments along the movie which made it a total blockbuster i give only 8 however because i just didn't feel the connection of the movie to the X-men movie before it.",
      "total_reactions": 0,
      "user": "anonymouslim"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2015
      },
      "score": 9,
      "text": "What an awesome movie. I love Sci-fi movies, specially super heroes ones (not really a comic's fan, though), however it has been a long time since a movie of this type delighted me as much. The story is good, keep you attentive all the time and you truly get to empathise with the characters (excellent cast, bravo). I want to see more!. Time flew when watching it.",
      "total_reactions": 0,
      "user": "Tamaber"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 2,
        "year": 2015
      },
      "score": 7,
      "text": "Storyline was nice but expected more action at the end...Mystique was awesome as always and also a cool mutant Quicksilver was the new addition in the list of mutants...Overall a good movie..",
      "total_reactions": 0,
      "user": "mm007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "It seems pretty much like everyones happy at the end and that mystique is gonna rape wolverine or something.....I like the idea of a blue male being there for everyone to see but the female can easily hide.....its clearly the same metaphor of what happened previously with hank being more against being seen.......they both get what they deserve and magneto could not only have stopped mystique but tenticle monstered her ....for trying to ruin the world with fappening pics or whatever it was she was doing.......  I know for a fact that people can see the future but seeing the past makes little sense to me....My favorite line from the movie is magneto \"it doesn't matter anymore\"....just like the outcome of the movie because it was so awesome by then.....",
      "total_reactions": 0,
      "user": "CameraBounceGod"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 3,
        "year": 2015
      },
      "score": 7,
      "text": "indicating of the movie is Stylish. The plot of the movie Tell the source of the content well. and technology CGI in Movie is Great. I favorite Movie This.",
      "total_reactions": 0,
      "user": "MickMovie"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "Bryan Singer is back and his here to clean the x-men franchise for good. This is hands down the best x-men film and the movie is Better then X2. Quicksilver in this movie was so awesome and funny, and James McAvoy and Michael Fassbender do a fantastic job as the young Charles Xavier and young Magneto.",
      "total_reactions": 0,
      "user": "MattBrady99"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 3,
        "year": 2015
      },
      "score": 9,
      "text": "Mind blowing storyline, incredibly emotional, a huge All-Star cast, and visual effects that are difficult to compare to reality make this movie not only the best X-Men film but probably the best Marvel movie to date.",
      "total_reactions": 0,
      "user": "homer4president"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 6,
        "year": 2016
      },
      "score": 8,
      "text": "Quite possibly the best X-Men movie to date. It has plenty of action, humour and drama to please fans of the franchise, and a surprisingly smart story as well. You probably have to watch some of the other movies to fully understand it, but it's still entertaining enough to please casual viewers as well as die-hard fans. Quicksilver was a great character, and one I look forward to seeing more of in future instalments. Hugh Jackman is better than ever as Wolverine, with the rest of the cast giving solid performances as well. Peter Dinkleage also makes for a solid villain. On the whole, X-Men: Days of Future Past is a fun movie that matches its blockbuster scale with a smart narrative and fine performances.",
      "total_reactions": 0,
      "user": "DanBurrito"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2015
      },
      "score": 9,
      "text": "This is my second favourite X-men film after First Class. They managed to connect the timelines of the previous films, it's a good story with many action.",
      "total_reactions": 0,
      "user": "FilmQueen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 11,
        "year": 2015
      },
      "score": 8,
      "text": "Solid acting, a storyline that creates tension even if you can anticipate the outcome, and killer action set pieces more than make up for the slightly overstuffed feel.",
      "total_reactions": 0,
      "user": "katharris417"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2016
      },
      "score": 8,
      "text": "With such abundance of talents, it's a surprise their powers are not throwing award statues at each other. An all-star ensemble delivers one of the better and more captivating superhero movie in recent time, despite the use of a rather mystifying time travel plot. They do a remarkable job of keeping the audience invested to the characters, each with brimming personality to ensure there's never a dull moment. Visually, the movie is captivating, its contrast tone bridges the colorful 70s and severely bleak future impeccably. It also appropriately utilizes good humor throughout the seemingly melancholy plot.",
      "total_reactions": 0,
      "user": "aadityamudhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Days of Future Past is seriously one of the best X-Men movies of our generation. Watching it is even the best part about it because you know something will be good once you're watching it,",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2016
      },
      "score": 10,
      "text": "..............................................................................................Magnum Opus of X-Men Franchise...............................Waiting with great hopes for X-Men: Apocalypse",
      "total_reactions": 0,
      "user": "Thenewone"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "Thoroughly enjoyed this entry for the intense action sequences and wondrous CGI. Too be honest it feels like a rollarcoaster ride that starts off sweet and ends with a bang!",
      "total_reactions": 0,
      "user": "perkjl"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 1,
        "year": 2016
      },
      "score": 9,
      "text": "Step up, cynics, and see the summer 2014 blockbuster that gets damn near everything right. X-Men: Days of Future Past tries to stuff the whole X-Men universe – past, present and future – into one movie. The character overload may leave X-Men newbies dazed and confused, unless they're blissfully stoned. But fans are in for an exhilarating rush.",
      "total_reactions": 0,
      "user": "FilmMasterEd"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Easily the best X-Men movie combining the old cast and the new cast plus Bryan Singer directing to make a great movie. This film was obviously made to fix the huge plot holes and screw ups in the time line and it defiantly works. It's a must watch if you haven't seen it already but you should obviously watch the past films before seeing this one to understand the plot and the things that are getting rebooted.",
      "total_reactions": 0,
      "user": "AgentVenom117"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 2,
        "year": 2016
      },
      "score": 9,
      "text": "Okay,  Ending is Great...  Quicksliver is not handsome lol becasue his long hair's sliver is not good i dont like sliver hair.  but Quicksliver is GREAT in Age of ultron because i like his white hair is cool!",
      "total_reactions": 0,
      "user": "MaxBoyz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 5,
        "year": 2016
      },
      "score": 7,
      "text": "-X-Men: Days or Future Past is an American superhero movie from 2014 in 2D and 3D, based on the story line Days or Future Past (1981) from the strip series X-Men. The film is directed by Bryan Singer, who also directed the first two parts of the X-Men movie series. X-Men: Days or Future Past is the seventh film. The story is set in an alternate, dystopian future.",
      "total_reactions": 0,
      "user": "horrorliefheb"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2016
      },
      "score": 10,
      "text": "..................................................A Masterpiece!!!! Bryan Singer Follow the Vision of Matthew Vaughn and mixed with his own and =X-Men: Days Of Future Past.........",
      "total_reactions": 0,
      "user": "Zaynhewsonjavad"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "\"X-Men: Days of Future Past\" is yet another great step in the right direction. The return of director Bryan Singer had helped the production of this film to make it the best film in the series ( aside from Deadpool if you count that as an X-Men film). The stakes are raised to a higher level as humanity and mutant kind are enslaved by the Sentitles which are robots created for the sole purpose of hunting down mutants. The Sentitles are given a needed update as they have Mystique's power to shape-shift and copy powers to attack their targets. These machines were brutal as the tore people apart and shoot down anything in their path. The film than has Wolverine time travel back to the time line of \"First Class\". Some had concerns of Wolverine's inclusion in the film since he ad a habit of being the main focus of the other films but thankfully he has a limited role in this film as he is only their to be the metaphorical bridge between both timeline's. Each character feels changed as a result of the events of this film for better or worse and each one has been given more depth than any of the prior films. The one who truly Steals the show is Peter Dinklage as Bolivar Trask. This iteration of the character has an interesting unstated motivation to destroying these mutants which is implied to be pure jealously which makes his interactions with the mutants interesting to watch. Quicksilver was another great addition with the sequence of his super-speed from his prospective. The slow motion and the music really gives an out-of-body experience on that sequence that I had yet to see another Comic-book film. The action sequences are well choreographed and intense with a lot of attention to detail. It is impressive to have so much happening on screen but still be able to distinguish what is going on. This film is must-see for an superhero let alone X-Man fan.",
      "total_reactions": 0,
      "user": "ElectroNick"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2016
      },
      "score": 10,
      "text": "This one definitely lives up the hype of the X-Men story. X-Men 3 I wasn't so impressed with but this one actually surprised me because usually once films like these start to decline they only get worse but this one got better.",
      "total_reactions": 0,
      "user": "Castiel_Angel"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 11,
        "year": 2016
      },
      "score": 10,
      "text": "This is the single greatest X-Men movie of all time.   It combines the originals and prequels into an adventure that anyone, even those who have never seen X-Men before, can enjoy. The time travelling is simple and not messed up.",
      "total_reactions": 0,
      "user": "qasbash"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 11,
        "year": 2016
      },
      "score": 9,
      "text": "This film's strong side is the combination of the first generation and second generation cast building up in a nostalgic momentum, but also the contrast of campy past and dark future works very well.",
      "total_reactions": 0,
      "user": "Percula"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2017
      },
      "score": 0,
      "text": "Disappointed by the movie. Was expecting much much more. The movie could have been good but there were so many problems with the plots and the overall direction of the movie. The overall execution was terrible and it was a boring mess with not even half way through the movie.",
      "total_reactions": 0,
      "user": "fadithebeast"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 1,
        "year": 2017
      },
      "score": 0,
      "text": "This movie was an utter disappointment for me. The plots were not properly executed, there were many loopholes and the story was boring to be honest. The problem with these commercial films is that their whole purpose is to make money out of amateur movie goers rather than make something that should critically make sense.",
      "total_reactions": 0,
      "user": "ammeoo"
    }
  ]
}