{
  "mc_avg_user_score": 4.8,
  "mc_metascore": 34,
  "mc_mixed_rating_frequency": 43,
  "mc_movie_name": "Year One",
  "mc_negative_rating_frequency": 64,
  "mc_positive_rating_frequency": 57,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 2,
      "text": "I rated this movie the total number of times I snickered throughout its entire 97 minutes. It really boils down to the fact that Jack Black and Michael Cera are a bad combo; combine that with the movie's lackluster writing and you get \"Year One.\"",
      "total_reactions": 2,
      "user": "ryancarroll88"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 8,
        "year": 2011
      },
      "score": 2,
      "text": "I actually felt my I.Q. level fall at least a few points after this idiot-fest was over. I can also thank this movie for single-handedly destroying my respect for every actor in it, especially the two leads. Paul Rudd, how could you?",
      "total_reactions": 1,
      "user": "BananaCrazyCake"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "I really don't understand the low rating because I absolutely loved this movie. I've watched it several times and could keep on watching it again and again. I wasn't a Jack Black fan before seeing this, but now I'm more interested in seeing his movies. Michael Cera was terrific, as one might expect.",
      "total_reactions": 3,
      "user": "Damian"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 12,
        "year": 2011
      },
      "score": 3,
      "text": "It was kind of funny, but it was also full of gross, unnecessary dialogue. Overall, it was O.K., but I am giving it a 3 out of disgust. One of Jack Black, the #1 comedian in the world's weakest movies.",
      "total_reactions": 3,
      "user": "ReviewCritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 3,
        "year": 2012
      },
      "score": 0,
      "text": "Ummmm... What can I say about this movie? It has disapointed me more then all the past god of war knock-off movies combined. As a christian I am thouroughly offended by the jokes and during the entire film there were bladenly obvious and unclever sexual references and jokes. I'm all for them if there clever and funny (arrested development for example) but I almost hated sopmorical humor after watching this piece of s***. I am not even kidding one of my friends I was watching this with just walked out and I discussed with my other friend wether we should join him or not and now I wish I did. I am not even kidding when I say that I double dipped with my two friends to watch the new (now old) star trek and felt no shame as year one was worth getting paid to watch.",
      "total_reactions": 2,
      "user": "Mandalorian_12"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 7,
        "year": 2012
      },
      "score": 9,
      "text": "Very funny, with jokes very well done, this is really an example of \"do not trust blindly in the critical\", it is worth watching and be sure the writers had a lot of work on the jokes, because they are perfect! To give a low grade for jokes so good, one must be very boring, and is running with all work very well executed! In short: It's worth seeing, and give a good grade, to show these critics  that they are jerks!",
      "total_reactions": 1,
      "user": "disorriso"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2010
      },
      "score": 8,
      "text": "I had very low expectations about this movie since Jack Black has made some real duds (be kind, rewind, Nacho Libre, etc)  but I was very surprised to find myself laughing out load at times and overall I enjoyed this movie very much. The plot is simplistic but the comedy is very witty and fresh.Cera's character is great and his rumblings and lines are witty and funny, there were several surprise cameo appearance's also, one of the funnier ones involves Paul Rudd who I really enjoy. This movie is not a 10 but is definitely worth seeing if you like funny movies because the vast majority of them are stinkers, I have recommended this movie to several friends and all have said the same thing after watching it, they thought that it was very funny.",
      "total_reactions": 0,
      "user": "moviefan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2011
      },
      "score": 6,
      "text": "This is one of those movies that you will love or hate. I actually enjoyed this flick. Sure the plot is horrible, dont make much sense. Pointless action scenes, acting isnt that its terrible its just a random movie, on a quest  or lack off. If you like the cast then its worth a watch. If you like cornball movies this is for you. I love cornball movies as its my sense of humor.",
      "total_reactions": 0,
      "user": "MrRiggs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "Year one is barely sporadically funny, predictabally lame, but the film does offer some rather surprising gross out gags, that some if not most summer comedy fans will enjoy",
      "total_reactions": 0,
      "user": "thecurber"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 2,
        "year": 2011
      },
      "score": 0,
      "text": "Awful movie. Jack Black just isn't funny.  He has had one decent movie in the school of rock, and he has been riding that movie to bust after bust after bust. Cera never has been good. I have seen actors playing in high school plays perform better. I watched about 10 minutes of this movie. It had no plot, no character development, and was relying on the pre-teen/teen crowd to carry the ratings.",
      "total_reactions": 0,
      "user": "tulsytrid1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2011
      },
      "score": 4,
      "text": "Bought this on whim having missed it's release. After the opening scene, thought I was on to a winner, however the rest of the film failed to live up to the early promise. There are a few laughs to be had but generally it just isn't funny. The plot is far from smooth and most of the time it appears the actors are making the lines up as they go along.",
      "total_reactions": 0,
      "user": "nomad4life"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 5,
        "year": 2012
      },
      "score": 6,
      "text": "It was funny throughout. This parody movie has laughs and a bit of a heart. The story was much better than I had expected it to be.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 1,
      "text": "I hate Jack Black! He is a talentless hack who babels on an on like a buffoon. I really have no idea why I wanted to see this horrible piece of cinema, but it's clearly one of the worst movies I've seen all year. The babbling is endless, the characters are whiny, and the plot of the movie is just stupid. I was kind of a hoping a dinosaur would come along and eat these two idiots! This is two hours of my life I wish I could have back.",
      "total_reactions": 0,
      "user": "Tss5078"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "It was very funny I loved this movie..    .",
      "total_reactions": 0,
      "user": "JB-"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "The last half hour of Year One is much better than the first hour but is still very stupid, childish and I expected Adam Sandler to turn up any second.",
      "total_reactions": 0,
      "user": "python2000"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2013
      },
      "score": 3,
      "text": "A very mis-matched movie, it mixes humor seen in bad cartoons with adult sex references. The movie has some great actors in tow but none really do anything laugh-worthy. The movie goes nowhere for a large portion and makes no good use of the actors comedic talents. I watched it all the way through but took away nothing but the fact the movie was below average at best.",
      "total_reactions": 0,
      "user": "ninja_dolphin"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2014
      },
      "score": 10,
      "text": "There are few movies I can watch over and over. The Matrix, LotR - The Fellowship of the Ring, The Hobbit and I've recently added Year One to this short list. The first time I saw it, I think there was just too much to take in. It's crammed with jokes and subtle body language. If you're stuck up or don't like outrageous humor like Dumb and Dumber, don't bother. I don't feel like reading another \"Woe is me,  this movie is so disgusting/offensive/gross\". Go back to your Downton Abbey.",
      "total_reactions": 0,
      "user": "SpaceGeek"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2016
      },
      "score": 7,
      "text": "Do you really think a movie written and directed by Harold Ramis (Animal House, Caddyshack, Stripes, Ghostbusters, Groundhog Day) could be that bad? It's the kind of movie that critics love to hate, which is why critics suck.",
      "total_reactions": 0,
      "user": "thujone"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2015
      },
      "score": 3,
      "text": "In \" Year One \" truly this very forgotten , as those two characters not estabanen Bible and believed that the script and reality is changed, rather horrible a movie , in terms of plot, script and acting of the cast.",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2016
      },
      "score": 9,
      "text": "'Year One' wants to be seen as a freeform, knockabout trawl through Biblical history, perfect for an undemanding Saturday night.",
      "total_reactions": 0,
      "user": "avamiller21"
    }
  ]
}