{
  "mc_avg_user_score": 4.3,
  "mc_metascore": 35,
  "mc_mixed_rating_frequency": 29,
  "mc_movie_name": "Yogi Bear",
  "mc_negative_rating_frequency": 34,
  "mc_positive_rating_frequency": 22,
  "mc_pro_critic_reviews": [
    {
      "critic": "Mick LaSalle",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 75,
      "summary": "This is a cute movie, a kid's movie, and a rather good one."
    },
    {
      "critic": "Adam Markovitz",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 67,
      "summary": "There's nothing particularly inventive in the plot or grade-school humor, but the movie skates by on the timeless, undemanding charm of watching a tie-wearing bear try to steal people's lunches."
    },
    {
      "critic": "Melissa Anderson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2010
      },
      "score": 60,
      "summary": "Adults will be thrilled to see Anna Faris as nature documentarian Rachel. Greeting Yogi by speaking in \"brown bear,\" the actress never fails to be seriously goofy."
    },
    {
      "critic": "Michelle Orange",
      "publication": "Movieline",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 55,
      "summary": "On the whole the film is not much fun to watch. A job is a job, though; Yogi Bear did little to make it more than that."
    },
    {
      "critic": "Joe Williams",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "Here, Dan Aykroyd mimics the original voice, but the three-dimensional CGI isn't loose and lively enough to compensate for the unimaginative story."
    },
    {
      "critic": "Jennie Punter",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "While the outdoor sequences were filmed in New Zealand's Woodhill State Forest – the movie's most stunning 3-D moments – Yogi Bear does feature notable \"Canadian content\" via two Ottawa-born thespians."
    },
    {
      "critic": "Mike Scott",
      "publication": "New Orleans Times-Picayune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "Clearly, Brevig's past as a visual effects maestro had him focusing more on the look of Yogi Bear than on crafting anything resembling a clever narrative."
    },
    {
      "critic": "Elizabeth Weitzman",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "None of the three screenwriters strained himself with effort. But the relative lack of coarseness and snark may come as a surprising relief, even to 21st-century audiences."
    },
    {
      "critic": "Kirk Honeycutt",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "Yogi is still smarter than the average bear, but Yogi Bear is much less smart than most of the year's kid-friendly cartoons."
    },
    {
      "critic": "Justin Chang",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 50,
      "summary": "A bland and innocuous small-fry outing that retains a measure of the original Hanna-Barbera cartoon's charm, though scarcely enough to justify the time, expense and visual-effects trickery it must have taken to inflate an endearing 2D cartoon into a dopey 3D extravaganza."
    },
    {
      "critic": "Nick de Semlyen",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 2,
        "year": 2011
      },
      "score": 40,
      "summary": "The wee'uns may enjoy the forest-based capers but for adults this is no pickernick."
    },
    {
      "critic": "Mike Hale",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 40,
      "summary": "There's exactly one thing about the misbegotten big-screen Yogi Bear that might make you think back with any fondness to the Hanna-Barbera cartoons on which it's based. That would be Justin Timberlake's charming performance as the voice of Boo-Boo Bear."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 38,
      "summary": "Cavanagh, the always-engaging former star of \"Ed\" (with whom I am friendly), and the adorable Faris (whom I don't know -- but feel free to look me up, Anna!) make the non-animated scenes amusing, as the ranger and the documentarian fall in love and fight to save the park. But the script doesn't give them a lot to do."
    },
    {
      "critic": "Dan Kois",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 38,
      "summary": "An uninspired studio product that demands as little from the audience as it did from its writers, directors and actors."
    },
    {
      "critic": "Claudia Puig",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 38,
      "summary": "Yogi Bear is a big boo-boo."
    },
    {
      "critic": "Ty Burr",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 25,
      "summary": "Picture Timberlake in the booth recording his lines and you have the best joke in the movie. Everything else is actively painful, a frenetic, unfunny mix of action, romance, dud dialogue, and icky things popping out of the screen."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 25,
      "summary": "The best that could be said of Yogi Bear is that it doesn't diminish its source material."
    },
    {
      "critic": "Michael Phillips",
      "publication": "Chicago Tribune",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 12,
        "year": 2010
      },
      "score": 25,
      "summary": "Yogi Bear gives cheap hackwork a bad name. Which is a shame, because hackwork made this industry."
    },
    {
      "critic": "Roger Moore",
      "publication": "Orlando Sentinel",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 25,
      "summary": "The best you can say about this Yogi Bear is that he's harmless. No animal was harmed in the making of this picture except the one Hanna-Barbera made a bundle on almost 50 years ago."
    },
    {
      "critic": "Steve Persall",
      "publication": "Tampa Bay Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 12,
        "year": 2010
      },
      "score": 25,
      "summary": "A smarter-than-average bear becomes a dumber-than-usual kiddie flick with Yogi Bear, the lone Christmas release specifically aimed at children, so it automatically qualifies as their lump of coal."
    },
    {
      "critic": "Marjorie Baumgarten",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 20,
      "summary": "Unbearable."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2010
      },
      "score": 20,
      "summary": "Yogi Bear on the big screen feels not just needless, but wasteful."
    },
    {
      "critic": "Sara Maria Vizcarrondo",
      "publication": "Boxoffice Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 12,
        "year": 2010
      },
      "score": 20,
      "summary": "Even the presence of Dan Aykroyd as Yogi and Justin Timberlake as his pint-sized straight man Boo Boo, couldn't save the movie."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "Well i watched it with the family. We where not to enthused about it. We all agree that many things could be better but the kids will like it. And for that i rate it a 7. Seeing that it is a kids movie and i must rate it at a kids perspective.",
      "total_reactions": 3,
      "user": "Veridon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 7,
        "year": 2011
      },
      "score": 7,
      "text": "Overall good movie...pretty interesting and for the most part lives to the hype..the voice acting is spot-on, the story-line is quite enjoyable, and the actors do a great job making the movie fun for kids, but funny for adults.",
      "total_reactions": 3,
      "user": "msft777jf"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 5,
        "year": 2011
      },
      "score": 5,
      "text": "It wasn't as bad as I thought it would be. Nothing spectacular here, and Yogi definitely achieves success in annoying everyone, but it is just mindless, silly fun if you can jar your brain into that realm.",
      "total_reactions": 2,
      "user": "Khunter4382"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 10,
        "year": 2011
      },
      "score": 3,
      "text": "Oh please. \"Yogi Bear\" is terrible film with nothing useful. From acting (oh I forgot, there IS no acting) to story, everything tastes extremely bland. Just... just don't watch it. It's meaningless as hell.",
      "total_reactions": 8,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2012
      },
      "score": 6,
      "text": "This was not very great. But it is still very entertaining and if you have a good sense of humor you will definitely love this movie. The only thing is DO NOT expect it to be a four star movie.",
      "total_reactions": 4,
      "user": "monkeyshiner444"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 1,
      "text": "Oh my God.  What were they thinking.  I didn't expect an Oscar caliber movie, but certainly better than this.  Anyone over the age of 5 will be looking for the exit after about 5 minutes of this crap.",
      "total_reactions": 6,
      "user": "movielover64"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 1,
        "year": 2011
      },
      "score": 10,
      "text": "My 2 sons liked it but it wasn't to the level of Toy Story. The movie was the same kind of animated/live action like the Garfield movies. BUT... the 3-D was very evident, it was even more then the Toy Story movies which is a surprise since, well... they're supposedly the king of all things animation--they gotta work on the 3-D thing a bit more. Jon Stewart's \"twin\" Ed Cavanaugh played the head ranger, I could see why his tv show went off the air--his humor is very dry and actually kind of rude. Anna Farris actually outperformed him in the movie--she's from the Scary Movie set of movies. Yogi's voice was Dan Akroyd, he was pretty spot-on but Boo-Boo sounded like he was voiced by Pee Wee Herman--kind of creepy actually. Overall, I gave the movie a 5... 3-D was great but the movie as a whole--rent it.",
      "total_reactions": 5,
      "user": "rjakjr"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "The boringness outweigh the humor of this movie. The plot way too predictable, good guy wants more, then changes mind, then helps save the day. But the jokes/humor are hilarious, it is by far the most funny movie I have ever watched.",
      "total_reactions": 2,
      "user": "YZJay"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 2,
        "year": 2011
      },
      "score": 5,
      "text": "Sorry! My 1st Mixed Review.... 1st Of All The Yogi Bear T.V. Show Is Great...",
      "total_reactions": 2,
      "user": "RogerSmith97"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "Sure. The chemistry is phony. It's dialogue is corny. It was terribly acted. But, funny voiceovers, and good 3D make it a fun movie to see for kids and adults, leaving the adults to like it more than the children.",
      "total_reactions": 5,
      "user": "mrcritic"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 1,
      "text": "It is predictable in its humor but it doesnt try TOO hard so it isnâ",
      "total_reactions": 5,
      "user": "brewcrewpride"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2011
      },
      "score": 0,
      "text": "Just plain awful nothing can compare because it is that. I give this just unexplainable movie a terrible just awful 4% of a good movie. Boy is that awful.",
      "total_reactions": 9,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 12,
        "year": 2010
      },
      "score": 5,
      "text": "OK. This is my \"Real\" review for the film. I was very annoyed then but I'm fine now. So here I go. This was a bad film. Not an extremely bad film but just a bad one. The chemistry between the park ranger and that blond woman was just so fake. They were pretty bad actors as well so I was pretty annoyed at that.The film wasn't funny either. The only funny person was the mayor and he isn't given enough screen time. The big problem with this movie is that it tries hard but just fails miserably because it's just not funny. Now that's all the bad stuff that really ruins the movie. I loved the Yogi Bear cartoons as a kid and this is just nothing compared to it. One of the worst films of 2010. Now there's things I actually liked in the movie like the voice actors of Yogi and Bobo. Justin Timberlake did a great job doing Bobo's voice. Sometimes I actually felt like I was watching an old Yogi Bear cartoon most of the time. If it weren't for the bad comedy then this would have been a pretty good movie. The CGI wasn't that bad either. So it isn't all that bad. It was just a pretty big disappointment for me since a loved the Yogi Bear cartoons when I was younger. This movie gets a mediocre 5/10 score. Kids will probably enjoy it more than I did. This is Mewtwo465 saying goodbye for now.",
      "total_reactions": 6,
      "user": "Mewtwo465"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2011
      },
      "score": 0,
      "text": "I expected a terrible movie when I went to the movies to watch it with my 4 year-old brother. It's beyond terrible; it's just **** The actors are really bad (especially Anna Faris's performance), and there is no script. It's not funny, and it has no message at all.",
      "total_reactions": 3,
      "user": "PeterWhat"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Young kids really like this movie!  it is a good, clean movie that the family can go to together.  we heard lots of kids saying they liked it as they were leaving the theater.",
      "total_reactions": 8,
      "user": "ConnorD"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 12,
        "year": 2010
      },
      "score": 3,
      "text": "In all honesty, I went into this film with low expectations. As the distributor who acquired rights was Warner Brothers, (who also messed up a live action dragon ball Z adaptation along with countless other films). I was thinking that the wrong people would be chosen to make this film and the wrong people would be involved with it. Boy, I was right.",
      "total_reactions": 4,
      "user": "DarkZX"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 8,
        "year": 2011
      },
      "score": 7,
      "text": "Definitely a kids movie, but it's still enjoyable, very funny, and a little predictable, still it's an enjoyable movie for the family, just keep in mind this is aimed at younger audiences.",
      "total_reactions": 4,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 1,
      "text": "Crap like \"The Yogi Bear Hour\" and other William Hanna and Joseph Barbera crimes against animation(save for their stint with MGM) are the foremost reason why some people today still insist on pigeonholing \"cartoons\" as being strictly a medium for children. All that junk which inundated the airwaves on those Saturday mornings of yore can be attributed to Hanna-Barbera's maiden voyage(\"The Ruff and Reddy Show\") into television(following a successful run helming \"Tom and Jerry\" shorts). Their second offering, \"The Huckleberry Hound Show\", made its debut in 1958, and right away, the Jellystone National Park bear became the program's breakout star, paving the way for future successes such as \"Scooby-Doo, Where Are You!\" and \"The Jetsons\", and other like-minded production companies who imitated Hanna-Barbera's cut-rate animation methods, which more than often, married the cut-rate imagination of their banal premises and storylines. The only means of justifying, as it turns out, such ephemeral programming, is through compartmentalization, in which the aging Generation X-er views a show like \"The Yogi Bear Hour\" purely as a nostalgic trip, divorced from any sort of critical language that would delineate the shoddiness of the overtly commercial enterprise, one whose sole purpose was to peddle sugary breakfast cereals to little kids. As art, even the venerable Flintstones, were not gr-r-r-r-eat, even by Adult Swim standards. On \"The Simpsons\"(which was the first prime-time animated program since Fred and Wilma left the air in 1960, creator Matt Groening seems to express a love/hate relationship with Hanna-Barbera's body of work through the cartoon-within-a cartoon, \"The Itchy and Scratchy Hour\", an ultra-violent homage to the feuding characters' predecessors, \"Tom and Jerry\", the crowning artistic achievement in a chequered past for these problematic animators. But is it homage? Maybe not. In each episode, the mouse(Itchy) eviscerates the cat(Scratchy) so thoroughly and in such graphic detail, the evocation to the MGM shorts hardly looks like a loving one, but instead, takes on the appearance of being a desecration; a rebuke, perhaps, to the sell-out that followed when the collaborative team transitioned themselves from the big screen to the small screen, where they proceeded to infantilize the art form in the superceeding decades to follow. Groening seemingly pisses on the one accomplishment that Hanna and Barbera can hang their hats on, in which Bart and Lisa, once every feline snuff short reaches its inevitable solution, laughs, or rather, gets the last laugh, as if mocking the children's programming pioneers, who once launched a Yogi Bear offshoot in outer space(the short-lived \"Yogi's Space Race\", which capitalized on the \"Star Wars\" phenomena), and laughed all the way to the bank. And now, six years after a certain talking dog last got the big-screen treatment(2004's \"Scooby Doo 2: Monsters Unleashed\"), the talking bear undergoes the same computer-generated transmogrification process, as well, a consolation prize of sorts for missing out on the three-strip Technicolor process. Similar to his canine stablemate with the speech impediment, the smooth-talking bear with a propensity for thievery has never looked better, but despite the makeover, the twenty-first century edition of this allegedly loved bear finds himself stuck in the same one-note narrative that rued the earlier models and their respective programs(\"Yogi's Gang\", \"Yogi's Treasure Hunt\", and \"Laff-A-Lympics, where the Yogi Bears squared off with the Scooby-Doos and the Really Rottens), which are best left forgotten on the popular culture trash heap. The only entertainment that can be imparted from this live-action version of \"Yogi Bear\" is the thought of Justin Timberlake(the epitome of smarm in David Fincher's \"The Social Network\", playing Napster founder Sean Parker) doing his Boo-Boo voice-overs in the sound booth, since it's pretty clear, as evidenced by the shortage of laughs(Anna Faris, notwithstanding), that neither he nor Dan Ackroyd were allowed to improvise. Like Trix, \"Yogi Bear\" is for kids, but alas, herein lies the paradox: it's for kids who grew up. After all, the last original Yogi Bear cartoons ran in the mid-eighties. Since then, the aforementioned \"Simpsons\" happened. \"Spirited Away\" happened. \"The Triplets of Belleville\" happened\". \"King of the Hill\" happened. \"Mulan\" happened(minority opinion). \"Ratatouille\" happened.  More sophisticated than your average cartoon-watcher(the kids of Generation X, who may not know who Yogi is), the now-mature viewer may wonder why a frog-mouth turtle would impress national park patrons more than a talking bear(who can maneuver a jet-ski like a Go-Go) when Jellystone nearly closes due to a mayor's machinations to rezone the land. What's next? \"Shazam\"?",
      "total_reactions": 3,
      "user": "Shiira"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2010
      },
      "score": 4,
      "text": "After seeing trailers for this movie, I had low expectations. And although this is better than that damned Alvin & the Chipmunks 2, I can't help but feel it is in the same league!! The special effects are really (and I mean really) bad, & whereas the cast is well-chosen, they are let down by a crappy script & even crappier directors.",
      "total_reactions": 1,
      "user": "liptap"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 2,
        "year": 2011
      },
      "score": 4,
      "text": "When i first heard about this movie I was excited to see it. But I was disappointed about the movie.",
      "total_reactions": 1,
      "user": "ESS180"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 12,
        "year": 2010
      },
      "score": 4,
      "text": "Cute movie. The fluff you'd expect, but nothing objectionable. Bad acting and pretty stiff, but a cute film to take the kids to. Nothing to really satisfy the boomer nostalgia that will bring people in. But at least they took the high road on humour. No potty stuff.",
      "total_reactions": 2,
      "user": "Supermom4"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2011
      },
      "score": 4,
      "text": "Hmm... When I went to see this movie, I though it was going to suck real bad. Turns out, you really just need to remove the words \"real and \"bad\". It just sucks. It was a lot better than I though it was going to be and I can usually tell if anything will be a flop before the reviews come in. Yes, it was a flop. Why? Well, the animation feels old, you can tell it's green-screened in some parts, the story is bad and most of the jokes are lame. On the upside, some jokes DID work, the voice acting for Yogi Bear was good and the fireworks scene was pretty cool but unless you're a kid under 8 years old, I say it's best to leave this one.",
      "total_reactions": 2,
      "user": "Bathmat"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 2,
        "year": 2011
      },
      "score": 8,
      "text": "it may not be perfect but it still has its charms and is an enjoyable film for the kids. it has its funny moments and exciting moments and i dont understand what is wrong with it, it may be a bit cheesy for the grown ups but im pretty sure the kids will like it.",
      "total_reactions": 1,
      "user": "jackb99"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2011
      },
      "score": 0,
      "text": "This was probably the worst movie ever there was no story it was funny at all and it is a total waist of money.Either rent this or never see this movie!",
      "total_reactions": 2,
      "user": "monkeyshiner"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 6,
        "year": 2011
      },
      "score": 4,
      "text": "It's a shame, Yogi Bear is such a classic. I will admit I let out a giggle every now and again due to it being... Yogi Bear. As a movie it severely lacks in storyline and I lost interest about a third of the way through.",
      "total_reactions": 1,
      "user": "awfy"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 7,
        "year": 2011
      },
      "score": 2,
      "text": "Yogi Bear is a bad film with good parts. The only good parts in the film is remembering how the yogi bear cartoon series was like. The problems with the film is boring, dull, not funny and dosent do a great job on yogi bear that they should have done. I would only see this if you want but i wouldnt watch this again.",
      "total_reactions": 1,
      "user": "Edward9630"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2011
      },
      "score": 1,
      "text": "10 minutes after watching the movie, I wanted to leave. It forces it's cliche, dry, predictible humor down your throat, the CGI is one of the worst I've seen in a modern movie, and the story is so overused and random that there is nothing good about it. I stayed for 20 minutes to see if it got better, and it just got worse. I immediately walked out disgusted.",
      "total_reactions": 1,
      "user": "Overrwatcher"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2011
      },
      "score": 3,
      "text": "Oh ho-ho, I see what they are trying to do here: they're using the image of an iconic, beloved character who has been living with us for generations just to cover up the messiness present on his deplorable script and   lamentable acting. Sorry Yogi-bear, but nothing on this film was worthy of my money.",
      "total_reactions": 1,
      "user": "Potter17"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2011
      },
      "score": 1,
      "text": "ONE OF THE WORST MOVIE I HAVE EVER SEEN IN MY ENTIRE LIFE ..... Script BAD , Directing BAD , Acting SO BAD , Music BAD ,  Effect NOT BAD BUT NOT THAT GOOD EITHER .........I have no else to say coz i think I've made it pretty clear .",
      "total_reactions": 1,
      "user": "Akkhar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 11,
        "year": 2012
      },
      "score": 4,
      "text": "\"Only entertaining\"",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2014
      },
      "score": 3,
      "text": "These live action movies with CGI characters are almost impossible to master. I should know, I've seen Alvin & the Chipmunks. This is a worse example. The comedic acting is laughable itself, and not in a good way. The whole film is annoying and drab. Don't take your kids, unless they're less than three.",
      "total_reactions": 0,
      "user": "FranzHcritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 5,
        "year": 2015
      },
      "score": 10,
      "text": "ore. You can tell all of her songs came from the heart. The only thing that I have to say is that I don't think \"Run The World (Girls)\" fits into the album AT ALL. Other than that, the album is flawle",
      "total_reactions": 0,
      "user": "Clubsocial"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 2,
        "year": 2016
      },
      "score": 4,
      "text": "Yogi Bear acts like the Garfield movies and pretends to get away with money and bad reviews. This Yogi Bear is not smarter than the average bear, but it's more decent than the average bear.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 2,
        "year": 2016
      },
      "score": 1,
      "text": "The cartoon is better.",
      "total_reactions": 0,
      "user": "tdickensheets"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 3,
        "year": 2016
      },
      "score": 4,
      "text": "Yogi Bear uses more modern technology than sitcom or true love. It is also not-funny-enough for put the audience paged to this unremarkable film and almost one of the worst films ever.",
      "total_reactions": 0,
      "user": "Futuredirector"
    }
  ]
}