{
  "mc_avg_user_score": 5.6,
  "mc_metascore": 28,
  "mc_mixed_rating_frequency": 18,
  "mc_movie_name": "You Again",
  "mc_negative_rating_frequency": 27,
  "mc_positive_rating_frequency": 35,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "Kristen Bell continues her delightful run from \"Veronica Mars\" to \"Forgetting Sarah Marshall\" to \"When In Rome\" into the open arms of America. She holds her own very well while leading a charming cast of veteran favorites. Kristen Bell for Prez!",
      "total_reactions": 2,
      "user": "PatStinkman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "I thought the movie was extremely funny. Betty White stole the whole thing! She had still got it after all these years. Kristen Bell was wonderful and has got the romantic comedy thing down to a T. I think it is worth a watch.",
      "total_reactions": 1,
      "user": "ChrisN"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "This movie was so much fun to watch! I saw it three times and and it was just as entertaining each viewing. The cast is amazing and they kept me laughing non-stop. The concept is so relatable - who among us hasn't dealt with a high school bully? It's a great film for all ages! If you haven't already, I highly recommend you check it out!",
      "total_reactions": 1,
      "user": "KBodfish"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "I was surprised by how sweet and funny this film was! We took our 13-year-old and realized the film not only entertained us but also provided us the opportunity to talk to her about the issue of bullying.  The audience we were in actually clapped a few times.  Can't remember the last time that happened in a movie.  All in all I'd say it's a really entertaining family film.",
      "total_reactions": 1,
      "user": "ilovedonuts"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "The audience I saw this with was tearing up the place, clapping and laughing. And, of course, America's collective, darling grandma, Betty White, was a gem. Overall, I was pleasantly surprised.",
      "total_reactions": 1,
      "user": "VictorVenezuela"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "I don't really understand the people who said it wasn't funny.  The audience I saw it with really loved it.  My husband and I really enjoyed it as well.  Great cast, lots of fun.",
      "total_reactions": 1,
      "user": "oops"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2010
      },
      "score": 1,
      "text": "It may have some unexpected cameos, but that doesn't cut it, and You Again is a horrific movie that isn't a romantic comedy or a chick flick... it's more of a horror movie, due to the fact that it's scary of how bad You Again is. My favorite part of the movie was the trailers. Even Betty White couldn't get a laugh, and this corny  DIsney movie is not worth the money. It's not even worth the 10 mile drive to get to the theater. Avoid You Again.",
      "total_reactions": 3,
      "user": "mrcritic"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2011
      },
      "score": 3,
      "text": "Let's play a game I'd like to call \"Word Association:\" \"She's the Man,\" \"The Game-Plan,\" \"Race to Witch Mountain,\" and the made-for-tv 'Lifetime' special \"Wright v. Wrong;\" any reactions? Do the words brainless. emasculating, flat, pulseless, insipid, stale, dull, enervating, and cinematic decadent come to mind? If so, you might be familiar with Mr. Fickman's recent work. One of his latest being yet another Disney-rom-com-meets ABC Family-Oxygen flatliner that tries to sneak in some praise with the likes of a few veteran actresses (Weaver and Curtis-oh and who could forget Betty White). But don't get your hopes to high yet, every director has a motive, and Fickman isn't any different---these women are casted for a reason. As the film progresses (or dissipates further into fatuousness), these gals serve as the final impediment of what seems like a continuing ensemble of nails in the coffin. So, worst case scenario you see the movie to assuage your \"Alien\" - \"True Lies\" - \"Golden Girls\" nostalgia. As for some of the other castings---Kristen Bell in particular---acting appears almost foreign to her in this film. I don't know if she was just looking for a quick payday or what, but I haven't seen her more \"out of\" her character than she is in \"You Again.\" Half-baked, unattentive, uninterested, ill-conceived delineation of a PR-promotee whose high school unfortunates come to meet her once again. The premise, although some-what intriguing at first, follows close behind the \"way overdone\" genres of Hollywood today, so much that one might mistaken pieces of the screenplay for another; plagarism in moviemaking is satisfactory...all right...COPY + PASTE...yes, now I have a fully-functioning 90 minute rom-com! Now, let me throw in some pathetically selected cameos, a rendition of \"Glee\" in a hospital, and causeless catfights and you have \"You Again.\" Almost forgot...slapstick humor---made just for you. Verdict: bouyant, lightheartedness that fails to asservate any sort of palpable feeling or pathos; heavily reliant on drollery, slapstick, con-melodramma, and hackneyed substance.",
      "total_reactions": 1,
      "user": "FDT44"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 9,
        "year": 2010
      },
      "score": 2,
      "text": "For comparison's sake, since \"You Again\" gets it all wrong, the popular mother/unpopular daughter dynamic that forms the real heart(a black heart) of this unwise and unctuous comedy, was delineated to perfection back in the mid-nineties on Winnie Holzman's \"My So-Called Life\", the sublime ABC teen drama which starred a then-unknown Claire Danes, who as Angela Chase, an unformed and unaware fifteen-year-old girl with angst to burn, also lived in the shadow of a formidable mother(played by Bess Armstrong), a head cheerleader, back in the day, just like Gail(Jamie Lee Curtis), mother to Marnie(Kristen Bell), the proverbial late-bloomer. Like most contemporary mainstream comedies, \"You Again\", the latest genre offering from a major studio, sucks again. Don't be bamboozled by the obfuscating games that prevents the narratorial truth from breaking free of its broad comedic straitjacketing. It's mom, not Joanna(Odette Yustman), the mean girl from high school, who was, and still is, Marni's principal rival. The matching musical cues that accompany Odette and Ramona's first appearances, as focalized by Marni and Gail, respectively, does not entail a bonding between daughter and mother in shared misery, since their growing pains was an outgrowth of dissimilar high school experiences, whereas the former was subjected to victimhood, and the latter agonized over the fallout from perpetuating a friend's victimization. With Patti, you never doubted for a second that she wanted nothing but the best for her sensitive daughter; she was never in competition with Angela. The former queen bee, so used to accolades and attention stemming from her good looks, knew when to step aside and give up the spotlight. In Episode Five: \"The Zit\", a department store salesman at the cosmetics table pays Angela a compliment, which the mother mistakenly thought was directed toward her. After Patti collects herself, she seems pleased as punch that somebody appraised Angela as being a \"pretty girl\", despite the blow to her ego. The memorable episode(mostly for its brilliant use of Enigma's \"Return to Innocence\") centers around the mother's solicitation of her daughter taking part in a mother/daughter fashion show, regardless of the pimple that Angela can't \"swab\" away. This offer would still stand, one suspects, even if Angela had Marni's acne outbreak, because Patti Chase loves her daughter unconditionally, pom-poms or no pom-poms. The jury is out on Gail, however, and that's because the flashbacks in \"You Again\" are relegated to Marnie, without the context of her family, chiefly, the mom, who arguably seems to be the reason why this socially inept girl would be put in harm's way, through Joanna's crosshairs at cheerleader tryouts, in some feeble attempt to carry on the Byers legacy of pep squad eliteness. Marni's stint as the team mascot, an alligator, speaks volumes about the pressure she was under to appease her mother's ardent belief in school spirit. \"You Again\" rigs the jury, but the filmmaker isn't wholly successful in suturing the truth about the Solondz-esque darkness that threatens the forced sunshine of this middle-class suburban family. Marni's rags-to-riches story could be construed as an act of rebellion against the superficiality that had defined the charmed life which her mother enjoyed as a teenager. Although Gail knows that her son's fiancee was Marni's bane of existence, she gamely rubs salt in old wounds when she joins her fellow cheerleading alumnist in an old Gator routine. Inexplicably, the mother forces Marni to share a room with Joanna. That music cue which introduces Ramona(Sigourney Weaver) is a host of borrowed notes which Gail hears whenever she sees Marni. That line about being satisfied with being a housewife, as she wades in the pool with Ramona is pure Disney; pure bulls*it to gloss over what's self-evident. Through a series of contrivances, Marni reverts back to her former self: the bad haircut, the bad complexion, and most telling of all, which indicts Gail as a mean girl(as a teen, she stole Ramona's boyfriend) still, who never really changed her stripes, the mother saved her daughter's unflattering glasses. Patti, on the other hand, would have stomped on those frames, because of the high school traumas that it signified.",
      "total_reactions": 0,
      "user": "Shiira"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 9,
        "year": 2010
      },
      "score": 4,
      "text": "You Again has what so many other movies seem to have in recent years: a great cast wasted on a terribly boring, average script and a plot  whose twists you can see coming from miles away. Betty White is tragically underused, Odette Yustman (I know, I didn't know who she was either) is almost painfully bad and Kristen Bell, as always tries her hardest to save the movie, but she just isn't believable as a 'nerd'. The movie is, however, saved just a tad by the warm chemistry between Jamie Lee Curtis and the always amazing Sigourney Weaver. The scenes between them are natural, funny, and at one point, even heart-warming, but always believable. Someone really needs to give Weaver a role that can win her an Oscar, because I really can't think of any actor more deserving than her.",
      "total_reactions": 0,
      "user": "SmellyCat"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2010
      },
      "score": 2,
      "text": "Really getting sick of hollywood. I was dragged to this and found it repugnant. Terrible representation of what high school was really \"like\" in 2002. I was in high school in 2002 and it is NOTHING like what Hollywood says it is. Kristen Bell is hot, and she's a decent actor, but this entire movie was painful to watch. I laugh easy, and didn't laugh once at this one. If your girlfriend drags you to this (or are the girlfriend planning on dragging your significant other to this) DO NOT. You're wasting your money. Every last penny is better off going down the drain, or given to some random stranger, because that alone, will have more positive effect on your emotions than will this movie. Damn you Hollywood... it's only getting worse.",
      "total_reactions": 0,
      "user": "BDeyo01"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2010
      },
      "score": 1,
      "text": "An immeasurably stupid film proving that no matter how much talent is out there, idiot Hollywood executives will still green-light the simplest, moronic films for the idiocratic masses.  I feel dumber after having seen this film.",
      "total_reactions": 0,
      "user": "txrangersfan72"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 9,
        "year": 2010
      },
      "score": 5,
      "text": "Okay, so maybe it's because I saw it for free during a sneak preview, or maybe because I expected it to be completely lame that I was able to be somewhat pleasantly surprised and found I actually enjoyed it for the most part.  I didn't expect greatness, so I wasn't disappointed that it was mediocre, but sometimes funny and sometimes even a little touching.  If you are in the mood for a silly, occasionally funny Disney-fied movie, this one isn't too bad.  Though, the friend I saw it with thought it was total crap, so maybe I was just in a good mood that night. :-)",
      "total_reactions": 0,
      "user": "reasonate"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 11,
        "year": 2010
      },
      "score": 5,
      "text": "The formula here is so overused it fails to be charming and just comes out as messy. There are a few moments of clarity brought to you by our star power houses of Sigorny Weaver, Jamie Lee Curtis, and Betty White make it worth a look.",
      "total_reactions": 0,
      "user": "Rumblebeelove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 1,
        "year": 2011
      },
      "score": 1,
      "text": "Marty was the loser whom everyone made fun of in high school including Joanna, her soon-to-be sister in-law. In Marty's opinion, Joanna sing-handedly ruined her life in high school. So the thought of having a sister in-law that was your enemy in high school freaked Marty out. She tries everything to get her brother to realize that Joanna isn't who he thinks she is. Doing everything in her power including destroying her brother's wedding and breaking her brother (literally), Marty, of course realizes that she did the wrong thing. In the end, they get married and lived happily ever after. From the start of the movie, we see they all hated one another and by the end, predictably they made up. The so-called comedy is so dull for the most parts, that only the lowpoints scored giggles. The almost laughter that was probably the highest this comedy can get is between Betty White and Cloris Leachman near the end. You Again's characters are obviously popular, but like the characters themselves, the movie gets old with the predictable story and cheesy dialogue. RazzieBuzz: Worst Actress (Kristen Bell), Worst Picture, Worst Screenplay (if they have this category)",
      "total_reactions": 0,
      "user": "OscarPicks2010"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2011
      },
      "score": 8,
      "text": "This movie is one I really enjoyed, the main character, her mom, and her moms rival were all characters I could relate to and felt sorry for, my only complaint is that you never feel like the main bully gets what she deserves, that flaw aside it is still a good movie.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2011
      },
      "score": 5,
      "text": "Honestly, this movie had a good premise, but was terrible in execution, Not funny, had way to many \"full house music spots\", and  it was un-funny, boring.  I sound like a broken record.",
      "total_reactions": 0,
      "user": "bigjayhoffman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 3,
        "year": 2011
      },
      "score": 4,
      "text": "you again wasn't the most amazing movie out there but it was still a cute little film that to me made my family laugh. I have to admit the acting in it was sometimes to over dramatic, only because the actress herself couldn't fit into a \"royal **** role because shes a true sweet heart (Odette Yustman). She matched the pretty, girl lovable, Joana but as J J she really didn't know how to be a bad girl. not only that but there are a few revisions of the screen play that could have been written better then maybe the movie wouldn't have turned out to look so fake at times. Other then that it was a cute film but it didn't turn out the way I expected it",
      "total_reactions": 0,
      "user": "l_feso"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2012
      },
      "score": 1,
      "text": "Sadly the film has awful actors who don't have chemistry and it manages to put them all together and make a complete unfunny train wreck some people call a movie. I give this film 10%.",
      "total_reactions": 0,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2012
      },
      "score": 9,
      "text": "One of the worst metacritic ratings in my opinion. The movie is really funny, can have much cliches, but is funny. The trama is amazing, when I watching I feel a same sensation when I watch Prom. The trama is about the bullying, but be represented in a light mode, obviusly have some mistakes, and the story is interesting, watch again your worst enemy, they can explote funny situtations. And the cast, OMG! Betty White, Sigourney Weaver, Odette Yustman, Kristen Bell and Jamie Lee Curtis, wow, have a performance for this type of films, funny, not awesome, but funny, are really interesting. The screenplay is good, have some good ideas that don't be explored, but have a good development. The comedy situations are simple but good, and is great. I love You Again is really funny.",
      "total_reactions": 0,
      "user": "MegWhiteley"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 12,
        "year": 2012
      },
      "score": 6,
      "text": "A movie with great actors and fun.",
      "total_reactions": 0,
      "user": "Rikiege"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 12,
        "year": 2012
      },
      "score": 1,
      "text": "Horrible. You Again is an exhausting film that's nothing more than a bunch of ridiculous and implausible events sequenced together for humor, only it's never once funny. Everything about the movie, from the writing to the cast, fails miserably. Shame on whoever produced this garbage. One of the worst films of 2010.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 3,
        "year": 2014
      },
      "score": 6,
      "text": "this is the a step  we should all learn when you meet someone who you know bullied you in highschool get revenge on them . i have seen this movie  to many though thats why i am giving it a 6/10 .",
      "total_reactions": 0,
      "user": "lukechristiansc"
    }
  ]
}