{
  "mc_avg_user_score": 6.2,
  "mc_metascore": 47,
  "mc_mixed_rating_frequency": 3,
  "mc_movie_name": "Young Ones",
  "mc_negative_rating_frequency": 2,
  "mc_positive_rating_frequency": 6,
  "mc_pro_critic_reviews": [
    {
      "critic": "Rodrigo Perez",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 10,
        "year": 2014
      },
      "score": 83,
      "summary": "Young Ones and its serious, bone-dry approach won’t be for everyone. The picture is languidly paced, but its ideas, moods and tones strike many thought-provoking chords."
    },
    {
      "critic": "Clayton Dillard",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 10,
        "year": 2014
      },
      "score": 75,
      "summary": "It avoids the typical trappings of the genre pastiche by utilizing its clear indebtedness to numerous other films as merely a starting point, rather than an end."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2014
      },
      "score": 70,
      "summary": "This spare but potent melodrama revels in the desiccated landscapes provided by South Africa and photographed with dusty purity by Giles Nuttgens. Through his lens, the spectrum of sunbaked skin and parched dunes is as rich as any rainbow."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 10,
        "year": 2014
      },
      "score": 70,
      "summary": "Young Ones is an old-fashioned, worthwhile curio down to the closing credits."
    },
    {
      "critic": "Keith Uhlich",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2014
      },
      "score": 67,
      "summary": "Would that there were more beneath the surface of this strange brew, but it’s certainly compelling while it lasts."
    },
    {
      "critic": "Steve Greene",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "The way it reaches to find the humanity in a place devoid of hope shows admirable attempt at a singular vision. But Paltrow overestimates the timeless nature of the story."
    },
    {
      "critic": "Geoff Berkshire",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 50,
      "summary": "The sophomore effort from Jake Paltrow (“The Good Night”) gets so bogged down in its primal tale of murder and revenge that the most intriguing elements become little more than futuristic window dressing."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2014
      },
      "score": 40,
      "summary": "Paltrow's kitchen-sink visual sense may keep your eyes engaged, but it sucks dry any inherent drama, leaving you with a bunch of characters who feel pegged by a conjurer rather than nurtured from a wretched new Earth."
    },
    {
      "critic": "David Rooney",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 40,
      "summary": "Paltrow shows a capable hand with the actors... However, the characters only intermittently engage our interest."
    },
    {
      "critic": "Glenn Kenny",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 10,
        "year": 2014
      },
      "score": 38,
      "summary": "Paltrow, whose previous directorial feature was the somewhat more apt 2007 showbiz romcom “The Good Night,” is an attentive student of cinema, as his mini-homages to the likes of Antonioni and Lucas in this story testify. But his story is a veritable nothingburger, here and there recalling notes from the likes of “Giant” and “There Will Be Blood,” but never really connecting on levels emotional or intellectual."
    },
    {
      "critic": "Mike D'Angelo",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 10,
        "year": 2014
      },
      "score": 30,
      "summary": "Young Ones looks promising in the early going, when it’s relying on Shannon’s customary intensity and building its harsh, arid world. (Principal photography took place in South Africa.) Shannon quickly disappears, though, and that’s when the dreary plot kicks in."
    },
    {
      "critic": "David Lewis",
      "publication": "San Francisco Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 10,
        "year": 2014
      },
      "score": 25,
      "summary": "There should be drama here, but everything falls as flat as the withered valley floor. Not all is lost: The cinematography and special effects are quite competent. The script just leaves us thirsty for more."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 10,
        "year": 2014
      },
      "score": 20,
      "summary": "Director Jake Paltrow’s stark sense of place fades as familiar genre elements are introduced. It winds up like “There Will Be Blood,” but with H2O, not oil. It’s food for thought, nothing more."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 11,
        "year": 2014
      },
      "score": 2,
      "text": "Boring and forgettable. If you can watch this movie without checking your email, making a sandwich, or generally being distracted by your own thoughts, you've done better than me. The special effects are okay, the plot is minimal, and the impact is non-existent. For what is essentially a drama in a dystopian future, this film was rather undramatic.",
      "total_reactions": 2,
      "user": "ozymandias79"
    }
  ]
}