{
  "mc_avg_user_score": 7.1,
  "mc_metascore": 66,
  "mc_mixed_rating_frequency": 46,
  "mc_movie_name": "You're Next",
  "mc_negative_rating_frequency": 21,
  "mc_positive_rating_frequency": 153,
  "mc_pro_critic_reviews": [
    {
      "critic": "R. Kurt Osenlund",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 100,
      "summary": "Adam Wingard's You're Next brazenly merges the home-invasion thriller with the dysfunctional family dramedy."
    },
    {
      "critic": "Chris Nashawaty",
      "publication": "Entertainment Weekly",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 83,
      "summary": "It's so deliciously twisted, it will make you walk out of the theater feeling like you just endured a grueling, giddy workout."
    },
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 4,
        "year": 2013
      },
      "score": 83,
      "summary": "The filmmakers have crafted seriously derivative fun that plays like \"Scream\" molded with \"Cabin Fever\" in the twisted universe of \"Final Destination.\" It's a familiar ride, but a relentlessly wild one as well."
    },
    {
      "critic": "David Hughes",
      "publication": "Empire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2013
      },
      "score": 80,
      "summary": "While it doesn’t defy genre conventions like \"Cabin In The Woods,\" Wingard’s tale of a dysfunctional family under siege is an outrageously entertaining crowd-pleaser — if you have the stomach for it."
    },
    {
      "critic": "Matt Glasby",
      "publication": "Total Film",
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 80,
      "summary": "Funny and tense, rather than hilarious and terrifying, You’re Next doesn’t rip up the rulebook but it’s definitely read it. If all horror comedies were this good we’d be laughing – and squirming."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 80,
      "summary": "Adam Wingard’s You’re Next strays just enough from formula to tweak our jaded appetites. That it does so without spraying the gore to geyserlike excess says a great deal about Mr. Wingard’s sensibility."
    },
    {
      "critic": "Robert Abele",
      "publication": "Los Angeles Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 80,
      "summary": "The surprisingly adept mixture of tones — naturalism, dysfunctional family satire, winking slasher nostalgia, twisty vengeance thriller — is offbeat enough to keep even hardened connoisseurs of body-count entertainment on their toes."
    },
    {
      "critic": "Joshua Rothkopf",
      "publication": "Time Out New York",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 80,
      "summary": "Nothing here is new, but you can’t call expert craft like this warmed-over. Solidly satisfying with ruthless forward momentum, the film plays like a minor triumph."
    },
    {
      "critic": "Amy Nicholson",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 80,
      "summary": "You're Next streamlines the gory stuff for something truly shocking: good characters.  Not deep, mind you. But characters who are crayoned in bright enough that they're interesting even while alive."
    },
    {
      "critic": "Eric D. Snider",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 80,
      "summary": "An energetic mix of Scream-like dark comedy, senseless violence, satisfying surprises, and good old-fashioned mayhem"
    },
    {
      "critic": "Marc Savlov",
      "publication": "Austin Chronicle",
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 8,
        "year": 2013
      },
      "score": 78,
      "summary": "Wingard’s film is its own subset of fractious family crazy."
    },
    {
      "critic": "Bill Stamets",
      "publication": "Chicago Sun-Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 75,
      "summary": "You’re Next benefits from skilled script-keepers."
    },
    {
      "critic": "Peter Keough",
      "publication": "Boston Globe",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 75,
      "summary": "Like [The Purge and The Conjuring], Adam Wingard’s sly, diabolical, and oddly moral You’re Next draws on the home invasion/haunted house scenario, but outclasses them with its wit, irony, and technically proficient terror."
    },
    {
      "critic": "Kyle Smith",
      "publication": "New York Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 75,
      "summary": "Bloody horror flicks need not be anemic when it comes to intelligence. The victims of You’re Next, as well as their slaughterers, are reasonably smart and resourceful. Their clash may not be as nasty as the battles of academia, but there’s a lot more common sense involved."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 8,
        "year": 2013
      },
      "score": 75,
      "summary": "Written by Simon Barrett, another purveyor of micro-budget carnage, You’re Next boasts a sometimes-uneasy blend of comedy and horror."
    },
    {
      "critic": "Drew Taylor",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 75,
      "summary": "Barrett and Wingard are clever filmmakers, but unlike many modern day horror directors, their cleverness never gets in the way. There's an earnestness to the entertainment in You're Next that is truly admirable, and at the end of the day it's a super enjoyable way to spend an hour and a half."
    },
    {
      "critic": "Barbara VanDenburgh",
      "publication": "Arizona Republic",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 70,
      "summary": "Turns out You’re Next isn’t a slave to horror-movie conventions after all — rather, it’s having tongue-in-cheek fun with conventions while playing up to them, complete with a killer retro ’80s-horror synth score and a gruesome finale that recalls the excess of Peter Jackson’s “Dead Alive.”"
    },
    {
      "critic": "Keith Phipps",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 70,
      "summary": "Though essentially a straight-faced horror film, You’re Next also taps into a rich vein of black comedy."
    },
    {
      "critic": "Dennis Harvey",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 3,
        "year": 2013
      },
      "score": 70,
      "summary": "You’re Next is fairly light on psychological and narrative complexity, but it’s still a good cut above the slasher norm, with a firm grasp on visceral action and the wisdom to place tongue slightly in cheek when things go further over the top."
    },
    {
      "critic": "Lawrence Toppman",
      "publication": "Charlotte Observer",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 67,
      "summary": "Just as I was starting to think of it as a “motiveless psychos terrorize rich family” movie (a la “The Purge”), it gave me good reasons to watch."
    },
    {
      "critic": "Peter Travers",
      "publication": "Rolling Stone",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 63,
      "summary": "The surprise is how effective Wingard is at keeping the atmosphere jumpy and tense. And you can't help rooting for Erin, who could win Survivor if she went on the show. Vinson's take-charge performance is the life of this badass party. When you're ducking in your seat, it's nice to have someone to root for."
    },
    {
      "critic": "Liam Lacey",
      "publication": "The Globe and Mail (Toronto)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 63,
      "summary": "Character development and plotting are rudimentary, though the tongue-in-cheek never gets dislodged while the body count rises."
    },
    {
      "critic": "Kevin C. Johnson",
      "publication": "St. Louis Post-Dispatch",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 63,
      "summary": "Targeted toward horror-film junkies looking for a terror throwback, You’re Next mixes gore and dark humor with yet another home invasion plot line."
    },
    {
      "critic": "Roger Moore",
      "publication": "McClatchy-Tribune News Service",
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 8,
        "year": 2013
      },
      "score": 63,
      "summary": "The frights are passable, the foreshadowing (extreme close-ups of nails being pounded through boards, etc.) telling and the humor — sick as it is — quite funny."
    },
    {
      "critic": "Anna Smith",
      "publication": "Time Out London",
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "A solid watch for gore fans."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2013
      },
      "score": 60,
      "summary": "In the absence of sympathetic characters, a little humor would have gone a long way here."
    },
    {
      "critic": "Stephen Whitty",
      "publication": "Portland Oregonian",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 58,
      "summary": "Although there's a twist in this tale, most of it is stuff we've seen before. And Wingard doesn't think of a new way to show it."
    },
    {
      "critic": "Mark Jenkins",
      "publication": "Washington Post",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 50,
      "summary": "The latest genre exercise from slasher-flick prodigy Adam Wingard (“A Horrible Way to Die”) is at times bloodily entertaining. And if the central plot twist isn’t all that clever, at least the movie offers some motivation for its mayhem."
    },
    {
      "critic": "Joe Neumaier",
      "publication": "New York Daily News",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 40,
      "summary": "Combining the dysfunctional family reunion and the home invasion thriller, You’re Next tries, somewhat valiantly, to add new twists to the usual bloody horror-flick shenanigans. But aside from a few fresh chords, it’s same-old, same-old."
    },
    {
      "critic": "Scott Bowles",
      "publication": "USA Today",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 38,
      "summary": "A film of repetition, a bloody dance consisting of three steps: stab, scream, repeat."
    },
    {
      "critic": "Bilge Ebiri",
      "publication": "New York Magazine (Vulture)",
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2013
      },
      "score": 30,
      "summary": "Maybe, in another time and place, and with different actors and a better director, it might have worked. But this thing collapses right from the get-go."
    },
    {
      "critic": "Rene Rodriguez",
      "publication": "Miami Herald",
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 8,
        "year": 2013
      },
      "score": 25,
      "summary": "You’re Next is built on such an enormous pile of guff, it’s practically insulting."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "Home invasion stories have played a pivotal role in the progression of horror films for quite some time now. However, home invasion films don't necessarily have to be pure horror movies. Some just want to entertain, more than scare. Adam Wingard's latest horror-thriller film”You're Next” wants to do just that.",
      "total_reactions": 2,
      "user": "Aus10B"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "An R rated and more suspenseful \"Home Alone\" type film for horror fans, a Joe Pesci appearance behind the mask would have made it... Fun, gory and awesome female lead. Won't disappoint when compared to latest horror films since \"The Loved Ones\".",
      "total_reactions": 2,
      "user": "Drewby4syth"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "As far as horror movies are concerned, \"You're Next\" doesn't really bring too much innovative material to the table, but it still packs a blackly comic punch as it also delivers a nice package full of thrills.",
      "total_reactions": 1,
      "user": "Compi24"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 5,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "You're Next is a brilliant horror movie.It's smart, clever and stylish. It's a breath of fresh air among all the terrible slasher movies out there nowadays. It doesn't quite revolutionize the slasher genre, but it is definitely a strong comeback. Shari Vinson was magnificent as Erin. She is definitely one of the greatest horror movie leading ladies of all time. She was smart, fierce and an all around bad-ass. The other characters are pretty shallow, spoiled and  two dimensional but when you see this movie you'll understand how it's makes up for this little flaw.  While the movie contained some jump scares, overall it wasn't scary, but that's pretty much standard for a slasher film. But what it lacks in scares it makes up tenfold in the gore department. This film is a roller coaster of carnage and it does so with finesse and panache and features one of the greatest horror movie deaths of all time. This film was getting major hype way before it premiered and by God, it delivers with intensity and ferocity that needs to be experienced way more than once.",
      "total_reactions": 7,
      "user": "schmageggey"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 6,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "One of the better horror flicks I've seen in recent years. I've gotten so tired of these tepidly scary occult flicks like The Conjuring, The Haunting, and even the new Evil Dead. This is a good old fashioned horror thriller, with a nice mix of extreme gore, humor, excitement, irrationality (which morphs into plotty rationality), and some great cheesy/throwback horror music. The lead actress is fantastic. And I was pleasantly surprised to see Amy Seimetz in the cast. (She should be in every movie, huh?) Can't say much more without revealing the plot. Guaranteed, you will leave the theater with a certain song stuck in your head....At least that's all that will be stuck there.",
      "total_reactions": 9,
      "user": "MarcDoyle"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "No, the acting isn't incredible, but the movie is just FUN for a change.  The Aussie lead is awesome, and there's a light-hearted feel to this film amidst the carnage that makes you feel good as you leave the theater.  It's not ponderous.",
      "total_reactions": 6,
      "user": "LamontRaymond"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2013
      },
      "score": 9,
      "text": "The best horror movie so far this year, even better than Evil Dead. You're Next is a true return to form of the slasher movies that dominated 70s and 80s horror. The cast is very strong, particularly the connections of the family are very believable and adds to the tension. However, this movie doesn't try to force itself on being a horror-fest, the director clearly was having fun with this shoot. This movie is campy at the right moments just as it throws in the surprises and jump scares with nearly perfect timing. Although the home invasion premise of the movie something that we've seen a lot before in recent horror or thriller type movies, I cant think of a movie within the past several years that does it with even remotely the thrills that You're Next manages. I can see this one becoming a cult classic, probably something that we'll see Hollywood remake in about 25 years or so and hate the remake because it will miss the damn point. The twist in the final moments of the movie was well done, although predictable if you are a seasoned horror buff.",
      "total_reactions": 6,
      "user": "downphoenix"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "Being one of the most fun movies to come out this year, You're Next is a violent and incredibly entertaining horror-comedy that is both quite funny and full with fun twists. The film is definitely flawed, in which it has a rocky start before it descends into greatness and having not-very-fantastic acting apart from Sharni Vinson who plays to badass lead role and I would have liked the have some closure in the ending, though the end was still pretty fun. In the end, You're Next is a gory good time in theatres.",
      "total_reactions": 3,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 9,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "“It’s a piece of s*** that, from a distance probably looks like a chocolate bar, but when you get closer, you got to come to the terms of    fact that this is a f****** piece of s***.”",
      "total_reactions": 18,
      "user": "Now-Hear-Me-Out"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 4,
      "text": "One of the worst films I have ever seen. The characters actions were so stupid that it was unbelievable and the entire theater was laughing, including me. Acting was sketchy throughout.  The plot was good per say but felt empty. The twist were some what interesting, Camera work was good. The poor acting and moronic characters ruined this for me, especially since I have been keeping tabs on this film since I saw the first trailer. Though I give them bonus point because Sharni Vinson was awesome in it and super attractive.",
      "total_reactions": 4,
      "user": "Cinema_Loot"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "What \"You're Next\" lacks in originality in regards to its premise, more than makes up for it with clever surprises, an infectious energy, and a desire to satisfy rabid horror fans, while also remaining appealing to mainstream audiences. What gives \"You're Next\" a clever twist is how the movie presents itself as just the opposite. The movie also possesses an entertaining sense of dark humor, invigorating a generic storyline that feels revitalized. Director Adam Wingard and Screenwriter Simon Barrett's previous collaboration \"A Horrible way to Die\" (2010), displayed great potential and promise. \"You're Next\" is unquestionably the duo's crowning achievement to date.",
      "total_reactions": 2,
      "user": "Nesbitt10"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "Overall, there’s enough innovation and enthusiasm for the horror genre present in You’re Next to make it worth recommending to gore-hounds and hardcore horror lovers  even though the movie doesn’t succeed at hitting all the big marks it aims for. Just don’t expect to leave the theater feeling all that unnerved or extra conscious about needing to lock your doors, once you get home.",
      "total_reactions": 2,
      "user": "Thegodfatherson"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "You may consider You're Next a cheesy, corny and cliched horror movie, but it is, almost, the opposite of that. You're Next is the new horror movie written by Simon Barret (V/H/S) and directed by Adam Wingard (A Horrible way to die) & (V/H/S). This movie is considered as horror, but I consider it as a dark comedy because yes, although I jumped a couple of times but I laughed much more in this movie. Most reviews are mediocre I agree, it is somehow cliched but it is more twisted, entertaining and funny than cliched, cheesy and corny. The acting is mediocre at times and at times it is somehow good. It is a fresh entry to the horror genre, and one of the better horror flicks I have seen the past recent years. I will purchase it and will watch it again.",
      "total_reactions": 2,
      "user": "MovieGoer14"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 10,
        "year": 2013
      },
      "score": 5,
      "text": "After I saw the trailer when I went to see the movie \"The Conjuring\", I wanted to see the movie so bad. Well I just saw it the same day I wrote this review and it was good. There were some other people that were saying \"Worst movie ever!\" Good horror sequences and unique. I mean, in what other movie do you get to see murderers wear animal masks? You have Ghostface from \"Scream\" wearing a screaming crying mask, Michael Myers from \"Halloween\" wearing a ghost white mask and your Jason from \"Friday the 13th\" wearing your old classic hockey mask. Well the beginning of the movie actually starts with a man and a woman in a house in the forest when you meet fox-face. That's my nickname for him. The words \"You're Next\" written with blood on the sliding glass door was a good job. After that beginning scene, you actually meet the father and the mother of the family. The problem though is that the mother is probably the most overly dramatic character in the movie. She is kind of corny. After everyone arrived at the house, she said like a little speech that was kinda awkward.  After she heard a huge bang and some footsteps above she panics and says to her husband that someone is upstairs. So she says that they should leave but he says that he is going to check it out. She refuses but after he gets a weapon, she finally says yes. It turns out that the noise was caused by their son Crispian. It was the next night that the hunters attack. The actors do a good job except Erin and OH MY GOD she is an idiot. When Aimee got her throat slit by a razor sharp wire right outside the door, she just stood there with a bored-like expression on her face. Not to mention that she is also so dull. She never amazes you and not to mention that she is transformed from a random girl that is trapped in a house to a Arnold Schwarzenegger commando. Fights back to the hunters and not to mention that sometimes she just stands in one place like a statue. Enough about the characters. What about the setting? Fantastic. The house is a nice touch and the corridors are tight and raises the suspension. There is a part when fox-face crept out from under the bed and just not so stealth killed someone (who I am not going to spoil).  The sound is also fresh and hits at the perfect time either after a kill or when a hunter pops out from a corner.  For my full written review, check out http://vgasgames.weebly.com/",
      "total_reactions": 2,
      "user": "VGAS"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2013
      },
      "score": 3,
      "text": "Okay. Let's get this outta the way. This is a Redbox rental...at best. Maybe something you stumble upon searching through Netflix one night. This is definitely not a movie ticket purchase. It's so damn full of cliche and just dumb moments that we've all seen before. I just kept hoping it would turn into something more the entire time, but was disappointed. Some horror movies can be....meh, but at least it was a good time, this wasn't even that.    ***SPOILERS START***    What you see in the first scene is pretty much the entire tone of the movie. Period. I mean, the killers' calling card of \"You're Next\" doesn't even make sense or really apply to anything. It's not like this crew has been on a killing spree and this is their M.O. Just some punks in masks who get hired for a job. The motive for it all is....money? C'mon!!!   ***SPOILERS OVER***. Apologies, for not giving a spoiler-free review, because I hate those too, but this movie doesn't deserve the time or effort to be vague. At the end of the day, make your own decision, but I think you should trust my humble opinion and wait for that $1.50 rental. Til next time!",
      "total_reactions": 2,
      "user": "ramzyx2"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "I always like to separate Horror Movies from Thriller Movies. While the former often involves supernatural element, the latter mostly just involves killing and blood spreading. But all in all, I think both genres belong to Scary Movies.",
      "total_reactions": 2,
      "user": "weillywood"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 0,
      "text": "It is actually criminal that reviewers gave this garbage a good review this is one of the worst movies i have ever seen predictable plot and characters you don't give two  about, and come on are guys with goat masks in janitor costumes scary",
      "total_reactions": 7,
      "user": "Batman97"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "Wow!  Was this supposed to be scary? I thought I was being generous with my 5 rating. It was OK, but no where near as good as people make it out to be.  It seemed like a total B movie, bad dialog, acting, cheesy music. I cannot believe this is 80% on on Rottentomatoes and 67 on Metacritic, unbelievable.",
      "total_reactions": 7,
      "user": "sparkvark111"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "Just a normal horror movie. Kind of like \"The Strangers\".  This movie kind of doesn't make any sense, in a way. And, it isn't even scary. \"The Conjuring\" is a much better choice.",
      "total_reactions": 3,
      "user": "BWETMatangi"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 0,
      "text": "This is by far the Worst movie I have ever seen. I couldn't figure out if it was a Comedy or a Horror movie. The previews you see on tv make it look like its going to be this scary movie and I was so disappointed. Seriously when I read reviews I say to myself \"Oh, everybody is different, I will give it a try\" I'm telling you from a person that loves movies, SAVE your money, or wait till you can get it on DVD of you must punish yourself. The name of the movie should be \"You're next Sucker, got your money\".",
      "total_reactions": 8,
      "user": "MisterBlack"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2013
      },
      "score": 1,
      "text": "Bad editing. Bad writing. Bad cinematography. Bad acting. Bad musical score. Bad \"plot twists\" Bad character development. Bad comedy. Bad mood.",
      "total_reactions": 5,
      "user": "StriderKiwi"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 8,
        "year": 2013
      },
      "score": 8,
      "text": "An extremely enjoyable horror thriller. What's great about You're Next is that the characters are real human beings who exist in more than one dimension, so their deaths are more than just \"Oh damn!\" moments; it really hits you in the gut when one of them is shot through the head with a crossbow. Even the murderers are allowed a certain psychological depth, and this makes what they do all the more horrifying. I also appreciated how realistic the victims' behavior was; that is, much of what they did was stupid and irrational, but in a very believable, sympathetic way. Most people would lose their minds in such a situation. Director Adam Wingard gets this, and as such his movie comes across as something more than a cheap slasher flick. It expertly straddles the line between verisimilitude and snuff, which is what the best of the neo-horror films aim to do.",
      "total_reactions": 2,
      "user": "gimmedatsammich"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2014
      },
      "score": 0,
      "text": "The movie started off extremely slow, but I kept on watching hoping it would get better. But it didn't. The movie has no scares, only laughs. watching this movie, it remind me of home alone and then at the end turns into a Rambo!",
      "total_reactions": 2,
      "user": "MikefromAngus"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 10,
        "year": 2013
      },
      "score": 7,
      "text": "If you could bypass some of the characters' logic and the unoriginal concept, You're Next will be very entertaining film with it's fast-paced thrills and table-turning premise of a home-invasion film.",
      "total_reactions": 1,
      "user": "IAmPhongNguyen"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 1,
        "year": 2014
      },
      "score": 1,
      "text": "Slow pacing at the beginning forced me to FF alot until the killing began and then it was a soul-numbing blood-bath of psychotia. This type of film may work for some but not for me.",
      "total_reactions": 1,
      "user": "EludiumQ36"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2013
      },
      "score": 3,
      "text": "This movie has a great plot, I will give it that. But there was nothing to look forward to since the whole plot was revealed so soon in the beginning of the movie. Plus the fact that the acting was terrible. If you have money to waste and time to kill, go watch it. Then you will see that this movie could have been a classic if it had much better actors in it and the plot was not given away so soon. So in short, the movie needs totally revamped. This is nothing more then a B rated movie gone wrong.",
      "total_reactions": 4,
      "user": "bigfoot6463"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2014
      },
      "score": 6,
      "text": "Nothing about it screams originality, but it still exciting to watch people die in gory disturbing ways. It knows not to take itself seriously and allows for some amusing moments.",
      "total_reactions": 1,
      "user": "Trev29"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "Super violent gory horror movie!!! There isn't one thing impressive in it, so high praise is unjustified. It slightly above average movie, with some plot holes and some interesting twists!",
      "total_reactions": 1,
      "user": "PStakhiv"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 10,
      "text": "This is a great movie, this movie have a new level of horror. Is not easy make a slasher film with something different, but this one make everything cool and interesting.",
      "total_reactions": 3,
      "user": "Luisdark27"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 10,
        "year": 2013
      },
      "score": 6,
      "text": "Hey I wanna give 7 not 6 for the score! So I just submit new score as 8 to combine with 6 to make 7, do you get that? The movie is not so bad, but some scenes were too cruel.",
      "total_reactions": 1,
      "user": "babysanchez"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 6,
        "year": 2015
      },
      "score": 8,
      "text": "Brilliant horror movie with a great plot twist, and many scary scenes. My only problem with this movie is that there were one or two parts in the movie that were slow.",
      "total_reactions": 1,
      "user": "youlouz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "With supernatural killers like Jason, you allow for reality to be questioned, but with reality-based baddies you expect a certain logic. That was the biggest problem with this film: so much of it didn't make sense. The home-invasion scenario has an adult family gathered in the country to celebrate their parents anniversary. One by one they're dispatched with quick brutality by men in dumb animal masks. The action isn't especially original, the scares are basic and there's almost no suspense. If I'd been able to forget about the stupid lapses in reason, it might have been more gripping. \"The Purge\" did it better.",
      "total_reactions": 0,
      "user": "TVJerry"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2014
      },
      "score": 5,
      "text": "Disappointing considering all of the positive reception it got. It's not scary, but then again I wasn't expecting it to be. I was expecting it to be an enjoyable home-invasion flick that provided something new and exciting. Unfortunately \"You're Next\" failed to deliver thanks to it's unlikable characters, bad acting, and unbelievable situations.",
      "total_reactions": 0,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2013
      },
      "score": 6,
      "text": "Nobody understands the fact that this movie was the way it was supposed to be. It's not supposed to be 100% serious and it wasn't 100% jokes. It made fun of itself and all the horror cliche's. Some people need to do more research of their movies before going to see them. You're Next was fun, intense and gory. It was a good time at the movies, simple as that. If you enjoy the evil dead films or slasher films that aren't completely serious then you will enjoy it. If your looking for a movie to scare you to death then look somewhere else. I recommend You're Next but only if you can enjoy a little fun in your horror. 6.5/10",
      "total_reactions": 0,
      "user": "Knicksfan7"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Fast paced, vicious and utterly fun, You're Next is a master-class in horror film making thanks to a fresh concept and a director willing to see it through to the bitter end, the bitter fantastic end. When a family gathers for an anniversary celebration at a country house away from society they find themselves under siege by a group of sociopathic attackers wearing animal masks. However the attackers and the guests soon realize they should be afraid of one of the guests more as they prove remarkably adept at killing people. While some of the performances in the film are dire it also features a standout performance by Sharni Vinson whose character is a wonderful change of pace to the conventional horror movie females, sure she does about the same quota of killing, maybe even lightly more, but You're Next manages to make it seem more realistic. Her status as a masculine female seems assured but the film doesn't ever change her, she is always presented as feminine, feminine force capable of some truly devastating things (her skill with a meat tenderizer alone is worth the price of admission). The film manages to present each of its characters as people even though some are clearly going to suffer the fate of dying early on. Everyone feels like equals as each and everyone of them puts their own effect on the story and the overall feel of this awe inspiring horror flick. While some of the violence takes a turn towards the fantastical as people survive the most disgusting of injuries, its all in the name of entertainment and that's what You're Next is, grade A popcorn entertainment.",
      "total_reactions": 0,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "Best horror film of 2013  even better than Insidious 2 & The Conjuring. It delivers on being sexy, tense, graphic, and the story delivers with a kick-ass heroine. Love that this is an indie success story filled with a bunch of indie-horror filmmakers (Ti West, Adam Wingard, Joe Swanberg, Larry Fesseden).",
      "total_reactions": 0,
      "user": "Friskytiger81"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2015
      },
      "score": 10,
      "text": "WICKED MOVIE. One of the smartest and most horrifying movies I have seen in such a long time. If you like a good thriller, I highly recommend this movie.",
      "total_reactions": 0,
      "user": "ScarTissue1990"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "Combining comedy and horror the way this film did ended up being refreshingly entertaining. It is consistently fun and bursts with mayhem throughout the entirety of the ride.",
      "total_reactions": 0,
      "user": "cFRESHlechner"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 1,
        "year": 2014
      },
      "score": 2,
      "text": "The movie is a complete joke. It reveals itself so early in the film, that the last half hour is nothing more than a bunch of gruesome deaths. The acting was actually scarier than the film and the entire premise was foolish.",
      "total_reactions": 0,
      "user": "csw12"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2016
      },
      "score": 7,
      "text": "You're Next is not particularly scary and any fear it creates is somewhat diminished by the end of the film when you realize what all is happening, but it is still a really fun horror comedy blend that does provide some scares. The acting is pretty solid and the special effects (read: blood) are solid as well. Overall, it does a really good job creating tension and a scary atmosphere thanks to the good direction from Adam Wingard. Plus, the writing really works for the film and it does some fun things with classic horror cliches, even if it largely holds to many of them throughout. As an overall film, You're Next is nothing extraordinary, but it is a fun way to spend an hour and a half if you like horror movies and pitch black humor.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 9,
        "year": 2013
      },
      "score": 8,
      "text": "For lovers of the genre this is a superior horror with a great twist. High on blood and gore, some of which is excrutiatingly felt, and with plenty of jumpy moments to keep any true horror fan ghoulishly happy. In the expectant first hour the tension is palpable and exacerbated by the use of  hand held camera which is highly effective in enveloping us as events start to unfold for the unfortunate family under attack.  Things dip ever so slightly when the culprits are unmasked  (literally) and the reason for the mayhem is revealed, but the film still remain lively and tense. Towards the end some revelations and plot points are predictably signposted in advance, but the last scene raises a deliciously inappropriate chuckle.",
      "total_reactions": 0,
      "user": "foxgrove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 4,
        "year": 2014
      },
      "score": 7,
      "text": "A brutal film from the start, 'You're Next' is relentless in its delivery of gratuitous gore and terror. It avoids the trap that many modern horror films fall into of dragging out scenes in the vain effort to create suspense. While it loses it's stride slightly with the high kill count, this is a refreshing film which smacks you in the face. Or shoots a crossbow bolt into your back. Or obliterates your skull with a blender...you get the idea.",
      "total_reactions": 0,
      "user": "LaGuerta"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 1,
        "year": 2014
      },
      "score": 2,
      "text": "This is just another cheap slasher film that tries to add a slight twist and a little style but overall it fails to add any new ground.  The main female character saves this film from an F.  D-",
      "total_reactions": 0,
      "user": "BrianMcCritic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 8,
        "year": 2013
      },
      "score": 7,
      "text": "While it's not an original movie, and it's nothing compared to \"The Conjuring\", not to steal Nesbitt10's quote but it still applies. What it lacks is all made up for with the scares it offers to deliver. It's really just a surprise to see people start making better and truly scary movies, this for sure is one of them. Overall, it's an entertaining horror flick. Be sure to check out my YouTube channel \"TheMovieManLife\" for all things movies.",
      "total_reactions": 0,
      "user": "Movie1997"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "It's no secret that the Horror genre has gotten rather stale. It's either we get a generic haunted house movie, a slasher flick, or some unnecessary remake. There really isn't much room to do something truly \"unique\" and \"original\". You're Next knows this, and plays with it's premise and provides one of the funnest horror films in recent memory. It's straight to the point, and that's what I love. It's got graphic brutal violence, a bunch of bloodshed, and it's all so much fun. It ends up feeling like a throwback to the Horror films of the 80's. You're Next is an entertaining, fun horror flick with some hilarious scenes thrown in. If your looking for a solid horror movie to watch, this is it. My rating:7.2/10",
      "total_reactions": 0,
      "user": "NBAluke579"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2014
      },
      "score": 7,
      "text": "You're Next completely surprised me and I would have to say that it's one of the better slasher/home invasion films I've seen in a long time. It's clear to see Adam Wingard is a fan of and understands the genre and his overall direction is solid. He's certainly a Director that I'll be looking out for in future. The acting is much to be desired, but Sharni Vinson is a strong female protagonist that you root for. The repeated track 'Looking for the Magic' by the Dwight Twilley Band is great & the genius synth score feels like a throwback to a John Carpenter film. It undoubtedly starts off generically but I got the feeling that the Director was probably poking fun at recognisable horror tropes. Gradually the film becomes more and more intriguing and the final third is thoroughly enjoyable and surprising.",
      "total_reactions": 0,
      "user": "lloydharrison"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 8,
        "year": 2013
      },
      "score": 6,
      "text": "Suspenseful,  a decent plot, and predictable.  This movie was entertaining and I enjoyed.  Don't expect an award-winning movie, instead enjoy it for what it is and you won't be disappointed.  I liked it.",
      "total_reactions": 0,
      "user": "Acceler8n"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 1,
        "year": 2014
      },
      "score": 6,
      "text": "“You’re Next” does do quite a few things right.  The music is fantastic, the overall visual presentation looks tremendous and fits well in the horror/thriller genre and, even though the scares are cheap, they are quite effective.  However, the acting isn’t too special, the story gets repetitive and doesn’t feel like it’s enough to fill up an hour and a half, and the motivation for why the killers are attacking the family is super cheesy and was way too easy for me to figure out very early on in the film.  While the movie does look good, it just feels too much like any other thriller that involves masked men attacking an isolated group of people.",
      "total_reactions": 0,
      "user": "RevRon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 9,
        "year": 2013
      },
      "score": 7,
      "text": "You're Next is a indie horror flix with comedy elements and plenty of jump scares. I am not the biggest horror film fan, but I like having fun with a film and You're Next allows me to do that without me  my pants yet tensions were high and I did jump out of my seat several times. The main character, who carry's the whole film, is strong, likable and bad-ass which is always nice in a home invasion film and the family it's self has charisma and there own personalities even though you instantly start hating some. The film is great and lots of fun but if your looking for a gritty, true horror film this isn't for you but if you what a gory, fun, lighthearted jump scare thrill ride then You're Next is perfect",
      "total_reactions": 0,
      "user": "Arnoldthecow"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 9,
        "year": 2013
      },
      "score": 4,
      "text": "This movie was a bit of letdown. I didn't have high expectations going in, but this movie wasn't even credible in the slightest. I understand that most horror movies generally don't allow the user to suspend disbelief, but this movie takes it to another level. What really made me cringe was the awful dialogue. In particular, the line,  me next to your dead mother.\" Do me a favor. What is good about this movie though, is the sound and camera work. For an independent film, they are very impressive. It's just the poor dialogue, and utter lack of realism that was the letdown. This is basically a modern day \"Scream\". But these days, movies like \"Scream\" are passe. Nothing original here folks. And you know a horror movie is particularly bad when the audience watching it is *laughing* at how bad it is. It was still better than Blair Witch Project though, which was the last independent horror film I saw at the theater. As we all know though, that isn't saying very much. Not a complete waste of money, but not a movie I'd watch again.",
      "total_reactions": 0,
      "user": "MrSquizz"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "Loved it! It's exciting, gory, funny, and sometimes scary. If you're expecting a straight up horror film, You're Next is not that. This a dark comedy/horror. Yes, the acting isn't perfect, but it's not terrible either. What it lacks in the acting department it makes up for with fun, bloody mayhem.",
      "total_reactions": 0,
      "user": "Number1sikko"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 9,
        "year": 2013
      },
      "score": 9,
      "text": "I loved this movie it was very good and such a badass movie the acting is decent but Sharni Vinson was very good and it's really fun and it's entertaing I certainly enjoyed it",
      "total_reactions": 0,
      "user": "Locolocoalex"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "Finally a horror thriller full of blood, suspense, humor and action!  the cinematography it's perfect is not the same cliche when the killers are mysterious and only show his face at the end and never are the victims! and Sharni Vinson was perfect.",
      "total_reactions": 0,
      "user": "skadosmen"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 1,
        "year": 2014
      },
      "score": 10,
      "text": "Good film - the story was very tightly told, great pacing, great acting, outstanding action, and the cinematography was awesome.  On top of all that, I love how the filmmakers turned the home invasion sub-genre completely upside down.  This is the type of film that The Purge wanted so hard to be.  In fact, this is the type of film that so many films want to be like.  In short, this film is amazing.  I watched it twice, something that I rarely do with movies.",
      "total_reactions": 0,
      "user": "himeeg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 12,
        "year": 2013
      },
      "score": 7,
      "text": "Good performances, good direction, good plot, good scares, good scenes of blood, the main actress is overwhelming, with a final good over there.......",
      "total_reactions": 0,
      "user": "ioncezar"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 4,
        "year": 2015
      },
      "score": 5,
      "text": "This film was quite interesting but to be honest it wasn't fully a horror, It was more of a thriller of sorts. There are some pretty cool and creepy scenes in it and you can clearly see where some inspirations for the far greater \"The Guest\" comes from but overall this film kinda seems to fall a little flat. It has a pretty unique premise and showing some of the antagonists emotions and feelings could've worked really well here but in seems like Wingard didn't follow through. He makes a relatively interesting thriller to watch but nothing really sticks out. It's dark and sinister, but nothing that stands out. Acting is not too bad overall but nothing too get excited over. Also, this film suffers from a similar problem \"The Guest\" had. It's exposition is handed to you so obviously and suddenly that it kind of takes away from the film a bit. Worth a pick up maybe for a cheap price but nothing that should be on your \"To get\" list.",
      "total_reactions": 0,
      "user": "oDjento"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "not only was  it **** up, but it was **** up in a smart, and often funny way. Its well filmed, the actors are believable and the twist 's are not as predictable as I thought they would be. Its all very well done. Even the gore effects are top notch.",
      "total_reactions": 0,
      "user": "Brinncdeewhy"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2014
      },
      "score": 9,
      "text": "This was so well done. It has dark comedy and incredibly violent death scenes that leave you thinking \"that couldn't have been better\", and those masks are just as disturbing as they are funny. They didn't bother with the likes of Jason Voorhess or Michael Myers. These killers are entirely killable! So you get that same vengeance theme shared by Last House on the Left and I Spit On Your Grave, however, NO RAPE SCENES! This was great fun to watch and I recommend it to any fan of the genre.",
      "total_reactions": 0,
      "user": "wilsonadams"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 2,
        "year": 2014
      },
      "score": 7,
      "text": "The unique and mysterious horror comedy that brings back the feeling of Wes Craven's \"Scream\" Both witty and horrific \"You're next\" is one brilliant horror film.",
      "total_reactions": 0,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 8,
        "year": 2014
      },
      "score": 8,
      "text": "As someone who is a fan of a lot of horror slasher films its a nice breath of fresh air to watch a film where the leading lady isnt some dumb girl running up the stairs when she should be running out the front door, or is weak, annoying, screaming non stop and manages to survive more on luck than skill.",
      "total_reactions": 0,
      "user": "boy_number_8"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 11,
        "year": 2014
      },
      "score": 8,
      "text": "I actually like this movie it is a kick ass movie that the aussie  girl character is actually smart so why am i giving this movie an 8/10 ? , Face it some of the characters are way to dumb their trying to get them selves killed it annoying me. But i do have to say it's a home invasion thriller it's fun the effects are a kick ass fun that editor/director Adam Wingard really made great shots and cgi it's brilliant. Grade A-",
      "total_reactions": 0,
      "user": "lukechristiansc"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 6,
        "year": 2016
      },
      "score": 8,
      "text": "It was a good slasher/home invasion movie. The acting was good, there was a good amount violence and gore  and the movie was entertaining all the way through. But, the movie is not without imperfections. Some of the decisions the characters take are questionable and the movie is at times pretty unbelievable. Overall, it was a fun surprise and an entertaining movie.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2014
      },
      "score": 6,
      "text": "This was a so-so who-dunnit.  My only comment is that A.J. Bowen is too gay to be desired by his co-star.  Mom/Dad's acting weak.  Wd like to see what happens in You're Next Part Deux.",
      "total_reactions": 0,
      "user": "Jibuti"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 8,
        "year": 2014
      },
      "score": 3,
      "text": "Terrible acting. Decent plot. The characters continuous screaming and yelling gave me a legit headache and made me want to turn it oft but i needed to see if it got better. Thank god i didn't spend the money to see it in the theatres or i may have left.",
      "total_reactions": 0,
      "user": "MsDefibrillator"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 9,
        "year": 2014
      },
      "score": 7,
      "text": "It's not the best horror film of the year, but it's certainly the most entertaining. You're Next is a nice return-to-form for the slasher genre, and it's filled with dark humor and blood. I highly recommend it.",
      "total_reactions": 0,
      "user": "horcrux2007"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 10,
        "year": 2014
      },
      "score": 4,
      "text": "This movie does not deserve the ratings it got; it is a predictable, half action movie with poor actors and thin, fake characters. The plot leaves something to be desired and leaves you cringing in the end with the lame quote \"why not?\"",
      "total_reactions": 0,
      "user": "JackLS"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2016
      },
      "score": 7,
      "text": "I am not a huge fan of the horror genre, but decided to watch this with a friend on DVD.  I wondered at times where the story was headed and as with most in this genre the acting leaves something to be desired.  The plot had some huge gaping holes no surprise here as most do.  Still with all that being said it was watchable and it did make you wonder why everyone was being killed.  I also have to admit there were times in the movie that had its effect which means it made me jump out of my seat  or had me turn my head due to gore.  If your a fan of this type of movie it is above average and better than most with a few twists and turns.  Good for a scary movie night if you haven't seen it as of yet.",
      "total_reactions": 0,
      "user": "horizonbts"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2015
      },
      "score": 7,
      "text": "You're Next really surprised me. I thought it was going to be a run-of-the-mill, cheesy B grade horror movie. But no, it is in its own way original and clever. It is less of a horror movie and more of a dark comedy, like \"American Psycho\" from 2000. It has a lot of witty dialogue and a new take on the home invasion genre. However, the movie does feel stale at times and the killers aren't creepy enough considering they show their real faces multiple times. Overall, You're Next is a solid, entertaining movie. 7/10",
      "total_reactions": 0,
      "user": "BB_Critic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 5,
        "year": 2015
      },
      "score": 9,
      "text": "The story is tight and unwinds smoothly allowing for an intense thrill ride. At first I thought it was going to be one of those slow building horror film's that ends in one twisted, violent displays of violence but \"You're Next\" keeps a pretty chilling, steady pace of non-stop suspense that had me on edge. I have never enjoyed cursing at the people on the screen as I did with this film. I never really noticed any moments where the story became stagnant. Even after the mid-film reveal as to the plot I still found the remaining section of \"You're Next\" just as thrilling as the first half.",
      "total_reactions": 0,
      "user": "A_So_Horror_Fan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2015
      },
      "score": 1,
      "text": "This is the sort of movie that makes you miss MST3K.",
      "total_reactions": 0,
      "user": "adamjneve"
    }
  ]
}