{
  "mc_avg_user_score": 8.0,
  "mc_metascore": 63,
  "mc_mixed_rating_frequency": 3,
  "mc_movie_name": "Zero Charisma",
  "mc_negative_rating_frequency": 1,
  "mc_positive_rating_frequency": 10,
  "mc_pro_critic_reviews": [
    {
      "critic": "Eric Kohn",
      "publication": "Indiewire",
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2013
      },
      "score": 91,
      "summary": "Directors Katie Graham and Andrew Matthews' directorial debut (from Matthews' screenplay) centers on a highly unlikable character who has alienated himself from social responsibility -- and forces you to sympathize with him against all odds."
    },
    {
      "critic": "Alan Scherstuhl",
      "publication": "Village Voice",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2013
      },
      "score": 90,
      "summary": "The comic scenes arc into bleakness, and the bleak ones often collapse back into comedy."
    },
    {
      "critic": "Jordan Hoffman",
      "publication": "Film.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2013
      },
      "score": 90,
      "summary": "Directors Katie Graham and Andrew Matthews create a great framework for the epic nemesis battle, but also know when to pull back to keep the movie grounded in reality."
    },
    {
      "critic": "A.A. Dowd ",
      "publication": "The A.V. Club",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 75,
      "summary": "That it never quite sinks into caricature is thanks to the imposing presence in the lead. Refusing to fish for sympathy, even as his character circles the drain, Eidson delivers a complex, bravely off-putting performance."
    },
    {
      "critic": "Peter Debruge",
      "publication": "Variety",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2013
      },
      "score": 70,
      "summary": "Affectionately captures the tail end of a culture in which specialized dice, character sheets and hand-painted figurines were the gateway to elaborate flights of imagination."
    },
    {
      "critic": "Matt Zoller Seitz",
      "publication": "RogerEbert.com",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2013
      },
      "score": 63,
      "summary": "Zero Charisma is a movie about emotionally inert people who labor mightily to change their lives in small ways, and whose efforts at self-improvement are thwarted by emotional feedback loops that cause them to make the same mistakes over and over. If it were possible to roll your way out of real world crises, these guys would do just fine, but there are no saving throws in life."
    },
    {
      "critic": "John DeFore",
      "publication": "The Hollywood Reporter",
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 9,
        "year": 2013
      },
      "score": 60,
      "summary": "Sam Eidson is perfect for the lead role, but that doesn't exactly guarantee the fanboy crowd will embrace the film."
    },
    {
      "critic": "Jeannette Catsoulis",
      "publication": "The New York Times",
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "Has plenty of humor but no satirical bite."
    },
    {
      "critic": "Scott Tobias",
      "publication": "The Dissolve",
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2013
      },
      "score": 50,
      "summary": "Zero Charisma is a comedy by classification, but its cruelties have a way of turning it into a psychodrama inadvertently. The tone is often as abrasive as its hero."
    },
    {
      "critic": "Bill Weber",
      "publication": "Slant Magazine",
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2013
      },
      "score": 38,
      "summary": "It's a pity that it hews to sitcom-like formula rather than using this bank of knowledge and sympathy to create something more original."
    },
    {
      "critic": "Gabe Toro",
      "publication": "The Playlist",
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 10,
        "year": 2013
      },
      "score": 25,
      "summary": "It’s an ugly, unpleasant viewing experience, one that sees geek culture as a hateful cesspool of exclusion and juvenility, miserable to experience first-hand."
    }
  ],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 10,
        "year": 2013
      },
      "score": 8,
      "text": "Watched as part of the Calgary International Film Festival. Plenty of cringe humor and exposes hipsters for the pop-culture vampires they are for good measure.",
      "total_reactions": 0,
      "user": "CorbeauNoir"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 7,
        "year": 2014
      },
      "score": 10,
      "text": "I'm normally prone to writing rather loooong reviews, but I'll do my best to keep this one nice and simple.  I have been, on-and-off, a roleplayer AND gamemaster myself throughout my 40 years on this plane of existence, and to say that this film is one of the most well-observed and accurate portrayals of not only \"gamers\", but indeed anyone of a decidedly \"obsessive\" nature, is quite an understatement.  What starts out as an only slightly darker version of The Big Bang Theory gradually, inexorably transforms into full-blown black comedy and, by its conclusion, just flat-out poignant drama.  More and more, I found myself watching certain scenes unfold through the gaps of my fingers whilst muttering words such as \"Oh no, dude, oh Lord no, DON'T...\"  Make no mistake, it's THAT uncomfortable at times.",
      "total_reactions": 0,
      "user": "rjmacready"
    }
  ]
}