{
  "mc_avg_user_score": 8.6,
  "mc_metascore": 73,
  "mc_mixed_rating_frequency": 51,
  "mc_movie_name": "Zombieland",
  "mc_negative_rating_frequency": 41,
  "mc_positive_rating_frequency": 907,
  "mc_pro_critic_reviews": [],
  "mc_user_reviews": [
    {
      "neg_reactions": 0,
      "pos_reactions": 11,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 2,
        "year": 2011
      },
      "score": 10,
      "text": "Great zombie comedy/horror film besides Shaun of the Dead. Jesse Eisenberg is great and Woody Harrelson is funny.",
      "total_reactions": 11,
      "user": "jAbMaN"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "Funny is a word that is utilized for stuff that are funny, and Zombieland can take part of the word and fuse it with action. Zombieland rivals Shaun of the Dead , so maybe both have similarities . But who cares, as long as you laugh you will be happy.",
      "total_reactions": 2,
      "user": "Watermelon789"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 6,
        "year": 2012
      },
      "score": 9,
      "text": "More Funny Than Scary!",
      "total_reactions": 2,
      "user": "GagaForGhibli"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 2,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 2,
        "year": 2014
      },
      "score": 9,
      "text": "If you like Shaun of the Dead then you'll love Zombieland. It is the best zombie-film yet and as well as being filled with horror, gore and action it is also filled with comedy.",
      "total_reactions": 2,
      "user": "Daniel2651"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2010
      },
      "score": 10,
      "text": "The greatest comedy of the decade!! Forget the Hangover. I've never seen a zombie movie before, but after watching this, I've become addicted to them!! A fun blast, this movie has many awesome factors. Right from the start, it plunges you right into the simple but hilarious plot. After explaining the hilarious rules, it shows some of the best slo mo I've ever seen. Then, it shows you the characters and launches you into the story. First off, the cast is brilliant. The badass Woody Harrelson, the nerdy Jesse Eisenberg, the smoking hot Emma Stone, and the sassy Abigail Breslin all bring comedy and heart to this movie. Second, the script and dialouge are witty and hilarious. Third, the gore and action are great. The ways they figure out how to kill the zombies are original and hilarious!! Overall, standing out as its own movie rather than just a Romero tribute, Zombieland features a great cast, a great script, and great action than makes it a total blast!!!",
      "total_reactions": 1,
      "user": "Bullet97"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "Who would have thought this would be so good?! It is hardly scary - there are a few scenes, but overall it is rather comical, actually. A very smart comedy, with excellent dialogue and some rather funny plot. The performances are pretty decent, and Bill Murray's cameo performance definitely stands out as one of the most memorable parts of the film. Very funny comedy, worth while!",
      "total_reactions": 1,
      "user": "smijatov"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 8,
        "year": 2010
      },
      "score": 9,
      "text": "World taken over by Zombies, surviving teenager gets ride from Zombie killer, goes after Twinkies, meet some girls, Zombiefest!",
      "total_reactions": 1,
      "user": "ERG1008"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2010
      },
      "score": 9,
      "text": "The humor in this movie makes up for the lack of a plot and therefore i give it a 9 because the humor is everything in a movie and i love it but i deducted a point because the plot wasn't very good and i gave it a 9 because Tallahassee is awesome and i love columbus he is a nerdy little spit *#%$ and i love him for that and the humor in this movie is really good",
      "total_reactions": 1,
      "user": "bubba"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 1,
        "year": 2011
      },
      "score": 9,
      "text": "Zombieland: A darn good zomcom From the opening moments, you know this film is gonna be one fun ride. Zombieland shows the ongoing zombie apocalypse, from the point of view of four characters. Nervous Columbus is the typical unlikely hero, but he and his list are entertaining to watch, especially when the many items pop up at various places throughout the movie. Woody Harrelson basically steals the film as gun-toting, Twinkie loving Tallahassee. His dialogue sparks. The revealation that he lost his son really makes you feel for the character. The sisters, Little Rock and Witchita, run cons on the two males many times through the movie, with them stealing the boys trucks three times. Their chemistry really sparks, and you believe that these two could be sisters, as they set off through the zombie wasteland to visit the theme park they enjoyed back in happier times. And the cameo! Bill Murray appears, scaring Tallahassee and Witchita as he pretends to be a zombie. His cameo was seriously genius, making you laugh throughout all of his scenes. Tallahassee going all geek boy during meeting him is funny as, with them smoking from a bong, to dressing up as ghostbusters. Shame Columbus accidently shoots him, thinking he was really a zombie. To be honest, if Zombies do infest the world, there should be a lot more. Especially running to Tallahassee when hes unloading bullets after finding the redneck truck. Also, some of Columbus' early dialogue had me cringing a bit. The finale: Fighting zombies at the amusement park, from Talahassee on the rollercoaster to locked in the booth whilst surrounded, this ranks up there with the best film zombie fights. Gotta love when the zombies chasing after Columbus get hit by the swinging ride (dunno its name). And the zombie clown. Win! All in all, this was a brilliant zombie film. If it wasn't for Shaun Of The Dead, this would be the best zombie comedy film. Oh well",
      "total_reactions": 1,
      "user": "roddersj04"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "This movie is a must see for any and all zombie fans. There is wonderful camera work, chemistry between the actors and some fantastic zombie effects. Let's not forget the generous nods to great horror flicks of old, and a very special cameo. It's fun and witty, and is one of my new favorite films. Go see this, it is worth every bit.",
      "total_reactions": 1,
      "user": "Rumblebeelove"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 3,
        "year": 2011
      },
      "score": 9,
      "text": "While it misses some opportunities to be funny, it's still a fantastic zombie movie do to the actors, they actually are believable because they act like real people (except maybe Tallahassee), this is still one of my favorite zombie movies, and a must see for fans of the genre.",
      "total_reactions": 1,
      "user": "TheQuietGamer"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2010
      },
      "score": 10,
      "text": "Maybe if comedy movies are like this, critics will respect its genre and can get a highly positive review. Every elements in this movie is perfect. All casts ensemble each character in a great way. The zombies were funny and scary. Its very different to all zombie movies, maybe because it is comedy. No thanks to movies of Jason Friedberg and Aaron Seltzer because its kinda rough and stupid. \"Zombieland\" is better than \"The Hangover\", I can say. I hope the sequel will still average the goodness of its predecessor.",
      "total_reactions": 1,
      "user": "khen001"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 2,
        "year": 2011
      },
      "score": 9,
      "text": "ZOMBIES! What else do you need to know? Has to be one of the best zombie flicks out there. AWESOME music, AWESOME cast, AWESOME effects. Dont get much better then this. If you like blood and zombies then this is purely right down your alley.",
      "total_reactions": 1,
      "user": "MrRiggs"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2011
      },
      "score": 10,
      "text": "Twinkies, zombies, Woody Harrelson playing a total badass and two hot chicks. Plus a nerdy computer geek. What could possibly go wrong. When I first saw the trailer back in 2009, I thought it was just another dumb comedy movie, but instead I was given eye candy every minute, and loved it enough to include it in my countdown of my top favorite movies of all time. Ruben Fleischer should receive a medal. In the words of Tallahassee, time to nut up or shut up!",
      "total_reactions": 1,
      "user": "TheNewSpielberg"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 5,
        "year": 2011
      },
      "score": 9,
      "text": "hahahahahahahahahahahaahahahahahahahahahahahahahahahahahahahahahahah funny movie.  Jesse eisenberg is great.   woody harrelson always will be great.  Bill Murray was hilarious.",
      "total_reactions": 1,
      "user": "lovemusic"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 6,
        "year": 2011
      },
      "score": 8,
      "text": "One hell of a zombie flick! Finally something innovative and new. This movie was amazingly well done and had GREAT humour! I enjoyed every minute of it.",
      "total_reactions": 1,
      "user": "ZiggyStardust"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 7,
        "year": 2011
      },
      "score": 10,
      "text": "Completely innovative and refreshing using a completely stale and unimaginative setting -- a Zombie Apocalypse.  The character development was satisfying and the comedy was very entertaining.  This is still one of my favorite comedies in my 22 years of living.  The chemistry between Harrelson and Eisenberg is one that I hope to see again in the near future.",
      "total_reactions": 1,
      "user": "Aodecim"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 9,
        "year": 2011
      },
      "score": 10,
      "text": "All I can say is, firgin hilarious!!!! Very quotable. I find myself accidentally reciting lines from this movie all the time. Good flick to own and enjoy more than once.",
      "total_reactions": 1,
      "user": "ccarroll21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 8,
        "year": 2012
      },
      "score": 9,
      "text": "A great zombie movie, who knows comedy and horror merge in the right dose, no words to describe, everything fits perfectly in this film, you want excitement? watch this movie, you want comedy? watch this movie, you want to terror? watch this movie!",
      "total_reactions": 1,
      "user": "vini1904"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 3,
        "year": 2013
      },
      "score": 10,
      "text": "Finally something has come along to rival the brilliance of Shaun of the Dead. Zombieland stars Jesse Eisenberg, Wood Harrelson, Emma Stone and Abigail Breslin as they embark on finding a safe zone away from their post-apocalyptic nightmare, but all the trouble isn't necessarily from the undead.",
      "total_reactions": 1,
      "user": "StevenF"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "this movie was awsomely funny it deliverd in every way possible. im glad i payed to see this movie. it had action, comedy, and cutegirls how could any other movie be this good.... beside the Scream Franchise",
      "total_reactions": 1,
      "user": "Wesfan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 6,
        "year": 2012
      },
      "score": 10,
      "text": "I love the idea of the movie, it is definitely aimed for teenagers and that's what I am. This is the best zombie comedy out there (I don't take this as a horror movie) with it's stereotypical faces and outstanding storytelling (I fell in love with the style).",
      "total_reactions": 1,
      "user": "Militaizi"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 8,
        "year": 2012
      },
      "score": 10,
      "text": "A phenomenal film which belongs in the same league as Shaun of the Dead when comparing horror/comedies. Woody Harrelson was fantastic as was Jessie Eissenberg. They complement each other very well and obviously are juxtaposed to Emma Stone and Abigail Breslin. I thought that the pacing as well as the emotional arc suffered by a few of the characters really suited the film. This will surely become an all-time classic.",
      "total_reactions": 1,
      "user": "dev92"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 23,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "In my opinion this is the perfect film. There is comedy, action, sadness, romance and bromance all rapped up with a well acted believable cast with a well thought out plot to entertain anyone that isn't a complete idiot. I understand that everyone's taste in films is different but anyone who puts rates this film any less than a 7/10 clearly has some personal issues with something associated with the film and needs to be ignored because the film itself has very few flaws. I'm not going to list flaws because if I do you will just spend the whole film looking for them and you won't be able to enjoy it properly. I'm not usually one for watching films more than once or twice unless they are very good but I've watched this one at least a dozen times which shows that this is truly the most entertaining film you will see for a long time.",
      "total_reactions": 1,
      "user": "Fadam_G"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 11,
        "year": 2012
      },
      "score": 10,
      "text": "Utilizing a killer blend of exceptional humor and eye-catching violence, \"Zombieland\" is an immaculate modern comedy featuring some utterly lovable characters.",
      "total_reactions": 1,
      "user": "Compi24"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 4,
        "year": 2013
      },
      "score": 9,
      "text": "A solid comedy blended nicely with Horror to make one heck of a film! I've seen it quite a few times now but it never gets old and it is thoroughly entertaining despite only really featuring four characters, all whom do a great job. There is enough clever comedy in there to keep you laughing, as well as watching out for the zombies ready to give you a good jump! It won't be a film for everyone, but I think it's one that most would find it hard not to enjoy!",
      "total_reactions": 1,
      "user": "survivorfan989"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 4,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 7,
        "year": 2014
      },
      "score": 9,
      "text": "Zombieland is a very funny horror comedy similar to Shaun Of The Dead. The movie is America's version",
      "total_reactions": 5,
      "user": "TylerDurden900"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 3,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 4,
        "year": 2012
      },
      "score": 10,
      "text": "With Zombieland's incredible cast, and its cool, visual style, and Zombieland managing to be funny, scary, and a great action movie. Zombieland brought life back to the Zombie genre. I give this movie 96%.",
      "total_reactions": 4,
      "user": "heyitsmegrif4"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 9,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "\"Zombieland\" is a rare movie that actually criticizes the world with its laughs and scare. It's a movie you would despise first and love later.",
      "total_reactions": 13,
      "user": "grandpajoe6191"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 9,
        "year": 2010
      },
      "score": 10,
      "text": "One of the most entertaining movies i've seen in a long time. Along with a great cast comes a simple yet very funny and spectacular plot. Continuous laughter and fun. Very good movie.",
      "total_reactions": 2,
      "user": "Razv"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 6,
        "year": 2011
      },
      "score": 9,
      "text": "A little cliche? Sure. But Zombieland is one hell of a good time, in fact, one of the best comedies I have seen in a long time. Thanks to a strong cast and characters, awesome action, awesome dumb slapstick as well as smart dark humor, it is ingenious and entertaining. See it",
      "total_reactions": 2,
      "user": "Moviebuffreview"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "I think the movie is a tad overrated in some aspects. It's a good movie, but not THAT good. It's got what you would expect from a zombie movie, blood and guts and weapons and YES, zombies! The bad thing is for me, this is not a  film that I could watch again and again. The storyline is okay and some parts are quite funny, but the moments aren't as good anymore when you watch it for a  second time, which is disappointing. A good zombie movie, though there are better ones out there.",
      "total_reactions": 2,
      "user": "MediaCritic"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 2,
        "month": 5,
        "year": 2011
      },
      "score": 5,
      "text": "Initially enjoyable undead farce, but loses pace mid way and descend into looney-tunes denouement. The appearance of Bill Murray is an entertaining novelty, but is hardly 'genius' parody.",
      "total_reactions": 3,
      "user": "Morpheus00"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 6,
        "year": 2013
      },
      "score": 6,
      "text": "As you might expect for this genre, it's quite gory, so don't go expecting a light 'R' rating. But if you can handle some bloodshed, no, make that a substantial amount of bloodshed  but perhaps I should add in a comic environment  there's some pretty funny stuff here. Woody Harreleson and Jesse Eisenberg make an amusing odd couple and Emma Stone was fine for this material, although she and Abigale Breslin had slightly less to do.",
      "total_reactions": 3,
      "user": "morfil"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 22,
        "month": 12,
        "year": 2011
      },
      "score": 3,
      "text": "Its ok but far from perfect. While the premise of the film was good and the first few minutes were good, It all goes swiftly down hill and actually gets really really boring.",
      "total_reactions": 5,
      "user": "spadenx"
    },
    {
      "neg_reactions": 6,
      "pos_reactions": 1,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 3,
        "year": 2012
      },
      "score": 3,
      "text": "A sick and stupid film. Zombieland tries to be funny but just comes across as a  stupid movie with lots of gore. Nothing different then any other zombie movie except this one tries to be funny. What a shame.",
      "total_reactions": 7,
      "user": "csw12"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "The movie is great popcorn entertainment, and charming characters make it even better. It's too bad it couldn't have been a little funnier at some points, because by the time the end credits were rolling I felt like the plot had missed some potential for comedy. It's still a great movie to watch with friends though.",
      "total_reactions": 2,
      "user": "DeVr33z"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 30,
        "month": 11,
        "year": 2010
      },
      "score": 8,
      "text": "A gory and mostly hilarious zombie comedy second only to \"Shaun of the Dead\". There are graphic titles with rules for survival, there is ironic narration, there is chewing entrails, there is Zombie Kill of the Week and zombie Eddie Van Halen, but there are also true, deeply human emotions. And a small but awesome cast of survivors.",
      "total_reactions": 2,
      "user": "KundK"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "A good film that doesn't require your up most attention. Great cameo from Bill Murray, it does what it is supposed to do with the gore and the laughs and it exceeded my expectations.",
      "total_reactions": 2,
      "user": "Paxster"
    },
    {
      "neg_reactions": 3,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "The first 10 minutes may suggest otherwise, but Zombieland somehow manages to amusingly gross you out with much violence, keep you chuckling at the jokes the whole way through, and also seem touchingly sad at brief moments.",
      "total_reactions": 3,
      "user": "GavGav96"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 7,
        "month": 10,
        "year": 2011
      },
      "score": 7,
      "text": "Pretty goddamn stupid, but fun in those terms. I don't think that I ever issued any laughter when I saw this movie, but what actually ensued was entertainment. Something about seeing some zombies die and a nerd get a girl appeals to me. Not to a standard to where it's common, but to a degree of moderate entertainment. Nothing especially great or remarkable, but somewhat worthwhile.",
      "total_reactions": 2,
      "user": "Justinavery7074"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 10,
        "year": 2010
      },
      "score": 8,
      "text": "very entertaining and very funny",
      "total_reactions": 2,
      "user": "MovieLonely94"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 13,
        "month": 12,
        "year": 2010
      },
      "score": 8,
      "text": "I have a feeling that people are actually going to enjoy this movie. If the movies Dawn of the Dead and Shaun of the Dead had a baby and chose a Michael Cera wanna-be to be the main character, they would name their undead child \"Zombieland\". Destined to be a cult classic, \"Zombieland\" has everything a fan of zombie movies would ever want, comedy and gore. Director Ruben Fleischer took a risk at making another zombie movie when the genre is already so saturated with mediocre films, but for some weird reason \"Zombieland\" was able to stand out amongst the crowd. Maybe it was the casting of Woody Harrelson?",
      "total_reactions": 1,
      "user": "PYRiAH"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 5,
        "year": 2011
      },
      "score": 7,
      "text": "Youâ",
      "total_reactions": 1,
      "user": "jimmytancredi"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 14,
        "month": 5,
        "year": 2011
      },
      "score": 6,
      "text": "A pretty decent \"comedy\" zombie flick at best...  well, to be honest, I wouldn't even put it into being funny at all, but the characters were .. kinda interesting.  uhmn...",
      "total_reactions": 2,
      "user": "EmuChicken"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "\"Zombieland\" One Line review! (B+)!",
      "total_reactions": 1,
      "user": "LevelsAndGear"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 9,
        "year": 2011
      },
      "score": 7,
      "text": "A really good zombie comedy movie with rising stars Jesse Eisenberg, Emma Stone, and Abigail Breslin. Not to mention the great career turnaround from Woody Harrelson (See the Messenger).",
      "total_reactions": 1,
      "user": "j30"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 15,
        "month": 8,
        "year": 2011
      },
      "score": 1,
      "text": "An unintentional antithesis to Dawn Of The Dead. Could've been so much better as it was initially promising. Irritating characters, stupid plot, clichÃ©d, dumbed-down and far too \"Hollywood\".",
      "total_reactions": 1,
      "user": "AlienSpaceBats"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 10,
        "year": 2011
      },
      "score": 6,
      "text": "Zombieland is a competent zombie comedy and doesn't push for anything else. In this regard it succeeds because it provides some very funny moments (thanks mostly to Woody Harrelson) and does have the feel of a zombie film. However it doesn't work because without striving for anything, this film always feels like it is missing something. It feels as if it is half a film with some of the obvious and interesting questions asked by the film left completely unanswered in favour of a joke about a twinky (funny as they are). The whole purpose of Zombieland is to entertain and because it lacks that feeling of being complete it doesn't do its job. Also, Jesse Eisenberg is boring as the lead.",
      "total_reactions": 2,
      "user": "hoops2448"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 7,
        "year": 2012
      },
      "score": 7,
      "text": "If this was supposed to a zombie comedy, I wasn't sure which I saw most of. There were some awesome jokes, but I felt they became a little too few and far between. I also think the pacing was also a little uneven, because considering it was barely an hour and a half it was a little slow at first and then sped up. I preferred the characters and more or less the ending as that's when it had a little more depth. The rules made up by Columbus were pretty awesome though - and pretty useful when a real zombie apocalypse happens.",
      "total_reactions": 1,
      "user": "EssenceOfSugar"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 7,
      "text": "ZOMBIELAND is a pretty good movie, but I probably expected too much from what the movie turned out to be.",
      "total_reactions": 1,
      "user": "BrandonBonasera"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 11,
        "year": 2011
      },
      "score": 0,
      "text": "POINTLESS! it is beyond me how anyone could possible want to direct or produce this so called 'film'. However, if this is not bad enough, people actually watch it and get a sense of entertainment off it.",
      "total_reactions": 4,
      "user": "FLYINGTOADXX"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2012
      },
      "score": 8,
      "text": "This is a twisted comedy that just lets loose and has one laugh after the other. Killing zombies looks like so much fun. Wish I could get in on the action. Great cast!",
      "total_reactions": 1,
      "user": "Trev29"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 10,
        "month": 3,
        "year": 2013
      },
      "score": 6,
      "text": "All it takes is a few simple rules to survive Zombieland, the world that has been left behind after a deadly virus turns most of the population in to flesh-eating monsters. At least that is how Columbus has managed to stay alive up until he teams with Tallahassee on the road home to find his parents. The two are taken hostage by a pair of crafty sisters along the way, who convince them to travel together to the Pacific Playland amusement park in Los Angeles, which is supposed to be a safe haven from zombies. Needless to say, they are in for a bumpy ride! What is perhaps the most irritating thing about ZOMBIELAND besides the annoying characters and directionless plot is the fact that there are hardly any zombies in it to begin with. Why travel cross-country on the chance that some mythical amusement park might be zombie-free when the group only encounters a few zombies in the first place? The survival rules would have been much funnier if they had not already been used years before in Max Brook's infinitely superior Zombie Survival Guide. Jesse Eisenberg proves that he is the poor man's Michael Cera by offering up another wimpy performance with worse comedic timing than ever. Emma Stone is just as bad, and can't be taken seriously in her role. Thankfully, Woody Harrelson comes along to provide us with some temporary relief as the Twinkie-starved Tallahassee, who takes a great deal of pleasure in dispensing pain. The climactic battle at Pacific Playland is short-lived, and hardly worth the wait when the excitement of fighting zombies at an amusement park is squandered on a few measly rides. With the exception of the film's one notable cameo, ZOMBIELAND is a laughless comedy with hardly any horror that is not nearly as clever or witty as it is commonly made out to be. -Carl Manes",
      "total_reactions": 1,
      "user": "ILHM"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 7,
        "year": 2012
      },
      "score": 8,
      "text": "To be honest I loved this movie and I think the main reason for this is the cast. I didn't even recognise Woody Harrelson at first but his character was so cool and funny. Jesse Eisenberg reminded me of Jonah Hill playing the typical geeky guy who is hopeless with girls, but I'm glad to see someone else in this role because Jonah Hill has played this kind of character too many times. Also the two sisters in Emma Stone and Abigail Breslin were devious and brilliant, it was nice to see the star from Little Miss Sunshine in a much more grown up role and Emma Stone was just gorgeous as usual.  I especially liked the way the rules dropped down throughout the film and the plot was decent, however it seemed to lose pace in the middle of the film. I would love to see a sequel with a bigger budget and more zombies. Definitely my favourite Zombie comedy film to date. 8/10",
      "total_reactions": 1,
      "user": "ChrisFarnworth"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 1,
        "year": 2014
      },
      "score": 7,
      "text": "Well, this movie is just okay. I mean it's nothing more besides good actors/convincing characters, but the length is too short to expose them or to tell a good story. So there is no actual plot and nothing interesting happens. | found out that this movie was made out of a pilot episode for the TV series, that's how it really feels.",
      "total_reactions": 1,
      "user": "StaticSpine"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 18,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "Double hitting head smashing comedy",
      "total_reactions": 1,
      "user": "dante_finn"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 5,
        "month": 1,
        "year": 2014
      },
      "score": 8,
      "text": "Cruelmente divertido",
      "total_reactions": 2,
      "user": "Iky009"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 3,
        "year": 2013
      },
      "score": 5,
      "text": "The uninteresting plot  caused the film to be boring and lame, although Woody Harrelson and Emma Stone  helped enhance the quality. The special effects makeup was very realistic.",
      "total_reactions": 1,
      "user": "sil3nt_nick"
    },
    {
      "neg_reactions": 4,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2014
      },
      "score": 2,
      "text": "An interesting premise leads to some decent, though shallow situations, which lead to a pretty formulaic ending that feels like a TV movie, and many loose ends are left unsatisfied.",
      "total_reactions": 4,
      "user": "displeased"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 31,
        "month": 8,
        "year": 2013
      },
      "score": 5,
      "text": "It was very good. Very scary and funny too. I love zombie films. That's why, before I see it, I was sure that I would like it. Bravo!!! Very Good!!! I am waiting like crazy for the second chapter.",
      "total_reactions": 1,
      "user": "JohnnyStephens"
    },
    {
      "neg_reactions": 1,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 3,
        "year": 2014
      },
      "score": 8,
      "text": "Zombieland is the perfect mix of comedy, horror, and zombie gore put together to be a film. The Acting is top  notch and the effects are even better. Not to mention the plots originality is amazing. Great film, two thumbs up.",
      "total_reactions": 1,
      "user": "FilmVirtue"
    },
    {
      "neg_reactions": 2,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 4,
        "year": 2015
      },
      "score": 1,
      "text": "Worst zombie movie ever?. They tried to funny but actually, is shameful. I give one point because Emma and Abigail are great actresses. Wouldn't recommend it, or watch it again.",
      "total_reactions": 2,
      "user": "giankitax"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 1,
        "month": 9,
        "year": 2010
      },
      "score": 9,
      "text": "I thought it was great! Very little serious, but mainly focused on funny and it was. The only reason I don't rate  higer was because of the talking...it eventually got annoying when he kept mentioning the rules at the end.",
      "total_reactions": 0,
      "user": "gofigure"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 20,
        "month": 4,
        "year": 2014
      },
      "score": 8,
      "text": "Columbus (Eisenberg) is trying to return to his home town amongst a zombie apocalypse when he runs into Tallahassee (a superbly deadpan Harrelson) and thus begins a cross country trek that see’s the pair, amongst other things, meeting up with a pair of grifters and visiting the home of Bill Murray.",
      "total_reactions": 0,
      "user": "drlowdon"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 5,
        "year": 2011
      },
      "score": 8,
      "text": "A+ for quality quips.",
      "total_reactions": 0,
      "user": "gleenobly"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 19,
        "month": 10,
        "year": 2011
      },
      "score": 8,
      "text": "The main reason I like Zombieland is that it is what it is. It's a good old-fashioned road movie...with zombies. Some may argue it's a bit thematically empty, but I see that as part of its charm - it's as bright, noisy and messy as any day at the fairground (which, funnily enough, is where the finale takes place). There's thrills, laughs and zombie-splatting aplenty, and we get to spend our time with some thoroughly likeable characters. Undeniably it's Woodie Harrelson's movie, as his zany, zombie-killing cowboy Tallahassee completely steals the show. Perhaps you could hope for a little more below the surface of the film (Shaun of the Dead for instance, would hit Zombieland out of the park in terms of pure heart), but really it's all down to what you're looking for in a Zom-Com. Zombieland really doesn't have any sort of agenda - so it might be a little brainless, but it's completely unpretentious at the same time, which makes a nice change in an age of over-thought, over-blown critiques of modern society.",
      "total_reactions": 0,
      "user": "Halfwelshman"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 26,
        "month": 5,
        "year": 2012
      },
      "score": 10,
      "text": "This mashup of scary, action, and comedy has rarely worked better, and theres a bit of a heart here as well.",
      "total_reactions": 0,
      "user": "Zilcell"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 12,
        "year": 2011
      },
      "score": 8,
      "text": "(January 14, 2010)",
      "total_reactions": 0,
      "user": "T-rAv"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 2,
        "year": 2012
      },
      "score": 8,
      "text": "I love every second of this movie. Zombieland just has more style than any other zombie flick and it's really freakin hilarious. I love the opening credits!",
      "total_reactions": 0,
      "user": "TTW107"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 12,
        "year": 2012
      },
      "score": 8,
      "text": "As gory as \"Dawn of the Dead\" and (almost) as funny as \"Ghostbusters\", this is satisfying, fairly low-stakes comedy that you lets relax, laugh and have a good time killing zombies.",
      "total_reactions": 0,
      "user": "Zegilgamesh"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "Packed to the brim with horrifically funny violence and jokes, Zombieland is a fun film featuring some deadly writing and killer direction from Ruben Fleischer (who may be a one-hit wonder, sadly). Jesse Eisenberg is very good in the lead role, Emma Stone and Abigail Breslin are also both very strong, and Woody Harrelson was born for this role. Nothing like watching Woody massacre zombies with the kind of glee only he can show, while being oddly vulnerable at the same time. A funny film, the romantic elements do not feel forced, neither do the emotional moments. As gory as a zombie apocalypse needs to be, even the violence manages to be comedic here as they manage to suck every joke they can out of everything going on, which is great. I love when films do that. Overall, Zombieland may not be finding a place in the Library of Congress any time soon, but it is still a very fun and well made film.",
      "total_reactions": 0,
      "user": "Spangle"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2013
      },
      "score": 8,
      "text": "Hilarious and violent...sounds silly, but Zombieland isn't. It's the perfect combination of both; it's a film well-done. Perfect cast of Jesse Eisenberg, Woody Harrelson, Emma Stone, Abigail Breslin, and of course the always humorous Bill Murray. Well written. Awesome action and violence. Great humor. A seriously great film! One of the best comedies of 2009.",
      "total_reactions": 0,
      "user": "worleyjamers"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 21,
        "month": 12,
        "year": 2012
      },
      "score": 10,
      "text": "The team up was great...",
      "total_reactions": 0,
      "user": "MontiYan"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 17,
        "month": 11,
        "year": 2015
      },
      "score": 9,
      "text": "(Note: I devised my own scoring system, which works as follows: 1 for bad, 5 for mwah, 9 for good. 10 for superb.)",
      "total_reactions": 0,
      "user": "MeritCoba"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 4,
        "month": 7,
        "year": 2015
      },
      "score": 8,
      "text": "I love zombies movies and this one was really good even though he is pretty overrated.The acting is good,the story is not original but interesting and the movie has some blood.",
      "total_reactions": 0,
      "user": "Meth-dude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 16,
        "month": 4,
        "year": 2015
      },
      "score": 10,
      "text": "One of the best zombies out there staring some of my favorite actors! You should check this out! It's the best you can get it around 5 bucks now at big lots or walmart,ebay.",
      "total_reactions": 0,
      "user": "Themazedude"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 25,
        "month": 4,
        "year": 2015
      },
      "score": 8,
      "text": "Simply put, most horror films are not scary. There are exceptions, of course, but those are increasingly rare. I think the last horror movie that had me on edge may have been The Mist, and that was released two years ago. Nevertheless, the genre remains incredibly popular, so what better way to populate it than with movies that recognize the comedic potential of many staple horror situations? What was once an obscure and often derided cinematic category, the \"horror comedy,\" has come into its own. Films like Sam Raimi's Evil Dead II and Army of Darkness, Don Coscarelli's Bubba Ho-Tep, Michele Soavi's Cemetery Man, and (most obviously) Edgar Wright and Simon Pegg's Shaun of the Dead have paved a path that allows productions like Zombieland to make their road trips with ease. The key with this movie, as with the others (and many more like it) is that, although there are \"boo!\" moments and gore, comedy always trumps horror. The production wants viewers to laugh; if they leave the theater without doing so, the filmmakers have failed to do their jobs. Zombieland is funny - sometimes very funny - and has a clever script. Director Ruben Fleischer, making his feature debut, and screenwriters Rhett Reese & Paul Wernick have accomplished what they set out to achieve.",
      "total_reactions": 0,
      "user": "MovieManiac83"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 29,
        "month": 6,
        "year": 2015
      },
      "score": 10,
      "text": "Absolutely incredible in every aspect—storyline, running gag, character portrayals (I mean, come on. Jesse, Woody, Emma and Abigail were awesome), zombie concept and effects. It was a brutally fun adventure filled with friendship, love, and sense of belonging.",
      "total_reactions": 0,
      "user": "LizzyBennet"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 3,
        "month": 12,
        "year": 2015
      },
      "score": 8,
      "text": "A great adventure -themed zombie apocalypse that has great touch of horror , action and comedy without missing . Well rather I have and the rules to survive the zombie apocalypse, hilarious and entertainer .",
      "total_reactions": 0,
      "user": "CineAutoctono"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 8,
        "month": 10,
        "year": 2015
      },
      "score": 7,
      "text": "I absolutely shat my pants laughing, however there is a couple of things that I thought were just annoying and unfunny. This didn't really scare me much and I hate horror, but this is stupid funny and will bring viewing pleasure for anyone who enjoys comedy/horror movies.",
      "total_reactions": 0,
      "user": "OzzieViking"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 28,
        "month": 6,
        "year": 2016
      },
      "score": 0,
      "text": "There is not a single thing I enjoyed about his movie, I do like Woody Harrelson and Emma Stones in their other movies, but this was just border line BORING, Im not sure what they were going for I can't tell if ti's comedy or action, because it's definitely not a movie to be taken seriously, so i guess it's trying to be funny, but theirs no jokes in this movie, they don't even try to be funny, and the zombies just made it worse, I know this released befor the walking dead, and im not fanboying but any other zombie show, or movie, needs to take notes, because the amount of detail and hours they put into their zombies is just breathtaking, they even win awards everyyear for best make up on a tv show, anyway this movie is just boring as hell, and i just don't know how any one enjoyed it but thats why were all so different.",
      "total_reactions": 0,
      "user": "gdiego135"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 24,
        "month": 2,
        "year": 2016
      },
      "score": 8,
      "text": "Sorry, zombie killers, but your movie's getting taken over by zombies and you can't even kill them all without being infected by a zombie. Sorry, pitiful king, but the zombie king takes over the throne on Zombieland.",
      "total_reactions": 0,
      "user": "EpicLadySponge"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 6,
        "month": 3,
        "year": 2016
      },
      "score": 10,
      "text": "For Whom the Bell Tolls. Nuff said    .",
      "total_reactions": 0,
      "user": "ILikeBadMovies"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 27,
        "month": 3,
        "year": 2016
      },
      "score": 8,
      "text": "There is no denying how good this movie is. It is funny and so entertaining. The only problem is it goes on a bit too long. That's it! It is such a good movie especially for starting the Zombie phase.",
      "total_reactions": 0,
      "user": "AaronWasserman1"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 11,
        "month": 5,
        "year": 2016
      },
      "score": 8,
      "text": "Best comedy zombie movie there is imo. I like a lot of the actors in it tho so my opinion might be a little bias.",
      "total_reactions": 0,
      "user": "avamiller21"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 12,
        "month": 7,
        "year": 2016
      },
      "score": 10,
      "text": "Shaun of the Dead was a great British horror comedy and with Zombieland,America has a great horror comedy.now.",
      "total_reactions": 0,
      "user": "JSpice50"
    },
    {
      "neg_reactions": 0,
      "pos_reactions": 0,
      "review_date": {
        "__type__": "datetime.date",
        "day": 9,
        "month": 10,
        "year": 2016
      },
      "score": 10,
      "text": "Just amazing. One of the best zombie movies ever made. It is very well written and the actors did an awesome job. It is that perfect blend between comedy, action and a slight bit of horror.",
      "total_reactions": 0,
      "user": "Castiel_Angel"
    }
  ]
}